{"head":{"title":"0.0 Giới thiệu về series tutorial","route":"0/0-gioi-thieu-ve-series-tutorial","id":29402,"description":"Tóm tắt về bản thân  Minh tên Lê Trần Đạt, 28 tuổi, là lập trình viên lập trình nhúng, ngoài làm việc mình thích dạy học online và viết. Tự…"},"body":"\n<p>Đúng với thời gian dự kiến của khóa học C++ mà <a class=\"mention\" href=\"/users/ltd\">@ltd</a> đã đề ra, hôm nay ngày 1/7/2016, chúng tôi cho ra mắt bài học đầu tiên trong loạt bài hướng dẫn lập trình C++ dành cho những người mới bắt đầu học lập trình.</p>\n\n<aside class=\"quote\" data-post=\"1\" data-topic=\"24016\">\n  <div class=\"title\">\n    <div class=\"quote-controls\"></div>\n    <img alt=\"\" width=\"20\" height=\"20\" src=\"/user_avatar/daynhauhoc.com/ltd/40/1016_1.png\" class=\"avatar\">\n    <a href=\"//daynhauhoc.com/t/gioi-thieu-ve-khoa-hoc-c-danh-cho-nguoi-chua-biet-hoac-biet-mot-it-ve-lap-trinh/24016\">Giới thiệu về khóa học C++ dành cho người chưa biết hoặc biết một ít về lập trình</a> <a class=\"badge-wrapper  bullet\" href=\"/c/dev-chat\"><span class=\"badge-category-bg\" style=\"background-color: #25AAE2;\"></span><span style=\"color: #FFFFFF;\" data-drop-close=\"true\" class=\"badge-category clear-badge\" title=\"Thảo luận quy trình thiết kế phần mềm, tài liệu, nghề nghiệp\">dev chat</span></a>\n  </div>\n  <blockquote>Chào mọi người, Đạt đang làm một khóa học C++ mới, <a href=\"https://www.youtube.com/playlist?list=PLyiioioEJSxHVTaeL-ELYy6Io-I8diIVZ\" rel=\"nofollow\">thay cho khóa học cũ trên Youtube</a>, khóa học này cũng như <a href=\"https://www.youtube.com/user/trandatnh/playlists\" rel=\"nofollow\">các khóa học trước</a>, miễn phí cho mọi người. \n\n\n\nTóm tắt về bản thân \n\nMinh tên Lê Trần Đạt, 28 tuổi, là lập trình viên lập trình nhúng, ngoài làm việc mình thích dạy học online và viết. Tự học lập trình năm lớp 10. Học và tốt nghiệp ĐH ở ĐH KHTN TPHCM. Trong quá trình đi học đã tự viết và bán autoplay game + tools hack game. Đạt đi làm từ năm 2011, có hơn 5 năm trong lĩnh vực lập trình nhú…\n    <div class=\"topic-info\">\n    </div>\n  </blockquote>\n</aside>\n\n\n<h1>Chào mừng đến với loạt bài hướng dẫn sử dụng ngôn ngữ lập trình C++ !</h1>\n\n<p>Loạt bài hướng dẫn này được thiết kế cho tất cả mọi người, gồm có những người chưa từng lập trình, hoặc đã có kinh nghiệm chuyên môn trong những ngôn ngữ lập trình khác và muốn mở rộng thêm về C++. </p>\n\n<blockquote><p>Loạt bài hướng dẫn này sẽ khắc phục những hạn chế trong các videos hướng dẫn lập trình C++ khác, đồng thời cũng bổ sung những thiếu sót về mặt nội dung thường gặp khi học C++ ở trường lớp.</p></blockquote>\n\n<p>Chúng tôi sẽ hướng dẫn bạn mọi thứ cần biết trong ngôn ngữ lập trình C++, đi kèm với các ví dụ trong mỗi bài học.</p>\n\n<hr>\n\n<h2>Get started</h2>\n\n<p>Ở phần đầu tiên (Get started), chúng tôi nhắm đến việc trình bày một số nội dung xoay quanh C++ (C++ là gì, hoàn cảnh ra đời, cách mà chương trình C++ hoạt động và những phần mềm cần thiết để tạo ra chương trình của bạn...). Bạn còn có thể tự viết chương trình đầu tiên của bạn. Đi vào các bài học sau, chúng ta sẽ khám phá từng phần khác nhau trong ngôn ngữ lập trình C++.</p>\n\n<h2>Những mục tiêu đề ra</h2>\n\n<ul>\n<li><p>Một trong những mục tiêu đề ra của chuỗi bài hướng dẫn này là tất cả các chủ đề được làm rõ theo suốt khung chương trình. Một khi bạn hoàn thành khóa học, bạn sẽ không chỉ biết về cách để lập trình C++, mà còn những vấn đề liên quan như: phong cách lập trình, những lỗi thường gặp, cách sửa lỗi, luyện tập kĩ năng lập trình, và kiểm tra khả năng lập trình của bạn...).</p></li>\n<li><p>Cung cấp nhiều ví dụ mẫu. Đa phần, mọi người học lập trình thông qua cách làm theo các ví dụ có sẵn. Vì thế, khóa học này cung cấp một lượng lớn bài mẫu, cho bạn thấy các khải niệm mà bạn đã học được sử dụng trên thực tế như thế nào.</p></li>\n<li><p>Cung cấp một số bài tập sau mỗi tiết học giúp bạn rèn luyện khả năng thiết kế chương trình. Bạn có thể so sánh giải pháp của bạn với giải pháp của chúng tôi để xem sự khác biệt. Nếu bạn gặp một số trục trặc trong chương trình, chúng tôi sẽ giải quyết cùng bạn.</p></li>\n<li><p>Điều quan trọng nhất là: Programming can be a lot of fun!</p></li>\n</ul>\n\n<h2>Phương pháp học chúng tôi đưa ra</h2>\n\n<ul>\n<li><p>Bạn nên tự mình gõ lại những ví dụ mẫu và biên dịch chúng. Đừng copy và paste! Cách này giúp bạn học qua những lỗi mà bạn gặp phải, hiểu được những thông báo lỗi (hoặc những cảnh báo) mà trình biên dịch đưa ra. Khi bạn gõ lại những ví dụ mẫu, thử suy nghĩ xem tại sao chương trình cho ra kết quả như vậy.</p></li>\n<li><p>Khi gặp rắc rối với lỗi trong chương trình, hãy sửa chữa chúng. Cố gắng xử lý những lỗi của bạn trước khi nhờ sợ giúp đỡ của những người khác.</p></li>\n<li><p>Viết những chương trình ngắn sử dụng những kiến thức bạn đã được học. Không có gì tốt hơn là tự luyện tập.</p></li>\n<li><p>Học cách gỡ lỗi khi chương trình của bạn không hoạt động. Chúng tôi sẽ làm rõ điều này trong những bài học tiếp theo.</p></li>\n</ul>\n\n<hr>\n\n<p>P/s: Hẹn gặp lại các bạn trong bài học tiếp theo trong khóa học lập trình C++ hướng thực hành.</p>\n\n<p>Mọi ý kiến đóng góp hoặc thắc mắc có thể đặt câu hỏi trực tiếp tại diễn đàn</p>\n\n<p><a href=\"http://www.daynhauhoc.com\">www.daynhauhoc.com</a></p>\n\n<hr>\n\n<h3>Link Videos khóa học</h3>\n\n<p><a href=\"https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview\" class=\"onebox\" target=\"_blank\" rel=\"nofollow\">https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview</a></p>\n","__filename":"generated/29402.md","__url":"/0/0-gioi-thieu-ve-series-tutorial/","__resourceUrl":"/0/0-gioi-thieu-ve-series-tutorial/index.html","__dataUrl":"/0/0-gioi-thieu-ve-series-tutorial/index.html.078c42a7bcb638e7a6288e3b5eca8db0.json"}