{"head":{"title":"11.0 Giới thiệu về STL","route":"11/0-gioi-thieu-ve-stl","id":34001,"description":""},"body":"<h4>Chào các bạn đang theo dõi khóa học lập trình trực tuyến ngôn ngữ C++.</h4>\n<p>Chúng ta đã cùng nhau đi qua rất nhiều bài học về ngôn ngữ C++ cơ bản, trong số đó có những bài học có liên quan đến cả ngôn ngữ C. Vì đó là những bài học về nền tảng của ngôn ngữ lập trình nên có một số điểm chung khi sử dụng C và C++.</p>\n<p>Bắt đầu từ chương này trở đi, mình sẽ trình bày với bạn các các đặc trưng chỉ có riêng trong ngôn ngữ C++, hoàn toàn không liên quan gì đến ngôn ngữ C cả. Và đặc trưng đầu tiên mình muốn giới thiệu đến các bạn là bộ thư viện chuẩn (Standard Template Library).</p>\n<h3>The Standard Template Library</h3>\n<p><strong>Standard Template Library</strong> là một tập hợp các lớp (<strong>classes</strong>) cung cấp cho lập trình viên những khuôn mẫu về tổ chức dữ liệu, thuật toán, bộ lặp. Nó cung cấp rất nhiều thuật toán cơ bản và cấu trúc dữ liệu cơ bản trong ngành khoa học máy tính. </p>\n<p><strong>Standard Template Library</strong> cũng chỉ là một phần của <strong>C++ Standard Library</strong>, nó có thêm từ <strong>Template</strong> vì hầu hết các class trong tập thư viện này đều được định nghĩa dạng tổng quát (generic) với từ khóa <strong>template</strong>. Mình vẫn chưa đề cập đến khái niệm về <strong>template</strong> cho các bạn, tuy nhiên, chúng ta vẫn có thể tiếp cận các bài học trong chương này ở mức độ thực hành nên các bạn có thể yên tâm. Trong chương này, chúng ta sẽ tìm hiểu cách sử dụng các class trong <strong>Standard Template Library</strong> và các chức năng của chúng. Khi học đến bài học về <strong>template</strong> trong C++, các bạn sẽ hiểu được tại sao các class trong STL lại được khai báo như vậy.</p>\n<p>Như mình trình bày về khái niệm STL ở trên, chúng ta có thể chia STL thành 3 phần:</p>\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/11-STL/11-0-gioi-thieu-STL/0.png?raw=true\" class=\"lightbox\" title=\"0.png?raw=true\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/11-STL/11-0-gioi-thieu-STL/0.png?raw=true\" width=\"690\" height=\"232\"><div class=\"meta\">\n<span class=\"filename\">0.png?raw=true</span><span class=\"informations\">753x253</span><span class=\"expand\"></span>\n</div></a></div></p>\n<p>Mỗi thành phần của STL đảm nhiệm một số chức năng có liên quan đến nhau. Trong mỗi bài học tiếp theo, chúng ta sẽ tìm hiểu từng thành phần cụ thể của STL.</p>\n<p>Một đặc điểm chung của các thành phần này là chúng đều được xây dựng sẵn, chúng ta không cần định nghĩa lại mà chỉ cần sử dụng trong chương trình.</p>\n<hr>\n<p><strong>Hẹn gặp lại các bạn trong bài học tiếp theo trong khóa học lập trình C++ hướng thực hành.</strong></p>\n<p>Mọi ý kiến đóng góp hoặc thắc mắc có thể đặt câu hỏi trực tiếp tại diễn đàn </p>\n<p><a title=\"DayNhauHoc\" class=\"onebox\" target=\"_blank\">www.daynhauhoc.com</a></p>\n","__filename":"generated/34001.md","__url":"/11/0-gioi-thieu-ve-stl/","__resourceUrl":"/11/0-gioi-thieu-ve-stl/index.html","__dataUrl":"/11/0-gioi-thieu-ve-stl/index.html.d381e349b21471222160fc598695cb22.json"}