{"head":{"title":"1.2 Lệnh, khối lệnh, từ khóa","route":"1/2-lenh-khoi-lenh-tu-khoa","id":29575,"description":"Những dòng lệnh bên trong thân hàm main. (Có thể có hoặc không) Những dòng comment. (Có thể có hoặc không) Tích hợp thư viện và không gian…"},"body":"<p>Rất vui khi được gặp lại các bạn trong bài học tiếp theo trong khóa học lập trình C++ cho người mới bắt đầu. Hôm trước, chúng ta đã có cái nhìn đầu tiên về các thành phần cơ bản hình thành nên một chương trình C++.</p>\n<p>Mình sẽ nhắc lại một chút trong bài học trước.</p>\n<p>Cấu trúc của một chương trình C++ cơ bản:</p>\n<pre><code>+ Hàm main: (bắt buộc phải có)\n<pre><code>+ Kiểu trả về của hàm main (int).\n+ Tên của hàm main (cũng là main luôn).\n+ Thân của hàm main (cặp dấu ngoặc nhọn { và }).\n+ Giá trị trả về của hàm main (return 0; //hoặc giá trị bao nhiêu cũng đc).\n</code></pre>\n<ul>\n<li>\n<p>Những dòng lệnh bên trong thân hàm main. (Có thể có hoặc không)</p>\n</li>\n<li>\n<p>Những dòng comment. (Có thể có hoặc không)</p>\n</li>\n<li>\n<p>Tích hợp thư viện và không gian tên. (Phụ thuộc vào các lệnh mà bạn sử dụng).</code></pre></p>\n</li>\n</ul>\n<p>Chúng ta đã biết hàm main là thứ quan trọng nhất cần phải có của một chương trình C++. Chúng ta hoàn toàn có thể khai báo hàm main xong và chạy chương trình ngay mà không bị báo lỗi.</p>\n<p><a href=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/1-cpp-co-ban/1-2-lenh-khoi-lenh-tu-khoa/0.png\" target=\"_blank\" rel=\"nofollow\"><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/1-cpp-co-ban/1-2-lenh-khoi-lenh-tu-khoa/0.png\" width=\"690\" height=\"370\"></a></p>\n<p>Như các bạn thấy, chương trình vẫn được build thành file .exe và hoàn toàn có thể chạy được (Các bạn nhấn thử phím F5). Nhưng khi cửa sổ console vừa hiện lên thì chương trình đóng lại ngay lập tức. Vì bạn không yêu cầu máy tính thực hiện công việc gì cả. Một chương trình máy tính được tạo ra để không làm gì cả thì thật là vô ích.</p>\n<p>Để giải quyết vấn đề mà chúng ta đặt ra trên máy tính, chúng ta cần ra lệnh cho máy tính thực hiện các công việc cụ thể. Chúng ta ra lệnh cho máy tính bằng các lệnh trong ngôn ngữ lập trình. Để máy tính thực hiện công việc và cho ra kết quả, nó cần nhận lệnh từ người lập trình. Vì thế, yếu tố quan trọng chỉ đứng sau hàm <strong>main</strong> chính là <strong>những câu lệnh</strong>.</p>\n<h3>Lệnh trong ngôn ngữ lập trình C++</h3>\n<p>Trong C++, một lệnh là một chỉ thị riêng biệt của một chương trình. <br>Ví dụ:</p>\n<pre><code>int variable = 0;\n<p>cout &#x3C;&#x3C; \"Print something\";</p>\n<p>variable = variable + 10;</code></pre></p>\n<p>Ở trên đây, chúng là có 3 dòng lệnh. 4 dòng lệnh này chỉ dẫn máy tính thực hiện 3 công việc khác nhau, nhưng trên phương diện cú pháp, nó có một đặc điểm chung rất quan trọng cần phải nhớ: <strong>dòng lệnh kết thúc bằng dấu chấm phẩy \";\"</strong></p>\n<p>Chỉ cần một dòng lệnh bị bỏ sót dấu chấm phẩy, IDE sẽ thông báo với người lập trình lỗi về cú pháp.</p>\n<p><a href=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/1-cpp-co-ban/1-2-lenh-khoi-lenh-tu-khoa/1.png\" target=\"_blank\" rel=\"nofollow\"><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/1-cpp-co-ban/1-2-lenh-khoi-lenh-tu-khoa/1.png\" width=\"690\" height=\"284\"></a></p>\n<p>Thông báo lỗi này có nghĩa bạn viết thiếu dấu chấm phẩy \";\" ở trước dòng thứ 6 trong chương trình.</p>\n<p><a href=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/1-cpp-co-ban/1-2-lenh-khoi-lenh-tu-khoa/2.png\" target=\"_blank\" rel=\"nofollow\"><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/1-cpp-co-ban/1-2-lenh-khoi-lenh-tu-khoa/2.png\" width=\"690\" height=\"282\"></a></p>\n<p>Sau khi thêm dấu chấm phẩy vào dòng lệnh trước đó, chương trình được build bình thường.</p>\n<p>Một điều cần lưu ý nữa là: <strong>Tại một thời điểm, chương trình chỉ có thể thực hiện được 1 dòng lệnh. Các dòng lệnh được thực hiện tuần tự từ trên xuống dưới.</strong></p>\n<p><a href=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/1-cpp-co-ban/1-2-lenh-khoi-lenh-tu-khoa/3.png\" target=\"_blank\" rel=\"nofollow\"><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/1-cpp-co-ban/1-2-lenh-khoi-lenh-tu-khoa/3.png\" width=\"690\" height=\"336\"></a></p>\n<p>Như kết quả trong hình, ta có dòng chữ <strong>\"Statement 1\"</strong> được in ra trước dòng <strong>\"Statement 2\"</strong> và <strong>\"Statement 3\"</strong> vì dòng lệnh dùng để in ra <strong>\"Statement 1\"</strong> nằm phía trên các lệnh còn lại.</p>\n<p>Ở ví dụ trên chỉ bao gồm các câu lệnh đơn giản. Chúng ta sẽ được học những lệnh có cấu trúc đặc biệt như <strong>câu lệnh có cấu trúc rẽ nhánh</strong>, <strong>câu lệnh có cấu trúc lặp</strong>... trong những bài sau.</p>\n<h3>Khối lệnh</h3>\n<p>Trong C++, một khối lệnh là tập hợp những câu lệnh được đặt trong cặp dấu ngoặc nhọn <strong>{</strong> và <strong>}</strong>.</p>\n<p>Một khối lệnh có thể chứa nhiều dòng lệnh, có thể chứa một dòng lệnh hoặc không chứa dòng lệnh nào. Một khối lệnh còn có thể chứa một hoặc nhiều khối lệnh khác.</p>\n<pre><code>#include &lt;iostream&gt;\nusing namespace std;\n<p>int main()\t{</p>\n<pre><code>int variable = 1;\n\n{\n    int variable = 10;\n    cout &#x26;lt;&#x26;lt; \"The variable inside this block is not concerning the variable above\" &#x26;lt;&#x26;lt; endl;\n    cout &#x26;lt;&#x26;lt; \"We print the value of the second variable: \" &#x26;lt;&#x26;lt; variable &#x26;lt;&#x26;lt; endl;\n}\n\ncout &#x26;lt;&#x26;lt; \"We print the value of the first variable: \" &#x26;lt;&#x26;lt; variable &#x26;lt;&#x26;lt; endl;\n\nreturn 0;\n</code></pre>\n<p>}</code></pre></p>\n<p>Dễ thấy nhất là khối lệnh đóng vai trò <strong>thân của hàm main</strong>. Trong khối lệnh thân hàm main, chúng ta có một khối lệnh khác có chức năng in ra giá trị của biến variable thứ hai (bên trong khối lệnh con). Khối lệnh con này không gây ảnh hưởng gì với các câu lệnh bên ngoài nó.</p>\n<p>Chúng ta cùng xem kết quả đoạn chương trình trên:</p>\n<p><a href=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/1-cpp-co-ban/1-2-lenh-khoi-lenh-tu-khoa/4.png\" target=\"_blank\" rel=\"nofollow\"><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/1-cpp-co-ban/1-2-lenh-khoi-lenh-tu-khoa/4.png\" width=\"690\" height=\"301\"></a></p>\n<p>Chúng ta thấy giá trị của biến variable bên trong khối lệnh con hoàn toàn khác so với giá trị của biến variable bên ngoài. (<strong>Các bạn sẽ hiểu được biến là gì qua những bài học tiếp theo</strong>)</p>\n<h3>Từ khóa trong C++</h3>\n<p>Trong ngôn ngữ lập trình C++ hay bất kỳ ngôn ngữ lập trình nào khác, chúng ta đều có sẵn một số các <strong>từ khóa</strong> do người tạo ra ngôn ngữ đó định nghĩa sẵn. Mỗi từ khóa có một ý nghĩa riêng, khi chúng ta kết hợp các từ khóa và một số cú pháp đi kèm, chúng ta sẽ có được câu lệnh.</p>\n<p>Ví dụ:</p>\n<pre><code>int var;</code></pre>\n<p>Lệnh trên sử dụng từ khóa <strong>int</strong> để định nghĩa một biến tên <strong>var</strong> có kiểu số nguyên (<strong>integer</strong>).</p>\n<pre><code>const float f_number = 1.0f;</code></pre>\n<p>Câu lệnh trên sử dụng 2 từ khóa: <strong>const</strong> và <strong>float</strong> kết hợp với một số yếu tổ khác tạo nên một câu lệnh có chức năng khai báo một hằng số kiểu số thực và gắn cho nó giá trị cố định là 1.</p>\n<p>Những từ khóa đã được định nghĩa và luôn sẵn sàng để sử dụng. Vì thế, chúng ta không cần <strong>include</strong> các thư viện ngoài vào để sử dụng chúng.</p>\n<p>Dưới đây là bảng các từ khóa phổ biến dùng trong ngôn ngữ C++ 11</p>\n<p><a href=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/1-cpp-co-ban/1-2-lenh-khoi-lenh-tu-khoa/keyword.png\" target=\"_blank\" rel=\"nofollow\"><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/1-cpp-co-ban/1-2-lenh-khoi-lenh-tu-khoa/keyword.png\" width=\"491\" height=\"457\"></a></p>\n<p>Các bạn sẽ được cùng mình sử dụng những từ khóa thông dụng trong quá trình học và làm bài tập của khóa học này.</p>\n<p><em>Trong bảng từ khóa trên có một vài từ khóa được bổ sung thông qua chuẩn C++ 11.</em></p>\n<h3>Tổng kết</h3>\n<p>Qua bài học ngày hôm nay, chúng ta hiểu rõ hơn khái niệm <strong>Lệnh và khối lệnh</strong>, để sau này khi mình thường xuyên dùng đến từ này thì các bạn sẽ tránh khỏi một số thắc mắc không cần thiết.</p>\n<p>Ngoài ra, chúng ta còn được xem qua bảng các từ khóa đã được định nghĩa sẵn trong ngôn ngữ lập trình C++.</p>\n<hr>\n<p>Hẹn gặp lại các bạn trong bài học tiếp theo. <br>Cảm ơn các bạn đã quan tâm đến khóa học. Mọi ý kiến đóng góp hoặc thắc mắc các bạn có thể đặt câu hỏi trực tiếp thông qua diễn đàn <strong><a href=\"http://www.daynhauhoc.com\">www.daynhauhoc.com</a></strong></p>\n<hr>\n<h3>Link Videos khóa học</h3>\n<p><a href=\"https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview\" class=\"onebox\" target=\"_blank\" rel=\"nofollow\">https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview</a></p>\n","__filename":"generated/29575.md","__url":"/1/2-lenh-khoi-lenh-tu-khoa/","__resourceUrl":"/1/2-lenh-khoi-lenh-tu-khoa/index.html","__dataUrl":"/1/2-lenh-khoi-lenh-tu-khoa/index.html.7475fb0565b3dc36b5f6c2b16530378c.json"}