{"head":{"title":"Khóa học C++","description":"Cạnh tranh với Udemy luôn. Các bạn vào nhập mã REHON_UDEMY Hoặc bấm vào link này http&#x3A;//bit.ly/rehon_udemy Vào đăng ký học rẻ hơn mã…"},"body":"<html><head></head><body><p>Chào mọi người, Đạt đang làm một khóa học C++ mới, <a href=\"https://www.youtube.com/playlist?list=PLyiioioEJSxHVTaeL-ELYy6Io-I8diIVZ\">thay cho khóa học cũ trên Youtube</a>, khóa học này cũng như <a href=\"https://www.youtube.com/user/trandatnh/playlists\">các khóa học trước</a>, miễn phí cho người đăng ký sớm.</p>\n\n<hr>\n\n<p><strong>Tóm tắt về bản thân</strong></p>\n\n<p>Minh tên <strong>Lê Trần Đạt</strong>, 28 tuổi, là lập trình viên lập trình nhúng, ngoài làm việc mình thích dạy học online và viết. Tự học lập trình năm lớp 10. Học và tốt nghiệp ĐH ở ĐH KHTN TPHCM. Trong quá trình đi học đã tự viết và bán autoplay game + tools hack game. Đạt đi làm từ năm 2011, có hơn 5 năm trong lĩnh vực lập trình nhúng. Hiện đang làm Lead R&#x26;D nhúng ở Singapore.</p>\n\n<ul>\n<li>Năm 2011: bắt đầu đi làm</li>\n<li>Năm 2012: tập trung học tiếng anh</li>\n<li>Đầu 2013: <ul>\n<li>dạy lập trình C/C++ và Python trên Youtube, đến nay <a href=\"https://www.youtube.com/user/trandatnh/abouthttps://www.youtube.com/user/trandatnh/about\">channel</a> đã có 12k subs, 1.5tr views.</li>\n<li>chuẩn bị kế hoạch đi nước ngoài</li>\n</ul>\n</li>\n<li>Cuối 2013: sang Singapore</li>\n<li>Năm 2014: xây dựng daynhauhoc.com để kết nối các bạn thích Dạy Nhau Học. Bắt đầu từ hạng 70k ở VN, nay DayNhauHoc.Com đã đứng thứ 662, cập nhật hôm nay 24/04/2016.</li>\n<li>Năm 2015: vật lộn giữa công việc, vợ con và Dạy Nhau Hoc.</li>\n<li>Năm 2016: lên kế hoạch dạy lập trình một cách hoàn chỉnh sử dụng ngôn ngữ C++</li>\n</ul>\n\n<p>Ước mơ thủa nhỏ \"Trở thành nhà khoa học\", nay đã lớn thấy rằng làm nhà khoa học khó quá, nên đã đổi thành \"trở thành nhà khoa học máy tính\". Chuyên cài Win một cách khoa học <img src=\"//daynhauhoc.com/images/emoji/twitter/joy.png?v=3\" title=\":joy:\" class=\"emoji\" alt=\":joy:\">.</p>\n\n<hr>\n\n<p><strong>Đối tượng học</strong> là người không biết hoặc biết một ít lập trình<br>Ví dụ: học sinh / sinh viên / người đi làm ngành khác hoặc lập trình viên ngôn ngữ khác muốn refresh kiến thức C++</p>\n\n<p><strong>Học gì</strong>? học C++ để xây dựng phần mềm.</p>\n\n<p><strong>Khóa học này bao gồm 5 khóa học nhỏ</strong></p>\n\n<ul>\n<li>\n<strong>C++ Cơ bản dành cho người mới học lập trình</strong> dạy các khái niệm cơ bản của C++, cách sử dụng thư viện để xây dựng chương trình</li>\n<li>\n<strong>C++ Hướng đối tượng</strong> tập trung về hướng đối tượng, giới thiệu về lập trình giao diện, đồ họa</li>\n<li>\n<strong>C++ Cấu Trúc Dữ Liệu và Giải Thuật</strong> tập trung về thư viện chuẩn STL như cách sử dụng vector, list, map và một số thuật toán như sort, find, ...</li>\n<li>\n<strong>C++ Lập trình giao diện với Qt</strong> hướng dẫn cách lập trình giao diện với Qt</li>\n<li>\n<strong>C++ Viết chương trình Hack Game với Qt</strong> hướng dẫn cách đọc vùng nhớ / ghi vùng nhớ lên một game, sử dụng Qt để thiết kế giao diện hoàn chỉnh</li>\n</ul>\n\n<p><strong>Tổng quan khóa học</strong></p>\n\n<ul>\n<li>Khóa học này sẽ dẫn dắt bạn đi từ cơ bản đến tạo ra một sản phẩm hoàn chỉnh viết bằng C++.</li>\n<li>Sẽ giúp người học hiểu được cách xây dựng một phần mềm từ đầu đến cuối.</li>\n<li>Nội dung giảng dạy sẽ bao gồm kiến thức về ngôn ngữ, trắc nghiệm để kiểm tra kiến thức, bài tập thực hành nộp cho TA(Teaching assistant) để họ chấm.</li>\n<li>Khi thắc mắc về nội dung bài học thì người học có thể hỏi trực tiếp Đạt hoặc các bạn TA.</li>\n<li>Khi học xong sẽ được cấp chứng nhận đã học xong khóa học.</li>\n</ul>\n\n<p><strong>Kiến thức học được qua toàn khóa học</strong></p>\n\n<ul>\n<li>Cách lập trình C++ đúng, đầy đủ, sử dụng thư viện STL thành thạo</li>\n<li>Kiến thức lập trình để tạo ra một phần mềm xài được</li>\n<li>Cách xây dựng phần mềm từ ý tưởng đến thành phẩm</li>\n<li>Lập trình giao diện với C++ sử dụng Qt</li>\n<li>Khả năng tự học thêm C++ hoặc học một ngôn ngữ khác khi đã có được căn bản vững từ khóa học này</li>\n<li>Có thể tự tin đi phỏng vấn và tìm việc làm với kiến thức học được trong khóa học</li>\n</ul>\n\n<p><strong>Yêu cầu cơ bản để học khóa học này</strong></p>\n\n<ul>\n<li>Một máy tính, có thể sử dụng Windows/Linux hay MacBook</li>\n<li>Đường truyền internet tương đối tốt</li>\n<li>Có kế hoạch học tập nghiêm túc</li>\n</ul>\n\n<hr>\n\n<p>Thời gian ra mắt videos đầu tiên dự tính là ngày 01/07/2016, videos cuối cùng rơi vào cuối tháng 1  2017. Đây là một khóa học dài, nên có thể việc dự tính không chính xác, nhưng Đạt sẽ cố gắng để các bạn có thể học từ 01/07/2016. </p>\n\n<p>Tuy nhiên, như các bạn học đã feedback lại cho Đạt là khóa học bị thiếu bài tập và hướng dẫn giải bài tập. Lúc đầu, mục tiêu khóa học của Đạt muốn nhắm tới là để trở thành một bộ tài liệu phụ, học thêm, cho sinh viên học lập trình. Thế nên Đạt không đầu tư nhiều về phần bài tập và bài giải, vì Đạt nghĩ ai đi học cũng có sẵn bài tập rồi <img src=\"//daynhauhoc.com/images/emoji/twitter/smiley.png?v=3\" title=\":smiley:\" class=\"emoji\" alt=\":smiley:\"> Nhưng thực tế là có rất nhiều bạn không phải sinh viên IT, có thể là học sinh hoặc là người đi làm ngành khác muốn chuyển sang học lập trình. Vì thế cho nên việc thiếu bài tập sẽ khiến các bạn này không nắm được khóa học.</p>\n\n<p>Khóa học này sẽ có bài tập và giải thích. Để làm khóa học chất lượng hơn, Đạt cần phải thuê thêm một số vị trí để chuẩn bị tài liệu, giáo án, bài tập, chỉnh sửa videos và một số chi phí khác. Nhằm đảm bảo khả năng tiếp cận khóa học của các bạn, các videos này là miễn phí hoàn toàn. Bên cạnh đó, Đạt sẽ thu một ít phí khi bạn nào muốn học riêng, muốn được nghe giải thích riêng với TA (Teaching Assistant) hoặc xem thêm videos.</p>\n\n<p>Hi vọng sẽ được các bạn ủng hộ.</p>\n\n<hr>\n\n<p>Khóa học : <br></p><aside class=\"quote\" data-post=\"1\" data-topic=\"31306\">\n  <div class=\"title\">\n    <div class=\"quote-controls\"></div>\n    <img alt=\"\" width=\"20\" height=\"20\" src=\"/user_avatar/daynhauhoc.com/ltd/40/1016_1.png\" class=\"avatar\">\n    <a href=\"//daynhauhoc.com/t/khoa-hoc-c-co-ban-2016/31306\">Khóa học C++ Cơ bản 2016</a> <a class=\"badge-wrapper bullet\" href=\"/c/hacker-news\"><span class=\"badge-category-bg\" style=\"background-color: #12A89D;\"></span><span style=\"color: #FFFFFF;\" data-drop-close=\"true\" class=\"badge-category clear-badge\" title=\"Tất cả những gì mà bạn nghĩ những hacker khác cũng hứng thú\">hacker news</span></a>\n  </div>\n  <blockquote>Update ngày 10/08/2016: Giảm 50% giá khóa học\n\nCạnh tranh với Udemy luôn. Các bạn vào nhập mã REHON_UDEMY\n\nHoặc bấm vào link này\n\n<a href=\"http://bit.ly/rehon_udemy\" class=\"onebox\" target=\"_blank\" rel=\"nofollow\">http://bit.ly/rehon_udemy</a>\n\nVào đăng ký học rẻ hơn mã của Udemy :joy:\n\nHiệu lực đến 15/08/2016\n\nBạn cần một tài khoản Udemy để học nếu chưa có.\n\nUpdate 31/07/2016 - Coupon để học khóa học C++ cơ bản, hết hạn 11:00 đêm nay.\n\n<a href=\"https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/?couponCode=daynhauhoc1000\" rel=\"nofollow\">Coupon khóa học</a>\n\nUpdate 30/07/2016 12:00\n\nĐã gửi email có key để học miễn phí. Các bạn học và đóng góp ý kiến giúp Đạt nhé. Đạt sẽ làm videos…\n    <div class=\"topic-info\">\n    </div>\n  </blockquote>\n</aside>\n<p></p>\n</body></html>","__filename":"index.md","__url":"/","__resourceUrl":"/index.html","__dataUrl":"/index.html.b5876e909f5a87e4ec2b20bf919bf9fa.json"}