{"head":{"title":"8.0 Con trỏ","route":"8/0-con-tr","description":"cout &lt;&lt; &i1 &lt;&lt; endl;    //get address of i1 cout &lt;&lt; &i_ref &lt;&lt; endl; //get address of i_ref cout &lt;&lt; n &lt;&lt…"},"body":"\n<h4>Chào các bạn học viên đang theo dõi khóa học lập trình trực tuyến ngôn ngữ C++.</h4>\n\n<p>Trong chương này, chúng ta sẽ cùng nhau tìm hiểu về khái niệm con trỏ (<strong>Pointer</strong>) - một đặc trưng của ngôn ngữ lập trình C/C++.</p>\n\n<p>Trước khi vào bài học này, chúng ta cùng nhau xem lại một số khái niệm liên quan đến vùng nhớ, địa chỉ của biến, tham chiếu...</p>\n\n<h5>Variable</h5>\n\n<p>Variable (hay còn gọi là biến) là một ô nhớ đơn lẻ hoặc một vùng nhớ được hệ điều hành cấp phát cho chương trình C++ nhằm để lưu trữ giá trị vào bên trong vùng nhớ đó. Để truy xuất đến giá trị mà biến đang nắm giữ, chương trình cần tìm đến vùng nhớ (địa chỉ) của biến để đọc giá trị bên trong vùng nhớ đó, cũng như bạn muốn lấy món đồ bên trong cái hộp, bạn cần biết cái hộp được đặt ở đâu.</p>\n\n<p>Khi thao tác với các biến thông thường, chúng ta không cần quan tâm đến địa chỉ vùng nhớ của biến. Khi cần truy xuất giá trị của biến, chúng ta chỉ cần gọi định danh (hay thường gọi là tên biến).</p>\n\n<p>Ví dụ:</p>\n\n<pre><code>int money;</code></pre>\n\n<p>Khi dòng lệnh này được CPU thực thi, một vùng nhớ có kích thước 4 bytes sẽ được cấp phát. Lấy ví dụ biến money này được đặt tại ô nhớ 1224 (trong địa chỉ ảo của máy tính).</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/0.png?raw=true\" width=\"400\" height=\"300\"></p>\n\n<p>Bất cứ khi nào chương trình thấy các bạn sử dụng biến money trong câu lệnh, chương trình hiểu rằng cần tìm đến ô nhớ 1224 để lấy giá trị đó ra.</p>\n\n<h5>Virtual memory &amp; Physical memory</h5>\n\n<p>Việc truy xuất dữ liệu trên bộ nhớ máy tính cần phải thông qua một số bước trung gian, người dùng không thể trực tiếp truy xuất vào các ô nhớ trên các thiết bị lưu trữ. Chúng ta chỉ có thể trỏ đến vùng nhớ ảo (virtual memory) trên máy tính, còn việc truy xuất đến bộ nhớ vật lý (physical memory) từ bộ nhớ ảo phải được thực hiện bởi thiết bị phần cứng có tên là <strong>Memory management unit (MMU)</strong> và một chương trình định vị địa chỉ bộ nhớ gọi là <strong>Virtual address space</strong>.</p>\n\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/1.png?raw=true\" class=\"lightbox\" title=\"1.png?raw=true\" rel=\"nofollow\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/1.png?raw=true\" width=\"690\" height=\"373\"><div class=\"meta\">\n<span class=\"filename\">1.png?raw=true</span><span class=\"informations\">1045x566</span><span class=\"expand\"></span>\n</div></a></div></p>\n\n<p>Virtual memory làm che giấu sự phân mảnh của bộ nhớ vật lý, khiến chúng ta có cảm giác đang thao tác với các vùng nhớ liên tục. Trong hình trên, từ phía Virtual memory cho đến Physical memory thuộc về phần quản lý của hệ điều hành, lập trình viên và người dùng chúng ta không thể can thiệp trực tiếp đến trong quá trình máy tính đang hoạt động.</p>\n\n<h5>Variable address &amp; address-of operator</h5>\n\n<p>Địa chỉ của biến mà chúng ta nhìn thấy thật ra chỉ là những giá trị đã được đánh số thứ tự đặt trên Virtual memory. Để lấy được địa chỉ ảo của biến trong chương trình, chúng ta sử dụng toán tử <strong>'&amp;'</strong> đặt trước tên biến.</p>\n\n<pre><code>int x = 5;\nstd::cout &lt;&lt; x &lt;&lt; '\\n'; // print the value of variable x\nstd::cout &lt;&lt; &amp;x &lt;&lt; '\\n'; // print the memory address of variable x</code></pre>\n\n<p>Trên máy tính của mình, kết quả của đoạn chương trình trên được in ra như sau:</p>\n\n<pre><code>5\n0027FEA0</code></pre>\n\n<p>Dòng đầu tiên là kết quả của việc truy xuất giá trị của biến thông qua định danh (tên biến). Dòng thứ hai là kết quả của việc truy xuất đến địa chỉ ảo của biến.</p>\n\n<h5>Tham chiếu (Reference)</h5>\n\n<p>Mục đích của tham chiếu trong C++ là tạo ra một biến khác có cùng kiểu dữ liệu nhưng sử dụng chung vùng nhớ với biến được tham chiếu đến.</p>\n\n<pre><code>int i1 = 10;\nint &amp;i_ref = i1;        //reference to i1, not means address of i1\n\ncout &lt;&lt; &amp;i1 &lt;&lt; endl;    //get address of i1\ncout &lt;&lt; &amp;i_ref &lt;&lt; endl; //get address of i_ref</code></pre>\n\n<p>Kết quả chúng ta được:</p>\n\n<pre><code>0xBFEB475C\n0xBFEB475C</code></pre>\n\n<p>Như vậy, mọi hành vi thay đổi giá trị của <code>i_ref</code> đều tác động trực tiếp đến <code>i1</code>.</p>\n\n<p><strong><em>Lưu ý: Biến tham chiếu sẽ có địa chỉ cố định sau khi khởi tạo. Chúng ta không thể tham chiếu lại lần nữa.</em></strong></p>\n\n<h5>Dereference operator</h5>\n\n<p>Toán tử trỏ đến (<strong>dereference operator</strong>) hay còn gọi là <strong>indirection operator</strong> (toán tử điều hành gián tiếp) được kí hiệu bằng dấu sao <strong>\" * \"</strong> cho phép chúng ta lấy ra giá trị của vùng nhớ có địa chỉ cụ thể.</p>\n\n<p>Ví dụ:</p>\n\n<pre><code>int n = 5;\n\ncout &lt;&lt; n &lt;&lt; endl;     //print the value of variable n\ncout &lt;&lt; &amp;n &lt;&lt; endl;    //print the virtual memory address of variable n\ncout &lt;&lt; *(&amp;n) &lt;&lt; endl; //print the value at the virtual memory address of variable n</code></pre>\n\n<ul>\n<li><p>Dòng lệnh cout đầu tiên khá dễ hiểu, nó thực hiện in ra giá trị của biến n bằng cách gọi định danh n, còn lại phần truy xuất đến địa chỉ ảo của biến n sẽ do chương trình đảm nhiệm.</p></li>\n<li><p>Dòng lệnh cout thứ hai không dùng để lấy ra giá trị bên trong vùng nhớ mà biến n đang nắm giữ, mà nó lấy ra địa chỉ ảo của biến n.</p></li>\n<li><p>Dòng lệnh cout thứ ba chúng ta sử dụng toán tử trỏ đến <strong>\" * \"</strong> đặt trước toán tử <strong>address-of</strong>. Khi đó, <strong>(&amp;n)</strong> sẽ lấy ra địa chỉ ảo của biến n, và toán tử * sẽ truy xuất giá trị bên trong địa chỉ đó.</p></li>\n</ul>\n\n<p>Kết quả của đoạn chương trình trên là:</p>\n\n<pre><code>5\n0xBFD181AC\n5</code></pre>\n\n<p>Ngoài việc truy xuất giá trị trong vùng nhớ của một địa chỉ cụ thể, toán tử trỏ đến (<strong>dereference operator</strong>) còn có thể dùng để thay đổi giá trị bên trong vùng nhớ đó.</p>\n\n<pre><code>int n = 5;\ncout &lt;&lt; n &lt;&lt; endl;\n*(&amp;n) = 10;\ncout &lt;&lt; n &lt;&lt; endl;</code></pre>\n\n<p>Kết quả đoạn chương trình này là:</p>\n\n<pre><code>5\n10</code></pre>\n\n<p>Như vậy, <strong>dereference operator</strong> cho phép chúng ta thao tác trực tiếp trên <strong>Virtual memory</strong> mà không cần thông qua định danh (tên biến).</p>\n\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/2.png?raw=true\" class=\"lightbox\" title=\"2.png?raw=true\" rel=\"nofollow\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/2.png?raw=true\" width=\"690\" height=\"430\"><div class=\"meta\">\n<span class=\"filename\">2.png?raw=true</span><span class=\"informations\">786x490</span><span class=\"expand\"></span>\n</div></a></div></p>\n\n<p>Mặc dù <strong>dereference operator</strong> có kí hiệu giống <strong>multiplication operator</strong>, nhưng các bạn có thể phân biệt được vì <strong>dereference operator</strong> là toán tử một ngôi, trong khi đó, <strong>multiplication operator</strong> là toán tử hai ngôi.</p>\n\n<p>Khác với tham chiếu (<strong>reference</strong>), toán tử trỏ đến (<strong>dereference operator</strong>) không tạo ra một tên biến khác, mà nó truy xuất trực tiếp đến vùng nhớ có địa chỉ cụ thể trên <strong>Virtual memory</strong>.</p>\n\n<hr>\n\n<h3>Con trỏ (Pointer)</h3>\n\n<p>Với những khái niệm mình trình bày ở trên (một số khái niệm các bạn đã được học), bây giờ chúng ta có thể nói đến con trỏ (<strong>pointer</strong>).</p>\n\n<blockquote><p>Một con trỏ (a <strong>pointer</strong>) là một biến được dùng để lưu trữ địa chỉ của biến khác.</p></blockquote>\n\n<p>Khác với tham chiếu, con trỏ là một biến có địa chỉ độc lập so với vùng nhớ mà nó trỏ đến, nhưng giá trị bên trong vùng nhớ của con trỏ chính là địa chỉ của biến (hoặc địa chỉ ảo) mà nó trỏ tới.</p>\n\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/3.png?raw=true\" class=\"lightbox\" title=\"3.png?raw=true\" rel=\"nofollow\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/3.png?raw=true\" width=\"690\" height=\"411\"><div class=\"meta\">\n<span class=\"filename\">3.png?raw=true</span><span class=\"informations\">983x586</span><span class=\"expand\"></span>\n</div></a></div></p>\n\n<p>Trong ví dụ trên, một con trỏ sau khi khai báo đã được cấp phát vùng nhớ tại địa chỉ 3255, và nó trỏ đến địa chỉ 1224, do đó, giá trị bên trong vùng nhớ của con trỏ là 1224.</p>\n\n<h5>Khai báo con trỏ</h5>\n\n<p>Cũng giống như biến thông thường, biến con trỏ cần được khai báo trước khi sử dụng. Con trỏ yêu cầu cú pháp khai báo mới hơn một chút so với biến thông thường.</p>\n\n<pre><code>&lt;data_type&gt; *&lt;name_of_pointer&gt;;</code></pre>\n\n<p>Khác với biến thông thường, chúng ta cần đặt thêm dấu sao giữa kiểu dữ liệu và tên biến của con trỏ.</p>\n\n<p>Ví dụ:</p>\n\n<pre><code>int *iPtr;\nfloat *fPtr;\ndouble *dPtr;\n\nint *iPtr1, *iPtr2;</code></pre>\n\n<p><strong><em>Lưu ý: Dấu sao trong khai báo con trỏ không phải là toán tử trỏ đến (dereference operator), nó chỉ là cú pháp được ngôn ngữ C/C++ quy định.</em></strong></p>\n\n<h5>Cách khai báo dễ gây nhầm lẫn</h5>\n\n<p>Ngôn ngữ C/C++ yêu cầu đặt dấu sao giữa kiểu dữ liệu và tên con trỏ nhưng không bắt buộc phải đặt nó gần với kiểu dữ liệu hay gần với tên con trỏ. Do đó, những cách khai báo dưới đây đều được cho phép:</p>\n\n<pre><code>int *iPtr1; //We recommended you use this way to declare pointers\nint* iPtr2;</code></pre>\n\n<p>Nhưng mình khuyến nghị các bạn sử dụng cách khai báo đặt dấu sao ngay trước tên con trỏ vì cách thứ hai có thể gây nhầm lẫn.</p>\n\n<pre><code>int* iPtr1, iPtr2;</code></pre>\n\n<p>Với cách khai báo này, <strong>iPtr1</strong> là một con trỏ kiểu <strong>int</strong>, trong khi đó, <strong>iPtr2</strong> là một biến kiểu <strong>int</strong>. Để có được hai con trỏ, chúng ta cần khai báo như sau:</p>\n\n<pre><code>int *iPtr1, *iPtr2;</code></pre>\n\n<h5>Kích thước của con trỏ trong bộ nhớ</h5>\n\n<p>Các bạn cùng chạy thử đoạn chương trình dưới đây:</p>\n\n<pre><code>cout &lt;&lt; sizeof(char*) &lt;&lt; endl;\ncout &lt;&lt; sizeof(int*) &lt;&lt; endl;\ncout &lt;&lt; sizeof(double*) &lt;&lt; endl;\ncout &lt;&lt; sizeof(string*) &lt;&lt; endl;</code></pre>\n\n<p>Đoạn chương trình trên cho ra kết quả như sau:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/4.png?raw=true\" width=\"677\" height=\"343\"></p>\n\n<p>Tại cửa sổ giao diện của Visual studio 2015, chúng ta chuyển sang Debug trên nền tảng 64 bits.</p>\n\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/5.png?raw=true\" class=\"lightbox\" title=\"5.png?raw=true\" rel=\"nofollow\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/5.png?raw=true\" width=\"690\" height=\"321\"><div class=\"meta\">\n<span class=\"filename\">5.png?raw=true</span><span class=\"informations\">901x420</span><span class=\"expand\"></span>\n</div></a></div></p>\n\n<p>Nhấn F5 lại lần nữa và xem lại kết quả:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/6.png?raw=true\" width=\"677\" height=\"343\"></p>\n\n<p><strong><em>Như vậy, chúng ta thấy rằng khi chạy trên nền tảng hệ điều hành 32 bits con trỏ sẽ có kích thước 4 bytes, khi chạy trên nền tảng hệ điều hành 64 bits con trỏ sẽ có kích thước 8 bytes.</em></strong></p>\n\n<p>Kiểu dữ liệu của con trỏ thay đổi không hề tác động đến kích thước bộ nhớ của con trỏ. Bởi vì giá trị thực sự của con trỏ là kiểu số nguyên không dấu (<strong>unsigned int</strong>), trong nền tảng hệ điều hành <strong>32 bits</strong>, giá trị mà con trỏ lưu trữ sẽ là <code>unsigned __int32</code>, và trong nền tảng hệ điều hành <strong>64 bits</strong>, giá trị của con trỏ lưu trữ có kiểu <code>unsigned __int64</code>.</p>\n\n<p><strong><em>Kiểu dữ liệu của con trỏ không mô tả giá trị địa chỉ được lưu trữ bên trong con trỏ, mà kiểu dữ liệu của con trỏ dùng để xác định kiểu dữ liệu của biến mà nó trỏ đến trên bộ nhớ ảo.</em></strong></p>\n\n<p>Vậy tại sao lại cần 4 bytes cho một con trỏ trong hệ điều hành 32 bits, và cần 8 bytes cho một con trỏ trong hệ điều hành 64 bits?</p>\n\n<p>Phạm vi giá trị của <code>unsigned __int32</code> là từ 0 đến 4294967295, phạm vi giá trị này đủ để đánh dấu địa chỉ tất cả ô nhớ trong <strong>Virtual memory</strong> của nền tảng hệ điều hành <strong>32 bits</strong>. Tương tự, phạm vi giá trị của <code>unsigned __int64</code> là tử 0 đến 18446744073709551615, đủ để đánh dấu địa chỉ của tất cả ô nhớ trong <strong>Virtual memory</strong> của nền tảng hệ điều hành <strong>64 bits</strong>.</p>\n\n<p>Dưới đây là thông tin Virtual memory trên máy tính của mình:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/virtual_memory.png?raw=true\" width=\"354\" height=\"465\"></p>\n\n<p>Dung lượng bộ nhớ ảo hiện tại của máy mình là <strong>1960MB</strong>, tương đương với <strong>2055208960 bytes</strong>. Trong khi đó, con trỏ trong nền tảng hệ điều hành <strong>32 bits</strong> có kích thước <strong>4 bytes</strong>, giá trị địa chỉ lớn nhất mà con trỏ <strong>4 bytes</strong> có thể lưu trữ được là <strong>4294967295</strong>, nên nó đủ để lưu trữ bất kì địa chỉ của biến nào được cấp phát trên bộ nhớ ảo.</p>\n\n<h5>Gán giá trị cho con trỏ</h5>\n\n<p>Giá trị mà biến con trỏ lưu trữ là địa chỉ của biến khác có cùng kiểu dữ liệu với biến con trỏ.</p>\n\n<pre><code>int *ptr;\nint value = 5;\n\nptr = &amp;value;</code></pre>\n\n<p>Do đó, chúng ta cần sử dụng <strong>address-of operator</strong> để lấy ra địa chỉ ảo của biến rồi mới gán cho con trỏ được. Lúc này, biến ptr sẽ lưu trữ địa chỉ ảo của biến value.</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/7.png?raw=true\" width=\"409\" height=\"145\"></p>\n\n<p>(Nguồn: <a href=\"http://www.learncpp.com\" rel=\"nofollow\">www.learncpp.com</a>)</p>\n\n<p>Chúng ta có thể nói rằng con trỏ <strong>ptr</strong> đang nắm giữ địa chỉ của biến <strong>value</strong>, cũng có thể nói con trỏ <strong>ptr</strong> trỏ đến biến <strong>value</strong>.</p>\n\n<p>Đoạn chương trình sau sẽ in ra địa chỉ của biến value và giá trị được lưu bởi con trỏ ptr sau khi trỏ đến biến value:</p>\n\n<pre><code>int main()\n{\n\tint value = 5;\n\tint *ptr = &amp;value;\n\t\n\tcout &lt;&lt; &amp;value &lt;&lt; endl;\n\tcout &lt;&lt; ptr &lt;&lt; endl;\n\n\tsystem(\"pause\");\n\treturn 0;\n}</code></pre>\n\n<p>Kết quả thu được trên màn hình console:</p>\n\n<pre><code>0012FF7C\n0012FF7C</code></pre>\n\n<p>Lý do mà chúng ta gán được địa chỉ của biến <strong>value</strong> cho con trỏ kiểu <strong>int</strong> (int *) là vì <strong>address-of operator</strong> của một biến kiểu <strong>int</strong> trả về giá trị kiểu con trỏ kiểu <strong>int</strong> (int *).</p>\n\n<p>Thử xem xét đoạn chương trình sau:</p>\n\n<pre><code>#include &lt;iostream&gt;\nusing namespace std;\n\nint main()\n{\n\t\n\tint value = 5;\n\tcout &lt;&lt; typeid(&amp;value).name() &lt;&lt; endl;\n\t\n\tsystem(\"pause\");\n\treturn 0;\n}</code></pre>\n\n<p>Kết quả in ra màn hình của toán tử lấy địa chỉ ở trên là:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/8.png?raw=true\" width=\"677\" height=\"343\"></p>\n\n<p>Do đó, chúng ta có thể gán <code>&amp;value</code> cho con trỏ kiểu <strong>int</strong> (int *).</p>\n\n<p>Bên cạnh đó, khi có hai con trỏ cùng kiểu thì chúng ta có thể gán trực tiếp mà không cần sử dụng <strong>address-of operator</strong>.</p>\n\n<pre><code>int main()\n{\n\tint value = 5;\n\tint *ptr1, *ptr2;\n\n\tptr1 = &amp;value; //ptr1 point to value\n\tptr2 = ptr1;   //assign value of ptr1 to ptr2\n\n\tcout &lt;&lt; ptr1 &lt;&lt; endl;\n\tcout &lt;&lt; ptr2 &lt;&lt; endl;\n\n\tsystem(\"pause\");\n\treturn 0;\n}</code></pre>\n\n<p>Lúc này, <strong>ptr1</strong> và <strong>ptr2</strong> cùng giữ địa chỉ của biến <strong>value</strong>.</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/9.png?raw=true\" width=\"677\" height=\"343\"></p>\n\n<p><strong><em>Khác với tham chiếu (reference), một con trỏ có thể trỏ đến địa chỉ khác trong bộ nhớ ảo sau khi đã được gán giá trị. Tham chiếu (reference) không thể thay đổi địa chỉ sau lần tham chiếu đầu tiên.</em></strong></p>\n\n<p>Ví dụ:</p>\n\n<pre><code>int main()\n{\n\tint *ptr;\n\n\tint arr[5] = { 1, 2, 3, 4, 5 };\n\n\tfor(int i = 0; i &lt; 5; i++)\n\t{\n\t\tptr = &amp;arr[i];\n\t\tcout &lt;&lt; ptr &lt;&lt; endl;\n\t}\n\n\tsystem(\"pause\");\n\treturn 0;\n}</code></pre>\n\n<p>Kết quả của đoạn chương trình này là:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/10.png?raw=true\" width=\"677\" height=\"343\"></p>\n\n<p>Con trỏ <strong>ptr</strong> đã trỏ đến lần lượt 5 phần tử của mảng <strong>arr</strong>. Nếu các bạn để ý sẽ thấy 5 địa chỉ này liên tiếp nhau trên bộ nhớ ảo. Mình sẽ trình bày vấn đề này trong các bài học sau.</p>\n\n<h5>Các phép gán không hợp lệ khi sử dụng con trỏ</h5>\n\n<p>Phép gán của con trỏ chỉ thực hiện được khi kiểu dữ liệu của con trỏ phù hợp kiểu dữ liệu của biến mà nó sẽ trỏ tới. Do đó, các phép gán dưới đây là không hợp lệ:</p>\n\n<pre><code>int iValue = 0;\nfloat fValue = 0.0;\n\nint *i_ptr = fValue;   //wrong! int pointer cannot point to the address of a double variable\nfloat *f_ptr = iValue; //wrong! float pointer cannot point to the address of an int variable</code></pre>\n\n<p>Mặc dù giá trị mà con trỏ lưu trữ có kiểu <strong>unsigned int</strong>, nhưng chúng ta không thể gán trực tiếp một giá trị địa chỉ cho con trỏ được.</p>\n\n<pre><code>int *ptr = 1245052; //wrong!</code></pre>\n\n<p>Giá trị 1245052 không có địa chỉ cụ thể, trong khi đó, con trỏ chỉ nhận giá trị là địa chỉ nên phép gán trên là sai. Mặc dù giá trị được chuyển về dạng cơ số thập lục phân để tương xứng với định dạng giá trị mà con trỏ in ra, điều này cũng không được cho phép.</p>\n\n<pre><code>int *ptr = 0012FF7C; //wrong!</code></pre>\n\n<p><strong><em>Chỉ có giá trị kiểu con trỏ (có được nhờ toán tử address-of, hoặc từ một biến con trỏ cùng kiểu khác) mới có thể gán được cho biến con trỏ.</em></strong></p>\n\n<h5>Truy xuất giá trị bên trong vùng nhớ mà con trỏ trỏ đến</h5>\n\n<p>Khi chúng ta có một con trỏ đã được trỏ đến địa chỉ nào đó trong bộ nhớ ảo, chúng ta có thể truy xuất giá trị tại địa chỉ đó bằng <strong>dereference operator</strong>. <strong>Dereference operator</strong> sẽ đánh giá nội dung địa chỉ được trỏ đến.</p>\n\n<pre><code>int *ptr; //declare an int pointer\nint value = 5;\n\nptr = &amp;value; //ptr point to value\n\ncout &lt;&lt; &amp;value &lt;&lt; endl; //print the address of value\ncout &lt;&lt; ptr &lt;&lt; endl;    //print the address of value which is held in ptr\n\ncout &lt;&lt; value &lt;&lt; endl;  //print the content of value\ncout &lt;&lt; *(&amp;value) &lt;&lt; endl; //print the content of value\ncout &lt;&lt; *ptr &lt;&lt; endl;\t//print the content of value</code></pre>\n\n<p>Kết quả của đoạn chương trình trên như sau:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/11.png?raw=true\" width=\"677\" height=\"343\"></p>\n\n<p>Toán tử trỏ đến (<strong>dereference operator</strong>) được dùng để truy cập trực tiếp vào vùng nhớ có địa chỉ cụ thể trên bộ nhớ ảo (<strong>virtual memory</strong>), vì biến con trỏ <strong>ptr</strong> đang giữ địa chỉ của biến <strong>value</strong> nên khi đặt toán tử trỏ đến (<strong>dereference operator</strong>) trước con trỏ <strong>ptr</strong>, nó sẽ truy xuất giá trị tại địa chỉ mà con trỏ <strong>ptr</strong> đang giữ.</p>\n\n<p>Vì <strong>ptr</strong> có kiểu dữ liệu <strong>con trỏ int</strong> (int *), <strong>ptr</strong> chỉ có thể trỏ đến biến kiểu <strong>int</strong>. Lúc này, <strong>compiler</strong> hiểu rằng cần phân tích <strong>4 bytes</strong> (đúng bằng kích thước kiểu <strong>int</strong>) trên bộ nhớ ảo tại địa chỉ mà <strong>ptr</strong> đang lưu trữ.</p>\n\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/12.png?raw=true\" class=\"lightbox\" title=\"12.png?raw=true\" rel=\"nofollow\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/12.png?raw=true\" width=\"690\" height=\"328\"><div class=\"meta\">\n<span class=\"filename\">12.png?raw=true</span><span class=\"informations\">764x364</span><span class=\"expand\"></span>\n</div></a></div></p>\n\n<p>Đây là lý do tại sao chúng ta cần khai báo kiểu dữ liệu của con trỏ. Nếu không khai báo kiểu dữ liệu cho con trỏ, toán tử trỏ đến (<strong>dereference operator</strong>) sẽ không biết phải phân tích bao nhiêu bytes tại địa chỉ con trỏ trỏ đến để tính toán được giá trị của vùng nhớ đó. Không những thế, đây còn là lý do kiểu dữ liệu của biến phải tương xứng với kiểu dữ liệu được khai báo cho con trỏ.</p>\n\n<p>Vì chúng ta có thể gán lại địa chỉ mới cho một con trỏ, nên chúng ta có thể truy xuất được giá trị của nhiều vùng nhớ khác nhau chỉ với một con trỏ:</p>\n\n<pre><code>int value1 = 1;\nint value2 = 2;\n\nint *ptr = &amp;value1;\ncout &lt;&lt; *ptr &lt;&lt; endl;\n\nptr = &amp;value2;\ncout &lt;&lt; *ptr &lt;&lt; endl;</code></pre>\n\n<p>Với khả năng truy cập đến vùng nhớ có địa chỉ cụ thể và thay đổi giá trị bên trong vùng nhớ của toán tử trỏ đến (<strong>dereference operator</strong>), chúng ta có thể sử dụng như sau:</p>\n\n<pre><code>int value = 5;\nint *ptr = &amp;value;\n\n*ptr = 10;\ncout &lt;&lt; *ptr &lt;&lt; endl;</code></pre>\n\n<p>Đoạn chương trình này sẽ in ra giá trị <strong>10</strong>.</p>\n\n<p>Có thể giải thích dòng lệnh <code>*ptr = 10;</code> như sau:</p>\n\n<p>Biến con trỏ <strong>ptr</strong> sau khi khai báo đã được khởi tạo bằng cách gán địa chỉ của biến <strong>value</strong>. Sử dụng <strong>dereference operator</strong> cho con trỏ <strong>ptr</strong> để truy cập đến địa chỉ ảo mà <strong>ptr</strong> đang nắm giữ, gán giá trị 10 vào vùng nhớ tại vị trí đó.</p>\n\n<h5>Con trỏ chưa được gán địa chỉ</h5>\n\n<p>Con trỏ trong ngôn ngữ C/C++ vốn không an toàn. Nếu sử dụng con trỏ không hợp lý có thể gây crash chương trình.</p>\n\n<p>Khác với tham chiếu (<strong>reference</strong>), biến con trỏ có thể không cần khởi tạo giá trị ngay khi khai báo. Nhưng thực hiện truy xuất giá trị của con trỏ bằng dereference operator khi chưa gán địa chỉ cụ thể cho con trỏ, chương trình có thể bị đóng bởi hệ điều hành. Nguyên nhân là do con trỏ đang nắm giữ một giá trị rác, giá trị rác đó có thể là địa chỉ thuộc một vùng nhớ đang được ứng dụng khác sử dụng, hoặc giá trị vượt quá giới hạn của bộ nhớ ảo.</p>\n\n<p>Trong chế độ <strong>Debug</strong> của Visual studio 2015, trường hợp này sẽ bị cảnh báo và ngăn chặn chương trình thực thi.</p>\n\n<p>Ví dụ:</p>\n\n<pre><code>int main()\n{\n\tint *ptr; //declare an int pointer\n\tcout &lt;&lt; *ptr &lt;&lt; endl;\n\n\tsystem(\"pause\");\n\treturn 0;\n}</code></pre>\n\n<p>Nhấn F5 để Debug chương trình sẽ nhận được thông báo:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/13.png?raw=true\" width=\"559\" height=\"318\"></p>\n\n<p>Do đó, khi khai báo con trỏ nhưng chưa có địa chỉ khởi tạo cụ thể, chúng ta nên gán cho con trỏ giá trị <strong>NULL</strong>.</p>\n\n<hr>\n\n<h3>NULL</h3>\n\n<p><strong>NULL</strong> là một macro đã được định nghĩa sẵn trong ngôn ngữ C/C++.</p>\n\n<pre><code>#define NULL 0</code></pre>\n\n<p>Đối với con trỏ, <strong>NULL</strong> là một giá trị đặc biệt, khi gán <strong>NULL</strong> cho con trỏ, điều đó có nghĩa là con trỏ đó chưa trỏ đến địa chỉ nào cả. Con trỏ đang giữ giá trị <strong>NULL</strong> được gọi là con trỏ <strong>NULL</strong> (<strong>NULL pointer</strong>).</p>\n\n<pre><code>int *ptr = NULL; //ptr is now a NULL pointer</code></pre>\n\n<p>Lúc này, chúng ta có thể kiểm tra xem con trỏ đã được gán địa chỉ cụ thể hay chưa:</p>\n\n<pre><code>int *ptr = NULL;\n\nif(ptr == NULL)\n{\n\tcout &lt;&lt; \"Do nothing\" &lt;&lt; endl;\n}\nelse\n{\n\tcout &lt;&lt; *ptr &lt;&lt; endl;\n}</code></pre>\n\n<p>Đoạn chương trình này sẽ giúp chương trình đảm bảo rằng con trỏ <strong>ptr</strong> sẽ không được sử dụng khi chưa được gán địa chỉ cụ thể.</p>\n\n<p>Chuẩn <strong>C++11</strong> cung cấp cho chúng ta từ khóa <strong>nullptr</strong> tương tự như macro <strong>NULL</strong>. Chúng ta có thể sử dụng như sau:</p>\n\n<pre><code>int *ptr = nullptr;</code></pre>\n\n<p>Bên cạnh đó, <strong>C++11</strong> còn định nghĩa cho chúng ta kiểu dữ liệu <code>std::nullptr_t</code>, <code>nullptr_t</code> chỉ có thể lưu trữ giá trị <strong>nullptr</strong>. Nhưng chúng ta ít khi sử dụng kiểu dữ liệu này nên các bạn cũng không cần quan tâm lắm.</p>\n\n<hr>\n\n<h3>Tổng kết</h3>\n\n<p>Trong bài học này, các bạn đã được tìm hiểu khái niệm con trỏ và một số khái niệm có liên quan. Việc sử dụng con trỏ thường có một số hoạt động chủ yếu: <strong>(a) khai báo một con trỏ, (b) gán địa chỉ cho con trỏ, (c) truy cập đến địa chỉ mà con trỏ đang nắm giữ bằng dereference operator</strong>.</p>\n\n<p>Thử liên hệ một chút với cuộc sống thực tế, tưởng tượng rằng con đường nhà bạn (street) là bộ nhớ ảo, trên con đường đó có rất nhiều ngôi nhà (house), mỗi ngôi nhà đều được đánh số thứ tự gọi là địa chỉ nhà (house's address). Chúng ta tạm hình dung số người ở trong mỗi ngôi nhà (content) tương đương với nội dung của mỗi ô trên bộ nhớ ảo. Như vậy, address-of operator (&amp;house) sẽ trả về địa chỉ của ngôi nhà, dereference operator (*&amp;house) sẽ lấy ra số lượng người bên trong ngôi nhà có địa chỉ được xác định. Để sử dụng con trỏ trỏ đến mỗi ngôi nhà, chúng ta phải sử dụng một con trỏ kiểu <strong>House</strong> (giống với kiểu của từng ngôi nhà), giả sử con trỏ kiểu <strong>House</strong> được khai báo là <code>House *h_ptr;</code> thì con trỏ <code>h_ptr</code> có thể trỏ đến bất kì ngôi nhà nào trên con đường, và nó còn có thể thay đổi nội dung bên trong từng ngôi nhà mà nó trỏ đến.</p>\n\n<p>Con trỏ (<strong>Pointer</strong>) là một công cụ mạnh mẽ đặc trưng của ngôn ngữ C/C++. Con trỏ cho phép chúng ta trực tiếp quản lý dung lượng của chương trình trên bộ nhớ ảo. Nhưng bên cạnh đó, việc sử dụng con trỏ không hợp lý có thể gây lãng phí tài nguyên của hệ thống máy tính. Chúng ta sẽ cùng tìm hiểu các kĩ thuật quản lý bộ nhớ ảo của chương trình trong các bài học tiếp theo.</p>\n\n<hr>\n\n<p><strong>Hẹn gặp lại các bạn trong bài học tiếp theo trong khóa học lập trình C++ hướng thực hành.</strong></p>\n\n<p>Mọi ý kiến đóng góp hoặc thắc mắc có thể đặt câu hỏi trực tiếp tại diễn đàn.</p>\n\n<p><a title=\"DayNhauHoc\" class=\"onebox\" target=\"_blank\">www.daynhauhoc.com</a></p>\n\n<hr>\n\n<h3>Link Videos khóa học</h3>\n\n<p><a href=\"https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview\" class=\"onebox\" target=\"_blank\" rel=\"nofollow\">https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview</a></p>\n","rawBody":"\n<h4>Chào các bạn học viên đang theo dõi khóa học lập trình trực tuyến ngôn ngữ C++.</h4>\n\n<p>Trong chương này, chúng ta sẽ cùng nhau tìm hiểu về khái niệm con trỏ (<strong>Pointer</strong>) - một đặc trưng của ngôn ngữ lập trình C/C++.</p>\n\n<p>Trước khi vào bài học này, chúng ta cùng nhau xem lại một số khái niệm liên quan đến vùng nhớ, địa chỉ của biến, tham chiếu...</p>\n\n<h5>Variable</h5>\n\n<p>Variable (hay còn gọi là biến) là một ô nhớ đơn lẻ hoặc một vùng nhớ được hệ điều hành cấp phát cho chương trình C++ nhằm để lưu trữ giá trị vào bên trong vùng nhớ đó. Để truy xuất đến giá trị mà biến đang nắm giữ, chương trình cần tìm đến vùng nhớ (địa chỉ) của biến để đọc giá trị bên trong vùng nhớ đó, cũng như bạn muốn lấy món đồ bên trong cái hộp, bạn cần biết cái hộp được đặt ở đâu.</p>\n\n<p>Khi thao tác với các biến thông thường, chúng ta không cần quan tâm đến địa chỉ vùng nhớ của biến. Khi cần truy xuất giá trị của biến, chúng ta chỉ cần gọi định danh (hay thường gọi là tên biến).</p>\n\n<p>Ví dụ:</p>\n\n<pre><code>int money;</code></pre>\n\n<p>Khi dòng lệnh này được CPU thực thi, một vùng nhớ có kích thước 4 bytes sẽ được cấp phát. Lấy ví dụ biến money này được đặt tại ô nhớ 1224 (trong địa chỉ ảo của máy tính).</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/0.png?raw=true\" width=\"400\" height=\"300\"></p>\n\n<p>Bất cứ khi nào chương trình thấy các bạn sử dụng biến money trong câu lệnh, chương trình hiểu rằng cần tìm đến ô nhớ 1224 để lấy giá trị đó ra.</p>\n\n<h5>Virtual memory &amp; Physical memory</h5>\n\n<p>Việc truy xuất dữ liệu trên bộ nhớ máy tính cần phải thông qua một số bước trung gian, người dùng không thể trực tiếp truy xuất vào các ô nhớ trên các thiết bị lưu trữ. Chúng ta chỉ có thể trỏ đến vùng nhớ ảo (virtual memory) trên máy tính, còn việc truy xuất đến bộ nhớ vật lý (physical memory) từ bộ nhớ ảo phải được thực hiện bởi thiết bị phần cứng có tên là <strong>Memory management unit (MMU)</strong> và một chương trình định vị địa chỉ bộ nhớ gọi là <strong>Virtual address space</strong>.</p>\n\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/1.png?raw=true\" class=\"lightbox\" title=\"1.png?raw=true\" rel=\"nofollow\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/1.png?raw=true\" width=\"690\" height=\"373\"><div class=\"meta\">\n<span class=\"filename\">1.png?raw=true</span><span class=\"informations\">1045x566</span><span class=\"expand\"></span>\n</div></a></div></p>\n\n<p>Virtual memory làm che giấu sự phân mảnh của bộ nhớ vật lý, khiến chúng ta có cảm giác đang thao tác với các vùng nhớ liên tục. Trong hình trên, từ phía Virtual memory cho đến Physical memory thuộc về phần quản lý của hệ điều hành, lập trình viên và người dùng chúng ta không thể can thiệp trực tiếp đến trong quá trình máy tính đang hoạt động.</p>\n\n<h5>Variable address &amp; address-of operator</h5>\n\n<p>Địa chỉ của biến mà chúng ta nhìn thấy thật ra chỉ là những giá trị đã được đánh số thứ tự đặt trên Virtual memory. Để lấy được địa chỉ ảo của biến trong chương trình, chúng ta sử dụng toán tử <strong>'&amp;'</strong> đặt trước tên biến.</p>\n\n<pre><code>int x = 5;\nstd::cout &lt;&lt; x &lt;&lt; '\\n'; // print the value of variable x\nstd::cout &lt;&lt; &amp;x &lt;&lt; '\\n'; // print the memory address of variable x</code></pre>\n\n<p>Trên máy tính của mình, kết quả của đoạn chương trình trên được in ra như sau:</p>\n\n<pre><code>5\n0027FEA0</code></pre>\n\n<p>Dòng đầu tiên là kết quả của việc truy xuất giá trị của biến thông qua định danh (tên biến). Dòng thứ hai là kết quả của việc truy xuất đến địa chỉ ảo của biến.</p>\n\n<h5>Tham chiếu (Reference)</h5>\n\n<p>Mục đích của tham chiếu trong C++ là tạo ra một biến khác có cùng kiểu dữ liệu nhưng sử dụng chung vùng nhớ với biến được tham chiếu đến.</p>\n\n<pre><code>int i1 = 10;\nint &amp;i_ref = i1;        //reference to i1, not means address of i1\n\ncout &lt;&lt; &amp;i1 &lt;&lt; endl;    //get address of i1\ncout &lt;&lt; &amp;i_ref &lt;&lt; endl; //get address of i_ref</code></pre>\n\n<p>Kết quả chúng ta được:</p>\n\n<pre><code>0xBFEB475C\n0xBFEB475C</code></pre>\n\n<p>Như vậy, mọi hành vi thay đổi giá trị của <code>i_ref</code> đều tác động trực tiếp đến <code>i1</code>.</p>\n\n<p><strong><em>Lưu ý: Biến tham chiếu sẽ có địa chỉ cố định sau khi khởi tạo. Chúng ta không thể tham chiếu lại lần nữa.</em></strong></p>\n\n<h5>Dereference operator</h5>\n\n<p>Toán tử trỏ đến (<strong>dereference operator</strong>) hay còn gọi là <strong>indirection operator</strong> (toán tử điều hành gián tiếp) được kí hiệu bằng dấu sao <strong>\" * \"</strong> cho phép chúng ta lấy ra giá trị của vùng nhớ có địa chỉ cụ thể.</p>\n\n<p>Ví dụ:</p>\n\n<pre><code>int n = 5;\n\ncout &lt;&lt; n &lt;&lt; endl;     //print the value of variable n\ncout &lt;&lt; &amp;n &lt;&lt; endl;    //print the virtual memory address of variable n\ncout &lt;&lt; *(&amp;n) &lt;&lt; endl; //print the value at the virtual memory address of variable n</code></pre>\n\n<ul>\n<li><p>Dòng lệnh cout đầu tiên khá dễ hiểu, nó thực hiện in ra giá trị của biến n bằng cách gọi định danh n, còn lại phần truy xuất đến địa chỉ ảo của biến n sẽ do chương trình đảm nhiệm.</p></li>\n<li><p>Dòng lệnh cout thứ hai không dùng để lấy ra giá trị bên trong vùng nhớ mà biến n đang nắm giữ, mà nó lấy ra địa chỉ ảo của biến n.</p></li>\n<li><p>Dòng lệnh cout thứ ba chúng ta sử dụng toán tử trỏ đến <strong>\" * \"</strong> đặt trước toán tử <strong>address-of</strong>. Khi đó, <strong>(&amp;n)</strong> sẽ lấy ra địa chỉ ảo của biến n, và toán tử * sẽ truy xuất giá trị bên trong địa chỉ đó.</p></li>\n</ul>\n\n<p>Kết quả của đoạn chương trình trên là:</p>\n\n<pre><code>5\n0xBFD181AC\n5</code></pre>\n\n<p>Ngoài việc truy xuất giá trị trong vùng nhớ của một địa chỉ cụ thể, toán tử trỏ đến (<strong>dereference operator</strong>) còn có thể dùng để thay đổi giá trị bên trong vùng nhớ đó.</p>\n\n<pre><code>int n = 5;\ncout &lt;&lt; n &lt;&lt; endl;\n*(&amp;n) = 10;\ncout &lt;&lt; n &lt;&lt; endl;</code></pre>\n\n<p>Kết quả đoạn chương trình này là:</p>\n\n<pre><code>5\n10</code></pre>\n\n<p>Như vậy, <strong>dereference operator</strong> cho phép chúng ta thao tác trực tiếp trên <strong>Virtual memory</strong> mà không cần thông qua định danh (tên biến).</p>\n\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/2.png?raw=true\" class=\"lightbox\" title=\"2.png?raw=true\" rel=\"nofollow\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/2.png?raw=true\" width=\"690\" height=\"430\"><div class=\"meta\">\n<span class=\"filename\">2.png?raw=true</span><span class=\"informations\">786x490</span><span class=\"expand\"></span>\n</div></a></div></p>\n\n<p>Mặc dù <strong>dereference operator</strong> có kí hiệu giống <strong>multiplication operator</strong>, nhưng các bạn có thể phân biệt được vì <strong>dereference operator</strong> là toán tử một ngôi, trong khi đó, <strong>multiplication operator</strong> là toán tử hai ngôi.</p>\n\n<p>Khác với tham chiếu (<strong>reference</strong>), toán tử trỏ đến (<strong>dereference operator</strong>) không tạo ra một tên biến khác, mà nó truy xuất trực tiếp đến vùng nhớ có địa chỉ cụ thể trên <strong>Virtual memory</strong>.</p>\n\n<hr>\n\n<h3>Con trỏ (Pointer)</h3>\n\n<p>Với những khái niệm mình trình bày ở trên (một số khái niệm các bạn đã được học), bây giờ chúng ta có thể nói đến con trỏ (<strong>pointer</strong>).</p>\n\n<blockquote><p>Một con trỏ (a <strong>pointer</strong>) là một biến được dùng để lưu trữ địa chỉ của biến khác.</p></blockquote>\n\n<p>Khác với tham chiếu, con trỏ là một biến có địa chỉ độc lập so với vùng nhớ mà nó trỏ đến, nhưng giá trị bên trong vùng nhớ của con trỏ chính là địa chỉ của biến (hoặc địa chỉ ảo) mà nó trỏ tới.</p>\n\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/3.png?raw=true\" class=\"lightbox\" title=\"3.png?raw=true\" rel=\"nofollow\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/3.png?raw=true\" width=\"690\" height=\"411\"><div class=\"meta\">\n<span class=\"filename\">3.png?raw=true</span><span class=\"informations\">983x586</span><span class=\"expand\"></span>\n</div></a></div></p>\n\n<p>Trong ví dụ trên, một con trỏ sau khi khai báo đã được cấp phát vùng nhớ tại địa chỉ 3255, và nó trỏ đến địa chỉ 1224, do đó, giá trị bên trong vùng nhớ của con trỏ là 1224.</p>\n\n<h5>Khai báo con trỏ</h5>\n\n<p>Cũng giống như biến thông thường, biến con trỏ cần được khai báo trước khi sử dụng. Con trỏ yêu cầu cú pháp khai báo mới hơn một chút so với biến thông thường.</p>\n\n<pre><code>&lt;data_type&gt; *&lt;name_of_pointer&gt;;</code></pre>\n\n<p>Khác với biến thông thường, chúng ta cần đặt thêm dấu sao giữa kiểu dữ liệu và tên biến của con trỏ.</p>\n\n<p>Ví dụ:</p>\n\n<pre><code>int *iPtr;\nfloat *fPtr;\ndouble *dPtr;\n\nint *iPtr1, *iPtr2;</code></pre>\n\n<p><strong><em>Lưu ý: Dấu sao trong khai báo con trỏ không phải là toán tử trỏ đến (dereference operator), nó chỉ là cú pháp được ngôn ngữ C/C++ quy định.</em></strong></p>\n\n<h5>Cách khai báo dễ gây nhầm lẫn</h5>\n\n<p>Ngôn ngữ C/C++ yêu cầu đặt dấu sao giữa kiểu dữ liệu và tên con trỏ nhưng không bắt buộc phải đặt nó gần với kiểu dữ liệu hay gần với tên con trỏ. Do đó, những cách khai báo dưới đây đều được cho phép:</p>\n\n<pre><code>int *iPtr1; //We recommended you use this way to declare pointers\nint* iPtr2;</code></pre>\n\n<p>Nhưng mình khuyến nghị các bạn sử dụng cách khai báo đặt dấu sao ngay trước tên con trỏ vì cách thứ hai có thể gây nhầm lẫn.</p>\n\n<pre><code>int* iPtr1, iPtr2;</code></pre>\n\n<p>Với cách khai báo này, <strong>iPtr1</strong> là một con trỏ kiểu <strong>int</strong>, trong khi đó, <strong>iPtr2</strong> là một biến kiểu <strong>int</strong>. Để có được hai con trỏ, chúng ta cần khai báo như sau:</p>\n\n<pre><code>int *iPtr1, *iPtr2;</code></pre>\n\n<h5>Kích thước của con trỏ trong bộ nhớ</h5>\n\n<p>Các bạn cùng chạy thử đoạn chương trình dưới đây:</p>\n\n<pre><code>cout &lt;&lt; sizeof(char*) &lt;&lt; endl;\ncout &lt;&lt; sizeof(int*) &lt;&lt; endl;\ncout &lt;&lt; sizeof(double*) &lt;&lt; endl;\ncout &lt;&lt; sizeof(string*) &lt;&lt; endl;</code></pre>\n\n<p>Đoạn chương trình trên cho ra kết quả như sau:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/4.png?raw=true\" width=\"677\" height=\"343\"></p>\n\n<p>Tại cửa sổ giao diện của Visual studio 2015, chúng ta chuyển sang Debug trên nền tảng 64 bits.</p>\n\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/5.png?raw=true\" class=\"lightbox\" title=\"5.png?raw=true\" rel=\"nofollow\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/5.png?raw=true\" width=\"690\" height=\"321\"><div class=\"meta\">\n<span class=\"filename\">5.png?raw=true</span><span class=\"informations\">901x420</span><span class=\"expand\"></span>\n</div></a></div></p>\n\n<p>Nhấn F5 lại lần nữa và xem lại kết quả:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/6.png?raw=true\" width=\"677\" height=\"343\"></p>\n\n<p><strong><em>Như vậy, chúng ta thấy rằng khi chạy trên nền tảng hệ điều hành 32 bits con trỏ sẽ có kích thước 4 bytes, khi chạy trên nền tảng hệ điều hành 64 bits con trỏ sẽ có kích thước 8 bytes.</em></strong></p>\n\n<p>Kiểu dữ liệu của con trỏ thay đổi không hề tác động đến kích thước bộ nhớ của con trỏ. Bởi vì giá trị thực sự của con trỏ là kiểu số nguyên không dấu (<strong>unsigned int</strong>), trong nền tảng hệ điều hành <strong>32 bits</strong>, giá trị mà con trỏ lưu trữ sẽ là <code>unsigned __int32</code>, và trong nền tảng hệ điều hành <strong>64 bits</strong>, giá trị của con trỏ lưu trữ có kiểu <code>unsigned __int64</code>.</p>\n\n<p><strong><em>Kiểu dữ liệu của con trỏ không mô tả giá trị địa chỉ được lưu trữ bên trong con trỏ, mà kiểu dữ liệu của con trỏ dùng để xác định kiểu dữ liệu của biến mà nó trỏ đến trên bộ nhớ ảo.</em></strong></p>\n\n<p>Vậy tại sao lại cần 4 bytes cho một con trỏ trong hệ điều hành 32 bits, và cần 8 bytes cho một con trỏ trong hệ điều hành 64 bits?</p>\n\n<p>Phạm vi giá trị của <code>unsigned __int32</code> là từ 0 đến 4294967295, phạm vi giá trị này đủ để đánh dấu địa chỉ tất cả ô nhớ trong <strong>Virtual memory</strong> của nền tảng hệ điều hành <strong>32 bits</strong>. Tương tự, phạm vi giá trị của <code>unsigned __int64</code> là tử 0 đến 18446744073709551615, đủ để đánh dấu địa chỉ của tất cả ô nhớ trong <strong>Virtual memory</strong> của nền tảng hệ điều hành <strong>64 bits</strong>.</p>\n\n<p>Dưới đây là thông tin Virtual memory trên máy tính của mình:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/virtual_memory.png?raw=true\" width=\"354\" height=\"465\"></p>\n\n<p>Dung lượng bộ nhớ ảo hiện tại của máy mình là <strong>1960MB</strong>, tương đương với <strong>2055208960 bytes</strong>. Trong khi đó, con trỏ trong nền tảng hệ điều hành <strong>32 bits</strong> có kích thước <strong>4 bytes</strong>, giá trị địa chỉ lớn nhất mà con trỏ <strong>4 bytes</strong> có thể lưu trữ được là <strong>4294967295</strong>, nên nó đủ để lưu trữ bất kì địa chỉ của biến nào được cấp phát trên bộ nhớ ảo.</p>\n\n<h5>Gán giá trị cho con trỏ</h5>\n\n<p>Giá trị mà biến con trỏ lưu trữ là địa chỉ của biến khác có cùng kiểu dữ liệu với biến con trỏ.</p>\n\n<pre><code>int *ptr;\nint value = 5;\n\nptr = &amp;value;</code></pre>\n\n<p>Do đó, chúng ta cần sử dụng <strong>address-of operator</strong> để lấy ra địa chỉ ảo của biến rồi mới gán cho con trỏ được. Lúc này, biến ptr sẽ lưu trữ địa chỉ ảo của biến value.</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/7.png?raw=true\" width=\"409\" height=\"145\"></p>\n\n<p>(Nguồn: <a href=\"http://www.learncpp.com\" rel=\"nofollow\">www.learncpp.com</a>)</p>\n\n<p>Chúng ta có thể nói rằng con trỏ <strong>ptr</strong> đang nắm giữ địa chỉ của biến <strong>value</strong>, cũng có thể nói con trỏ <strong>ptr</strong> trỏ đến biến <strong>value</strong>.</p>\n\n<p>Đoạn chương trình sau sẽ in ra địa chỉ của biến value và giá trị được lưu bởi con trỏ ptr sau khi trỏ đến biến value:</p>\n\n<pre><code>int main()\n{\n\tint value = 5;\n\tint *ptr = &amp;value;\n\t\n\tcout &lt;&lt; &amp;value &lt;&lt; endl;\n\tcout &lt;&lt; ptr &lt;&lt; endl;\n\n\tsystem(\"pause\");\n\treturn 0;\n}</code></pre>\n\n<p>Kết quả thu được trên màn hình console:</p>\n\n<pre><code>0012FF7C\n0012FF7C</code></pre>\n\n<p>Lý do mà chúng ta gán được địa chỉ của biến <strong>value</strong> cho con trỏ kiểu <strong>int</strong> (int *) là vì <strong>address-of operator</strong> của một biến kiểu <strong>int</strong> trả về giá trị kiểu con trỏ kiểu <strong>int</strong> (int *).</p>\n\n<p>Thử xem xét đoạn chương trình sau:</p>\n\n<pre><code>#include &lt;iostream&gt;\nusing namespace std;\n\nint main()\n{\n\t\n\tint value = 5;\n\tcout &lt;&lt; typeid(&amp;value).name() &lt;&lt; endl;\n\t\n\tsystem(\"pause\");\n\treturn 0;\n}</code></pre>\n\n<p>Kết quả in ra màn hình của toán tử lấy địa chỉ ở trên là:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/8.png?raw=true\" width=\"677\" height=\"343\"></p>\n\n<p>Do đó, chúng ta có thể gán <code>&amp;value</code> cho con trỏ kiểu <strong>int</strong> (int *).</p>\n\n<p>Bên cạnh đó, khi có hai con trỏ cùng kiểu thì chúng ta có thể gán trực tiếp mà không cần sử dụng <strong>address-of operator</strong>.</p>\n\n<pre><code>int main()\n{\n\tint value = 5;\n\tint *ptr1, *ptr2;\n\n\tptr1 = &amp;value; //ptr1 point to value\n\tptr2 = ptr1;   //assign value of ptr1 to ptr2\n\n\tcout &lt;&lt; ptr1 &lt;&lt; endl;\n\tcout &lt;&lt; ptr2 &lt;&lt; endl;\n\n\tsystem(\"pause\");\n\treturn 0;\n}</code></pre>\n\n<p>Lúc này, <strong>ptr1</strong> và <strong>ptr2</strong> cùng giữ địa chỉ của biến <strong>value</strong>.</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/9.png?raw=true\" width=\"677\" height=\"343\"></p>\n\n<p><strong><em>Khác với tham chiếu (reference), một con trỏ có thể trỏ đến địa chỉ khác trong bộ nhớ ảo sau khi đã được gán giá trị. Tham chiếu (reference) không thể thay đổi địa chỉ sau lần tham chiếu đầu tiên.</em></strong></p>\n\n<p>Ví dụ:</p>\n\n<pre><code>int main()\n{\n\tint *ptr;\n\n\tint arr[5] = { 1, 2, 3, 4, 5 };\n\n\tfor(int i = 0; i &lt; 5; i++)\n\t{\n\t\tptr = &amp;arr[i];\n\t\tcout &lt;&lt; ptr &lt;&lt; endl;\n\t}\n\n\tsystem(\"pause\");\n\treturn 0;\n}</code></pre>\n\n<p>Kết quả của đoạn chương trình này là:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/10.png?raw=true\" width=\"677\" height=\"343\"></p>\n\n<p>Con trỏ <strong>ptr</strong> đã trỏ đến lần lượt 5 phần tử của mảng <strong>arr</strong>. Nếu các bạn để ý sẽ thấy 5 địa chỉ này liên tiếp nhau trên bộ nhớ ảo. Mình sẽ trình bày vấn đề này trong các bài học sau.</p>\n\n<h5>Các phép gán không hợp lệ khi sử dụng con trỏ</h5>\n\n<p>Phép gán của con trỏ chỉ thực hiện được khi kiểu dữ liệu của con trỏ phù hợp kiểu dữ liệu của biến mà nó sẽ trỏ tới. Do đó, các phép gán dưới đây là không hợp lệ:</p>\n\n<pre><code>int iValue = 0;\nfloat fValue = 0.0;\n\nint *i_ptr = fValue;   //wrong! int pointer cannot point to the address of a double variable\nfloat *f_ptr = iValue; //wrong! float pointer cannot point to the address of an int variable</code></pre>\n\n<p>Mặc dù giá trị mà con trỏ lưu trữ có kiểu <strong>unsigned int</strong>, nhưng chúng ta không thể gán trực tiếp một giá trị địa chỉ cho con trỏ được.</p>\n\n<pre><code>int *ptr = 1245052; //wrong!</code></pre>\n\n<p>Giá trị 1245052 không có địa chỉ cụ thể, trong khi đó, con trỏ chỉ nhận giá trị là địa chỉ nên phép gán trên là sai. Mặc dù giá trị được chuyển về dạng cơ số thập lục phân để tương xứng với định dạng giá trị mà con trỏ in ra, điều này cũng không được cho phép.</p>\n\n<pre><code>int *ptr = 0012FF7C; //wrong!</code></pre>\n\n<p><strong><em>Chỉ có giá trị kiểu con trỏ (có được nhờ toán tử address-of, hoặc từ một biến con trỏ cùng kiểu khác) mới có thể gán được cho biến con trỏ.</em></strong></p>\n\n<h5>Truy xuất giá trị bên trong vùng nhớ mà con trỏ trỏ đến</h5>\n\n<p>Khi chúng ta có một con trỏ đã được trỏ đến địa chỉ nào đó trong bộ nhớ ảo, chúng ta có thể truy xuất giá trị tại địa chỉ đó bằng <strong>dereference operator</strong>. <strong>Dereference operator</strong> sẽ đánh giá nội dung địa chỉ được trỏ đến.</p>\n\n<pre><code>int *ptr; //declare an int pointer\nint value = 5;\n\nptr = &amp;value; //ptr point to value\n\ncout &lt;&lt; &amp;value &lt;&lt; endl; //print the address of value\ncout &lt;&lt; ptr &lt;&lt; endl;    //print the address of value which is held in ptr\n\ncout &lt;&lt; value &lt;&lt; endl;  //print the content of value\ncout &lt;&lt; *(&amp;value) &lt;&lt; endl; //print the content of value\ncout &lt;&lt; *ptr &lt;&lt; endl;\t//print the content of value</code></pre>\n\n<p>Kết quả của đoạn chương trình trên như sau:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/11.png?raw=true\" width=\"677\" height=\"343\"></p>\n\n<p>Toán tử trỏ đến (<strong>dereference operator</strong>) được dùng để truy cập trực tiếp vào vùng nhớ có địa chỉ cụ thể trên bộ nhớ ảo (<strong>virtual memory</strong>), vì biến con trỏ <strong>ptr</strong> đang giữ địa chỉ của biến <strong>value</strong> nên khi đặt toán tử trỏ đến (<strong>dereference operator</strong>) trước con trỏ <strong>ptr</strong>, nó sẽ truy xuất giá trị tại địa chỉ mà con trỏ <strong>ptr</strong> đang giữ.</p>\n\n<p>Vì <strong>ptr</strong> có kiểu dữ liệu <strong>con trỏ int</strong> (int *), <strong>ptr</strong> chỉ có thể trỏ đến biến kiểu <strong>int</strong>. Lúc này, <strong>compiler</strong> hiểu rằng cần phân tích <strong>4 bytes</strong> (đúng bằng kích thước kiểu <strong>int</strong>) trên bộ nhớ ảo tại địa chỉ mà <strong>ptr</strong> đang lưu trữ.</p>\n\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/12.png?raw=true\" class=\"lightbox\" title=\"12.png?raw=true\" rel=\"nofollow\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/12.png?raw=true\" width=\"690\" height=\"328\"><div class=\"meta\">\n<span class=\"filename\">12.png?raw=true</span><span class=\"informations\">764x364</span><span class=\"expand\"></span>\n</div></a></div></p>\n\n<p>Đây là lý do tại sao chúng ta cần khai báo kiểu dữ liệu của con trỏ. Nếu không khai báo kiểu dữ liệu cho con trỏ, toán tử trỏ đến (<strong>dereference operator</strong>) sẽ không biết phải phân tích bao nhiêu bytes tại địa chỉ con trỏ trỏ đến để tính toán được giá trị của vùng nhớ đó. Không những thế, đây còn là lý do kiểu dữ liệu của biến phải tương xứng với kiểu dữ liệu được khai báo cho con trỏ.</p>\n\n<p>Vì chúng ta có thể gán lại địa chỉ mới cho một con trỏ, nên chúng ta có thể truy xuất được giá trị của nhiều vùng nhớ khác nhau chỉ với một con trỏ:</p>\n\n<pre><code>int value1 = 1;\nint value2 = 2;\n\nint *ptr = &amp;value1;\ncout &lt;&lt; *ptr &lt;&lt; endl;\n\nptr = &amp;value2;\ncout &lt;&lt; *ptr &lt;&lt; endl;</code></pre>\n\n<p>Với khả năng truy cập đến vùng nhớ có địa chỉ cụ thể và thay đổi giá trị bên trong vùng nhớ của toán tử trỏ đến (<strong>dereference operator</strong>), chúng ta có thể sử dụng như sau:</p>\n\n<pre><code>int value = 5;\nint *ptr = &amp;value;\n\n*ptr = 10;\ncout &lt;&lt; *ptr &lt;&lt; endl;</code></pre>\n\n<p>Đoạn chương trình này sẽ in ra giá trị <strong>10</strong>.</p>\n\n<p>Có thể giải thích dòng lệnh <code>*ptr = 10;</code> như sau:</p>\n\n<p>Biến con trỏ <strong>ptr</strong> sau khi khai báo đã được khởi tạo bằng cách gán địa chỉ của biến <strong>value</strong>. Sử dụng <strong>dereference operator</strong> cho con trỏ <strong>ptr</strong> để truy cập đến địa chỉ ảo mà <strong>ptr</strong> đang nắm giữ, gán giá trị 10 vào vùng nhớ tại vị trí đó.</p>\n\n<h5>Con trỏ chưa được gán địa chỉ</h5>\n\n<p>Con trỏ trong ngôn ngữ C/C++ vốn không an toàn. Nếu sử dụng con trỏ không hợp lý có thể gây crash chương trình.</p>\n\n<p>Khác với tham chiếu (<strong>reference</strong>), biến con trỏ có thể không cần khởi tạo giá trị ngay khi khai báo. Nhưng thực hiện truy xuất giá trị của con trỏ bằng dereference operator khi chưa gán địa chỉ cụ thể cho con trỏ, chương trình có thể bị đóng bởi hệ điều hành. Nguyên nhân là do con trỏ đang nắm giữ một giá trị rác, giá trị rác đó có thể là địa chỉ thuộc một vùng nhớ đang được ứng dụng khác sử dụng, hoặc giá trị vượt quá giới hạn của bộ nhớ ảo.</p>\n\n<p>Trong chế độ <strong>Debug</strong> của Visual studio 2015, trường hợp này sẽ bị cảnh báo và ngăn chặn chương trình thực thi.</p>\n\n<p>Ví dụ:</p>\n\n<pre><code>int main()\n{\n\tint *ptr; //declare an int pointer\n\tcout &lt;&lt; *ptr &lt;&lt; endl;\n\n\tsystem(\"pause\");\n\treturn 0;\n}</code></pre>\n\n<p>Nhấn F5 để Debug chương trình sẽ nhận được thông báo:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/13.png?raw=true\" width=\"559\" height=\"318\"></p>\n\n<p>Do đó, khi khai báo con trỏ nhưng chưa có địa chỉ khởi tạo cụ thể, chúng ta nên gán cho con trỏ giá trị <strong>NULL</strong>.</p>\n\n<hr>\n\n<h3>NULL</h3>\n\n<p><strong>NULL</strong> là một macro đã được định nghĩa sẵn trong ngôn ngữ C/C++.</p>\n\n<pre><code>#define NULL 0</code></pre>\n\n<p>Đối với con trỏ, <strong>NULL</strong> là một giá trị đặc biệt, khi gán <strong>NULL</strong> cho con trỏ, điều đó có nghĩa là con trỏ đó chưa trỏ đến địa chỉ nào cả. Con trỏ đang giữ giá trị <strong>NULL</strong> được gọi là con trỏ <strong>NULL</strong> (<strong>NULL pointer</strong>).</p>\n\n<pre><code>int *ptr = NULL; //ptr is now a NULL pointer</code></pre>\n\n<p>Lúc này, chúng ta có thể kiểm tra xem con trỏ đã được gán địa chỉ cụ thể hay chưa:</p>\n\n<pre><code>int *ptr = NULL;\n\nif(ptr == NULL)\n{\n\tcout &lt;&lt; \"Do nothing\" &lt;&lt; endl;\n}\nelse\n{\n\tcout &lt;&lt; *ptr &lt;&lt; endl;\n}</code></pre>\n\n<p>Đoạn chương trình này sẽ giúp chương trình đảm bảo rằng con trỏ <strong>ptr</strong> sẽ không được sử dụng khi chưa được gán địa chỉ cụ thể.</p>\n\n<p>Chuẩn <strong>C++11</strong> cung cấp cho chúng ta từ khóa <strong>nullptr</strong> tương tự như macro <strong>NULL</strong>. Chúng ta có thể sử dụng như sau:</p>\n\n<pre><code>int *ptr = nullptr;</code></pre>\n\n<p>Bên cạnh đó, <strong>C++11</strong> còn định nghĩa cho chúng ta kiểu dữ liệu <code>std::nullptr_t</code>, <code>nullptr_t</code> chỉ có thể lưu trữ giá trị <strong>nullptr</strong>. Nhưng chúng ta ít khi sử dụng kiểu dữ liệu này nên các bạn cũng không cần quan tâm lắm.</p>\n\n<hr>\n\n<h3>Tổng kết</h3>\n\n<p>Trong bài học này, các bạn đã được tìm hiểu khái niệm con trỏ và một số khái niệm có liên quan. Việc sử dụng con trỏ thường có một số hoạt động chủ yếu: <strong>(a) khai báo một con trỏ, (b) gán địa chỉ cho con trỏ, (c) truy cập đến địa chỉ mà con trỏ đang nắm giữ bằng dereference operator</strong>.</p>\n\n<p>Thử liên hệ một chút với cuộc sống thực tế, tưởng tượng rằng con đường nhà bạn (street) là bộ nhớ ảo, trên con đường đó có rất nhiều ngôi nhà (house), mỗi ngôi nhà đều được đánh số thứ tự gọi là địa chỉ nhà (house's address). Chúng ta tạm hình dung số người ở trong mỗi ngôi nhà (content) tương đương với nội dung của mỗi ô trên bộ nhớ ảo. Như vậy, address-of operator (&amp;house) sẽ trả về địa chỉ của ngôi nhà, dereference operator (*&amp;house) sẽ lấy ra số lượng người bên trong ngôi nhà có địa chỉ được xác định. Để sử dụng con trỏ trỏ đến mỗi ngôi nhà, chúng ta phải sử dụng một con trỏ kiểu <strong>House</strong> (giống với kiểu của từng ngôi nhà), giả sử con trỏ kiểu <strong>House</strong> được khai báo là <code>House *h_ptr;</code> thì con trỏ <code>h_ptr</code> có thể trỏ đến bất kì ngôi nhà nào trên con đường, và nó còn có thể thay đổi nội dung bên trong từng ngôi nhà mà nó trỏ đến.</p>\n\n<p>Con trỏ (<strong>Pointer</strong>) là một công cụ mạnh mẽ đặc trưng của ngôn ngữ C/C++. Con trỏ cho phép chúng ta trực tiếp quản lý dung lượng của chương trình trên bộ nhớ ảo. Nhưng bên cạnh đó, việc sử dụng con trỏ không hợp lý có thể gây lãng phí tài nguyên của hệ thống máy tính. Chúng ta sẽ cùng tìm hiểu các kĩ thuật quản lý bộ nhớ ảo của chương trình trong các bài học tiếp theo.</p>\n\n<hr>\n\n<p><strong>Hẹn gặp lại các bạn trong bài học tiếp theo trong khóa học lập trình C++ hướng thực hành.</strong></p>\n\n<p>Mọi ý kiến đóng góp hoặc thắc mắc có thể đặt câu hỏi trực tiếp tại diễn đàn.</p>\n\n<p><a title=\"DayNhauHoc\" class=\"onebox\" target=\"_blank\">www.daynhauhoc.com</a></p>\n\n<hr>\n\n<h3>Link Videos khóa học</h3>\n\n<p><a href=\"https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview\" class=\"onebox\" target=\"_blank\" rel=\"nofollow\">https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview</a></p>\n","raw":"---json\n{\"title\":\"8.0 Con trỏ\",\"route\":\"8/0-con-tr\"}\n---\n\n<h4>Chào các bạn học viên đang theo dõi khóa học lập trình trực tuyến ngôn ngữ C++.</h4>\n\n<p>Trong chương này, chúng ta sẽ cùng nhau tìm hiểu về khái niệm con trỏ (<strong>Pointer</strong>) - một đặc trưng của ngôn ngữ lập trình C/C++.</p>\n\n<p>Trước khi vào bài học này, chúng ta cùng nhau xem lại một số khái niệm liên quan đến vùng nhớ, địa chỉ của biến, tham chiếu...</p>\n\n<h5>Variable</h5>\n\n<p>Variable (hay còn gọi là biến) là một ô nhớ đơn lẻ hoặc một vùng nhớ được hệ điều hành cấp phát cho chương trình C++ nhằm để lưu trữ giá trị vào bên trong vùng nhớ đó. Để truy xuất đến giá trị mà biến đang nắm giữ, chương trình cần tìm đến vùng nhớ (địa chỉ) của biến để đọc giá trị bên trong vùng nhớ đó, cũng như bạn muốn lấy món đồ bên trong cái hộp, bạn cần biết cái hộp được đặt ở đâu.</p>\n\n<p>Khi thao tác với các biến thông thường, chúng ta không cần quan tâm đến địa chỉ vùng nhớ của biến. Khi cần truy xuất giá trị của biến, chúng ta chỉ cần gọi định danh (hay thường gọi là tên biến).</p>\n\n<p>Ví dụ:</p>\n\n<pre><code>int money;</code></pre>\n\n<p>Khi dòng lệnh này được CPU thực thi, một vùng nhớ có kích thước 4 bytes sẽ được cấp phát. Lấy ví dụ biến money này được đặt tại ô nhớ 1224 (trong địa chỉ ảo của máy tính).</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/0.png?raw=true\" width=\"400\" height=\"300\"></p>\n\n<p>Bất cứ khi nào chương trình thấy các bạn sử dụng biến money trong câu lệnh, chương trình hiểu rằng cần tìm đến ô nhớ 1224 để lấy giá trị đó ra.</p>\n\n<h5>Virtual memory &amp; Physical memory</h5>\n\n<p>Việc truy xuất dữ liệu trên bộ nhớ máy tính cần phải thông qua một số bước trung gian, người dùng không thể trực tiếp truy xuất vào các ô nhớ trên các thiết bị lưu trữ. Chúng ta chỉ có thể trỏ đến vùng nhớ ảo (virtual memory) trên máy tính, còn việc truy xuất đến bộ nhớ vật lý (physical memory) từ bộ nhớ ảo phải được thực hiện bởi thiết bị phần cứng có tên là <strong>Memory management unit (MMU)</strong> và một chương trình định vị địa chỉ bộ nhớ gọi là <strong>Virtual address space</strong>.</p>\n\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/1.png?raw=true\" class=\"lightbox\" title=\"1.png?raw=true\" rel=\"nofollow\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/1.png?raw=true\" width=\"690\" height=\"373\"><div class=\"meta\">\n<span class=\"filename\">1.png?raw=true</span><span class=\"informations\">1045x566</span><span class=\"expand\"></span>\n</div></a></div></p>\n\n<p>Virtual memory làm che giấu sự phân mảnh của bộ nhớ vật lý, khiến chúng ta có cảm giác đang thao tác với các vùng nhớ liên tục. Trong hình trên, từ phía Virtual memory cho đến Physical memory thuộc về phần quản lý của hệ điều hành, lập trình viên và người dùng chúng ta không thể can thiệp trực tiếp đến trong quá trình máy tính đang hoạt động.</p>\n\n<h5>Variable address &amp; address-of operator</h5>\n\n<p>Địa chỉ của biến mà chúng ta nhìn thấy thật ra chỉ là những giá trị đã được đánh số thứ tự đặt trên Virtual memory. Để lấy được địa chỉ ảo của biến trong chương trình, chúng ta sử dụng toán tử <strong>'&amp;'</strong> đặt trước tên biến.</p>\n\n<pre><code>int x = 5;\nstd::cout &lt;&lt; x &lt;&lt; '\\n'; // print the value of variable x\nstd::cout &lt;&lt; &amp;x &lt;&lt; '\\n'; // print the memory address of variable x</code></pre>\n\n<p>Trên máy tính của mình, kết quả của đoạn chương trình trên được in ra như sau:</p>\n\n<pre><code>5\n0027FEA0</code></pre>\n\n<p>Dòng đầu tiên là kết quả của việc truy xuất giá trị của biến thông qua định danh (tên biến). Dòng thứ hai là kết quả của việc truy xuất đến địa chỉ ảo của biến.</p>\n\n<h5>Tham chiếu (Reference)</h5>\n\n<p>Mục đích của tham chiếu trong C++ là tạo ra một biến khác có cùng kiểu dữ liệu nhưng sử dụng chung vùng nhớ với biến được tham chiếu đến.</p>\n\n<pre><code>int i1 = 10;\nint &amp;i_ref = i1;        //reference to i1, not means address of i1\n\ncout &lt;&lt; &amp;i1 &lt;&lt; endl;    //get address of i1\ncout &lt;&lt; &amp;i_ref &lt;&lt; endl; //get address of i_ref</code></pre>\n\n<p>Kết quả chúng ta được:</p>\n\n<pre><code>0xBFEB475C\n0xBFEB475C</code></pre>\n\n<p>Như vậy, mọi hành vi thay đổi giá trị của <code>i_ref</code> đều tác động trực tiếp đến <code>i1</code>.</p>\n\n<p><strong><em>Lưu ý: Biến tham chiếu sẽ có địa chỉ cố định sau khi khởi tạo. Chúng ta không thể tham chiếu lại lần nữa.</em></strong></p>\n\n<h5>Dereference operator</h5>\n\n<p>Toán tử trỏ đến (<strong>dereference operator</strong>) hay còn gọi là <strong>indirection operator</strong> (toán tử điều hành gián tiếp) được kí hiệu bằng dấu sao <strong>\" * \"</strong> cho phép chúng ta lấy ra giá trị của vùng nhớ có địa chỉ cụ thể.</p>\n\n<p>Ví dụ:</p>\n\n<pre><code>int n = 5;\n\ncout &lt;&lt; n &lt;&lt; endl;     //print the value of variable n\ncout &lt;&lt; &amp;n &lt;&lt; endl;    //print the virtual memory address of variable n\ncout &lt;&lt; *(&amp;n) &lt;&lt; endl; //print the value at the virtual memory address of variable n</code></pre>\n\n<ul>\n<li><p>Dòng lệnh cout đầu tiên khá dễ hiểu, nó thực hiện in ra giá trị của biến n bằng cách gọi định danh n, còn lại phần truy xuất đến địa chỉ ảo của biến n sẽ do chương trình đảm nhiệm.</p></li>\n<li><p>Dòng lệnh cout thứ hai không dùng để lấy ra giá trị bên trong vùng nhớ mà biến n đang nắm giữ, mà nó lấy ra địa chỉ ảo của biến n.</p></li>\n<li><p>Dòng lệnh cout thứ ba chúng ta sử dụng toán tử trỏ đến <strong>\" * \"</strong> đặt trước toán tử <strong>address-of</strong>. Khi đó, <strong>(&amp;n)</strong> sẽ lấy ra địa chỉ ảo của biến n, và toán tử * sẽ truy xuất giá trị bên trong địa chỉ đó.</p></li>\n</ul>\n\n<p>Kết quả của đoạn chương trình trên là:</p>\n\n<pre><code>5\n0xBFD181AC\n5</code></pre>\n\n<p>Ngoài việc truy xuất giá trị trong vùng nhớ của một địa chỉ cụ thể, toán tử trỏ đến (<strong>dereference operator</strong>) còn có thể dùng để thay đổi giá trị bên trong vùng nhớ đó.</p>\n\n<pre><code>int n = 5;\ncout &lt;&lt; n &lt;&lt; endl;\n*(&amp;n) = 10;\ncout &lt;&lt; n &lt;&lt; endl;</code></pre>\n\n<p>Kết quả đoạn chương trình này là:</p>\n\n<pre><code>5\n10</code></pre>\n\n<p>Như vậy, <strong>dereference operator</strong> cho phép chúng ta thao tác trực tiếp trên <strong>Virtual memory</strong> mà không cần thông qua định danh (tên biến).</p>\n\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/2.png?raw=true\" class=\"lightbox\" title=\"2.png?raw=true\" rel=\"nofollow\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/2.png?raw=true\" width=\"690\" height=\"430\"><div class=\"meta\">\n<span class=\"filename\">2.png?raw=true</span><span class=\"informations\">786x490</span><span class=\"expand\"></span>\n</div></a></div></p>\n\n<p>Mặc dù <strong>dereference operator</strong> có kí hiệu giống <strong>multiplication operator</strong>, nhưng các bạn có thể phân biệt được vì <strong>dereference operator</strong> là toán tử một ngôi, trong khi đó, <strong>multiplication operator</strong> là toán tử hai ngôi.</p>\n\n<p>Khác với tham chiếu (<strong>reference</strong>), toán tử trỏ đến (<strong>dereference operator</strong>) không tạo ra một tên biến khác, mà nó truy xuất trực tiếp đến vùng nhớ có địa chỉ cụ thể trên <strong>Virtual memory</strong>.</p>\n\n<hr>\n\n<h3>Con trỏ (Pointer)</h3>\n\n<p>Với những khái niệm mình trình bày ở trên (một số khái niệm các bạn đã được học), bây giờ chúng ta có thể nói đến con trỏ (<strong>pointer</strong>).</p>\n\n<blockquote><p>Một con trỏ (a <strong>pointer</strong>) là một biến được dùng để lưu trữ địa chỉ của biến khác.</p></blockquote>\n\n<p>Khác với tham chiếu, con trỏ là một biến có địa chỉ độc lập so với vùng nhớ mà nó trỏ đến, nhưng giá trị bên trong vùng nhớ của con trỏ chính là địa chỉ của biến (hoặc địa chỉ ảo) mà nó trỏ tới.</p>\n\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/3.png?raw=true\" class=\"lightbox\" title=\"3.png?raw=true\" rel=\"nofollow\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/3.png?raw=true\" width=\"690\" height=\"411\"><div class=\"meta\">\n<span class=\"filename\">3.png?raw=true</span><span class=\"informations\">983x586</span><span class=\"expand\"></span>\n</div></a></div></p>\n\n<p>Trong ví dụ trên, một con trỏ sau khi khai báo đã được cấp phát vùng nhớ tại địa chỉ 3255, và nó trỏ đến địa chỉ 1224, do đó, giá trị bên trong vùng nhớ của con trỏ là 1224.</p>\n\n<h5>Khai báo con trỏ</h5>\n\n<p>Cũng giống như biến thông thường, biến con trỏ cần được khai báo trước khi sử dụng. Con trỏ yêu cầu cú pháp khai báo mới hơn một chút so với biến thông thường.</p>\n\n<pre><code>&lt;data_type&gt; *&lt;name_of_pointer&gt;;</code></pre>\n\n<p>Khác với biến thông thường, chúng ta cần đặt thêm dấu sao giữa kiểu dữ liệu và tên biến của con trỏ.</p>\n\n<p>Ví dụ:</p>\n\n<pre><code>int *iPtr;\nfloat *fPtr;\ndouble *dPtr;\n\nint *iPtr1, *iPtr2;</code></pre>\n\n<p><strong><em>Lưu ý: Dấu sao trong khai báo con trỏ không phải là toán tử trỏ đến (dereference operator), nó chỉ là cú pháp được ngôn ngữ C/C++ quy định.</em></strong></p>\n\n<h5>Cách khai báo dễ gây nhầm lẫn</h5>\n\n<p>Ngôn ngữ C/C++ yêu cầu đặt dấu sao giữa kiểu dữ liệu và tên con trỏ nhưng không bắt buộc phải đặt nó gần với kiểu dữ liệu hay gần với tên con trỏ. Do đó, những cách khai báo dưới đây đều được cho phép:</p>\n\n<pre><code>int *iPtr1; //We recommended you use this way to declare pointers\nint* iPtr2;</code></pre>\n\n<p>Nhưng mình khuyến nghị các bạn sử dụng cách khai báo đặt dấu sao ngay trước tên con trỏ vì cách thứ hai có thể gây nhầm lẫn.</p>\n\n<pre><code>int* iPtr1, iPtr2;</code></pre>\n\n<p>Với cách khai báo này, <strong>iPtr1</strong> là một con trỏ kiểu <strong>int</strong>, trong khi đó, <strong>iPtr2</strong> là một biến kiểu <strong>int</strong>. Để có được hai con trỏ, chúng ta cần khai báo như sau:</p>\n\n<pre><code>int *iPtr1, *iPtr2;</code></pre>\n\n<h5>Kích thước của con trỏ trong bộ nhớ</h5>\n\n<p>Các bạn cùng chạy thử đoạn chương trình dưới đây:</p>\n\n<pre><code>cout &lt;&lt; sizeof(char*) &lt;&lt; endl;\ncout &lt;&lt; sizeof(int*) &lt;&lt; endl;\ncout &lt;&lt; sizeof(double*) &lt;&lt; endl;\ncout &lt;&lt; sizeof(string*) &lt;&lt; endl;</code></pre>\n\n<p>Đoạn chương trình trên cho ra kết quả như sau:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/4.png?raw=true\" width=\"677\" height=\"343\"></p>\n\n<p>Tại cửa sổ giao diện của Visual studio 2015, chúng ta chuyển sang Debug trên nền tảng 64 bits.</p>\n\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/5.png?raw=true\" class=\"lightbox\" title=\"5.png?raw=true\" rel=\"nofollow\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/5.png?raw=true\" width=\"690\" height=\"321\"><div class=\"meta\">\n<span class=\"filename\">5.png?raw=true</span><span class=\"informations\">901x420</span><span class=\"expand\"></span>\n</div></a></div></p>\n\n<p>Nhấn F5 lại lần nữa và xem lại kết quả:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/6.png?raw=true\" width=\"677\" height=\"343\"></p>\n\n<p><strong><em>Như vậy, chúng ta thấy rằng khi chạy trên nền tảng hệ điều hành 32 bits con trỏ sẽ có kích thước 4 bytes, khi chạy trên nền tảng hệ điều hành 64 bits con trỏ sẽ có kích thước 8 bytes.</em></strong></p>\n\n<p>Kiểu dữ liệu của con trỏ thay đổi không hề tác động đến kích thước bộ nhớ của con trỏ. Bởi vì giá trị thực sự của con trỏ là kiểu số nguyên không dấu (<strong>unsigned int</strong>), trong nền tảng hệ điều hành <strong>32 bits</strong>, giá trị mà con trỏ lưu trữ sẽ là <code>unsigned __int32</code>, và trong nền tảng hệ điều hành <strong>64 bits</strong>, giá trị của con trỏ lưu trữ có kiểu <code>unsigned __int64</code>.</p>\n\n<p><strong><em>Kiểu dữ liệu của con trỏ không mô tả giá trị địa chỉ được lưu trữ bên trong con trỏ, mà kiểu dữ liệu của con trỏ dùng để xác định kiểu dữ liệu của biến mà nó trỏ đến trên bộ nhớ ảo.</em></strong></p>\n\n<p>Vậy tại sao lại cần 4 bytes cho một con trỏ trong hệ điều hành 32 bits, và cần 8 bytes cho một con trỏ trong hệ điều hành 64 bits?</p>\n\n<p>Phạm vi giá trị của <code>unsigned __int32</code> là từ 0 đến 4294967295, phạm vi giá trị này đủ để đánh dấu địa chỉ tất cả ô nhớ trong <strong>Virtual memory</strong> của nền tảng hệ điều hành <strong>32 bits</strong>. Tương tự, phạm vi giá trị của <code>unsigned __int64</code> là tử 0 đến 18446744073709551615, đủ để đánh dấu địa chỉ của tất cả ô nhớ trong <strong>Virtual memory</strong> của nền tảng hệ điều hành <strong>64 bits</strong>.</p>\n\n<p>Dưới đây là thông tin Virtual memory trên máy tính của mình:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/virtual_memory.png?raw=true\" width=\"354\" height=\"465\"></p>\n\n<p>Dung lượng bộ nhớ ảo hiện tại của máy mình là <strong>1960MB</strong>, tương đương với <strong>2055208960 bytes</strong>. Trong khi đó, con trỏ trong nền tảng hệ điều hành <strong>32 bits</strong> có kích thước <strong>4 bytes</strong>, giá trị địa chỉ lớn nhất mà con trỏ <strong>4 bytes</strong> có thể lưu trữ được là <strong>4294967295</strong>, nên nó đủ để lưu trữ bất kì địa chỉ của biến nào được cấp phát trên bộ nhớ ảo.</p>\n\n<h5>Gán giá trị cho con trỏ</h5>\n\n<p>Giá trị mà biến con trỏ lưu trữ là địa chỉ của biến khác có cùng kiểu dữ liệu với biến con trỏ.</p>\n\n<pre><code>int *ptr;\nint value = 5;\n\nptr = &amp;value;</code></pre>\n\n<p>Do đó, chúng ta cần sử dụng <strong>address-of operator</strong> để lấy ra địa chỉ ảo của biến rồi mới gán cho con trỏ được. Lúc này, biến ptr sẽ lưu trữ địa chỉ ảo của biến value.</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/7.png?raw=true\" width=\"409\" height=\"145\"></p>\n\n<p>(Nguồn: <a href=\"http://www.learncpp.com\" rel=\"nofollow\">www.learncpp.com</a>)</p>\n\n<p>Chúng ta có thể nói rằng con trỏ <strong>ptr</strong> đang nắm giữ địa chỉ của biến <strong>value</strong>, cũng có thể nói con trỏ <strong>ptr</strong> trỏ đến biến <strong>value</strong>.</p>\n\n<p>Đoạn chương trình sau sẽ in ra địa chỉ của biến value và giá trị được lưu bởi con trỏ ptr sau khi trỏ đến biến value:</p>\n\n<pre><code>int main()\n{\n\tint value = 5;\n\tint *ptr = &amp;value;\n\t\n\tcout &lt;&lt; &amp;value &lt;&lt; endl;\n\tcout &lt;&lt; ptr &lt;&lt; endl;\n\n\tsystem(\"pause\");\n\treturn 0;\n}</code></pre>\n\n<p>Kết quả thu được trên màn hình console:</p>\n\n<pre><code>0012FF7C\n0012FF7C</code></pre>\n\n<p>Lý do mà chúng ta gán được địa chỉ của biến <strong>value</strong> cho con trỏ kiểu <strong>int</strong> (int *) là vì <strong>address-of operator</strong> của một biến kiểu <strong>int</strong> trả về giá trị kiểu con trỏ kiểu <strong>int</strong> (int *).</p>\n\n<p>Thử xem xét đoạn chương trình sau:</p>\n\n<pre><code>#include &lt;iostream&gt;\nusing namespace std;\n\nint main()\n{\n\t\n\tint value = 5;\n\tcout &lt;&lt; typeid(&amp;value).name() &lt;&lt; endl;\n\t\n\tsystem(\"pause\");\n\treturn 0;\n}</code></pre>\n\n<p>Kết quả in ra màn hình của toán tử lấy địa chỉ ở trên là:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/8.png?raw=true\" width=\"677\" height=\"343\"></p>\n\n<p>Do đó, chúng ta có thể gán <code>&amp;value</code> cho con trỏ kiểu <strong>int</strong> (int *).</p>\n\n<p>Bên cạnh đó, khi có hai con trỏ cùng kiểu thì chúng ta có thể gán trực tiếp mà không cần sử dụng <strong>address-of operator</strong>.</p>\n\n<pre><code>int main()\n{\n\tint value = 5;\n\tint *ptr1, *ptr2;\n\n\tptr1 = &amp;value; //ptr1 point to value\n\tptr2 = ptr1;   //assign value of ptr1 to ptr2\n\n\tcout &lt;&lt; ptr1 &lt;&lt; endl;\n\tcout &lt;&lt; ptr2 &lt;&lt; endl;\n\n\tsystem(\"pause\");\n\treturn 0;\n}</code></pre>\n\n<p>Lúc này, <strong>ptr1</strong> và <strong>ptr2</strong> cùng giữ địa chỉ của biến <strong>value</strong>.</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/9.png?raw=true\" width=\"677\" height=\"343\"></p>\n\n<p><strong><em>Khác với tham chiếu (reference), một con trỏ có thể trỏ đến địa chỉ khác trong bộ nhớ ảo sau khi đã được gán giá trị. Tham chiếu (reference) không thể thay đổi địa chỉ sau lần tham chiếu đầu tiên.</em></strong></p>\n\n<p>Ví dụ:</p>\n\n<pre><code>int main()\n{\n\tint *ptr;\n\n\tint arr[5] = { 1, 2, 3, 4, 5 };\n\n\tfor(int i = 0; i &lt; 5; i++)\n\t{\n\t\tptr = &amp;arr[i];\n\t\tcout &lt;&lt; ptr &lt;&lt; endl;\n\t}\n\n\tsystem(\"pause\");\n\treturn 0;\n}</code></pre>\n\n<p>Kết quả của đoạn chương trình này là:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/10.png?raw=true\" width=\"677\" height=\"343\"></p>\n\n<p>Con trỏ <strong>ptr</strong> đã trỏ đến lần lượt 5 phần tử của mảng <strong>arr</strong>. Nếu các bạn để ý sẽ thấy 5 địa chỉ này liên tiếp nhau trên bộ nhớ ảo. Mình sẽ trình bày vấn đề này trong các bài học sau.</p>\n\n<h5>Các phép gán không hợp lệ khi sử dụng con trỏ</h5>\n\n<p>Phép gán của con trỏ chỉ thực hiện được khi kiểu dữ liệu của con trỏ phù hợp kiểu dữ liệu của biến mà nó sẽ trỏ tới. Do đó, các phép gán dưới đây là không hợp lệ:</p>\n\n<pre><code>int iValue = 0;\nfloat fValue = 0.0;\n\nint *i_ptr = fValue;   //wrong! int pointer cannot point to the address of a double variable\nfloat *f_ptr = iValue; //wrong! float pointer cannot point to the address of an int variable</code></pre>\n\n<p>Mặc dù giá trị mà con trỏ lưu trữ có kiểu <strong>unsigned int</strong>, nhưng chúng ta không thể gán trực tiếp một giá trị địa chỉ cho con trỏ được.</p>\n\n<pre><code>int *ptr = 1245052; //wrong!</code></pre>\n\n<p>Giá trị 1245052 không có địa chỉ cụ thể, trong khi đó, con trỏ chỉ nhận giá trị là địa chỉ nên phép gán trên là sai. Mặc dù giá trị được chuyển về dạng cơ số thập lục phân để tương xứng với định dạng giá trị mà con trỏ in ra, điều này cũng không được cho phép.</p>\n\n<pre><code>int *ptr = 0012FF7C; //wrong!</code></pre>\n\n<p><strong><em>Chỉ có giá trị kiểu con trỏ (có được nhờ toán tử address-of, hoặc từ một biến con trỏ cùng kiểu khác) mới có thể gán được cho biến con trỏ.</em></strong></p>\n\n<h5>Truy xuất giá trị bên trong vùng nhớ mà con trỏ trỏ đến</h5>\n\n<p>Khi chúng ta có một con trỏ đã được trỏ đến địa chỉ nào đó trong bộ nhớ ảo, chúng ta có thể truy xuất giá trị tại địa chỉ đó bằng <strong>dereference operator</strong>. <strong>Dereference operator</strong> sẽ đánh giá nội dung địa chỉ được trỏ đến.</p>\n\n<pre><code>int *ptr; //declare an int pointer\nint value = 5;\n\nptr = &amp;value; //ptr point to value\n\ncout &lt;&lt; &amp;value &lt;&lt; endl; //print the address of value\ncout &lt;&lt; ptr &lt;&lt; endl;    //print the address of value which is held in ptr\n\ncout &lt;&lt; value &lt;&lt; endl;  //print the content of value\ncout &lt;&lt; *(&amp;value) &lt;&lt; endl; //print the content of value\ncout &lt;&lt; *ptr &lt;&lt; endl;\t//print the content of value</code></pre>\n\n<p>Kết quả của đoạn chương trình trên như sau:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/11.png?raw=true\" width=\"677\" height=\"343\"></p>\n\n<p>Toán tử trỏ đến (<strong>dereference operator</strong>) được dùng để truy cập trực tiếp vào vùng nhớ có địa chỉ cụ thể trên bộ nhớ ảo (<strong>virtual memory</strong>), vì biến con trỏ <strong>ptr</strong> đang giữ địa chỉ của biến <strong>value</strong> nên khi đặt toán tử trỏ đến (<strong>dereference operator</strong>) trước con trỏ <strong>ptr</strong>, nó sẽ truy xuất giá trị tại địa chỉ mà con trỏ <strong>ptr</strong> đang giữ.</p>\n\n<p>Vì <strong>ptr</strong> có kiểu dữ liệu <strong>con trỏ int</strong> (int *), <strong>ptr</strong> chỉ có thể trỏ đến biến kiểu <strong>int</strong>. Lúc này, <strong>compiler</strong> hiểu rằng cần phân tích <strong>4 bytes</strong> (đúng bằng kích thước kiểu <strong>int</strong>) trên bộ nhớ ảo tại địa chỉ mà <strong>ptr</strong> đang lưu trữ.</p>\n\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/12.png?raw=true\" class=\"lightbox\" title=\"12.png?raw=true\" rel=\"nofollow\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/12.png?raw=true\" width=\"690\" height=\"328\"><div class=\"meta\">\n<span class=\"filename\">12.png?raw=true</span><span class=\"informations\">764x364</span><span class=\"expand\"></span>\n</div></a></div></p>\n\n<p>Đây là lý do tại sao chúng ta cần khai báo kiểu dữ liệu của con trỏ. Nếu không khai báo kiểu dữ liệu cho con trỏ, toán tử trỏ đến (<strong>dereference operator</strong>) sẽ không biết phải phân tích bao nhiêu bytes tại địa chỉ con trỏ trỏ đến để tính toán được giá trị của vùng nhớ đó. Không những thế, đây còn là lý do kiểu dữ liệu của biến phải tương xứng với kiểu dữ liệu được khai báo cho con trỏ.</p>\n\n<p>Vì chúng ta có thể gán lại địa chỉ mới cho một con trỏ, nên chúng ta có thể truy xuất được giá trị của nhiều vùng nhớ khác nhau chỉ với một con trỏ:</p>\n\n<pre><code>int value1 = 1;\nint value2 = 2;\n\nint *ptr = &amp;value1;\ncout &lt;&lt; *ptr &lt;&lt; endl;\n\nptr = &amp;value2;\ncout &lt;&lt; *ptr &lt;&lt; endl;</code></pre>\n\n<p>Với khả năng truy cập đến vùng nhớ có địa chỉ cụ thể và thay đổi giá trị bên trong vùng nhớ của toán tử trỏ đến (<strong>dereference operator</strong>), chúng ta có thể sử dụng như sau:</p>\n\n<pre><code>int value = 5;\nint *ptr = &amp;value;\n\n*ptr = 10;\ncout &lt;&lt; *ptr &lt;&lt; endl;</code></pre>\n\n<p>Đoạn chương trình này sẽ in ra giá trị <strong>10</strong>.</p>\n\n<p>Có thể giải thích dòng lệnh <code>*ptr = 10;</code> như sau:</p>\n\n<p>Biến con trỏ <strong>ptr</strong> sau khi khai báo đã được khởi tạo bằng cách gán địa chỉ của biến <strong>value</strong>. Sử dụng <strong>dereference operator</strong> cho con trỏ <strong>ptr</strong> để truy cập đến địa chỉ ảo mà <strong>ptr</strong> đang nắm giữ, gán giá trị 10 vào vùng nhớ tại vị trí đó.</p>\n\n<h5>Con trỏ chưa được gán địa chỉ</h5>\n\n<p>Con trỏ trong ngôn ngữ C/C++ vốn không an toàn. Nếu sử dụng con trỏ không hợp lý có thể gây crash chương trình.</p>\n\n<p>Khác với tham chiếu (<strong>reference</strong>), biến con trỏ có thể không cần khởi tạo giá trị ngay khi khai báo. Nhưng thực hiện truy xuất giá trị của con trỏ bằng dereference operator khi chưa gán địa chỉ cụ thể cho con trỏ, chương trình có thể bị đóng bởi hệ điều hành. Nguyên nhân là do con trỏ đang nắm giữ một giá trị rác, giá trị rác đó có thể là địa chỉ thuộc một vùng nhớ đang được ứng dụng khác sử dụng, hoặc giá trị vượt quá giới hạn của bộ nhớ ảo.</p>\n\n<p>Trong chế độ <strong>Debug</strong> của Visual studio 2015, trường hợp này sẽ bị cảnh báo và ngăn chặn chương trình thực thi.</p>\n\n<p>Ví dụ:</p>\n\n<pre><code>int main()\n{\n\tint *ptr; //declare an int pointer\n\tcout &lt;&lt; *ptr &lt;&lt; endl;\n\n\tsystem(\"pause\");\n\treturn 0;\n}</code></pre>\n\n<p>Nhấn F5 để Debug chương trình sẽ nhận được thông báo:</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/8-con-tro/8-0-con-tro/13.png?raw=true\" width=\"559\" height=\"318\"></p>\n\n<p>Do đó, khi khai báo con trỏ nhưng chưa có địa chỉ khởi tạo cụ thể, chúng ta nên gán cho con trỏ giá trị <strong>NULL</strong>.</p>\n\n<hr>\n\n<h3>NULL</h3>\n\n<p><strong>NULL</strong> là một macro đã được định nghĩa sẵn trong ngôn ngữ C/C++.</p>\n\n<pre><code>#define NULL 0</code></pre>\n\n<p>Đối với con trỏ, <strong>NULL</strong> là một giá trị đặc biệt, khi gán <strong>NULL</strong> cho con trỏ, điều đó có nghĩa là con trỏ đó chưa trỏ đến địa chỉ nào cả. Con trỏ đang giữ giá trị <strong>NULL</strong> được gọi là con trỏ <strong>NULL</strong> (<strong>NULL pointer</strong>).</p>\n\n<pre><code>int *ptr = NULL; //ptr is now a NULL pointer</code></pre>\n\n<p>Lúc này, chúng ta có thể kiểm tra xem con trỏ đã được gán địa chỉ cụ thể hay chưa:</p>\n\n<pre><code>int *ptr = NULL;\n\nif(ptr == NULL)\n{\n\tcout &lt;&lt; \"Do nothing\" &lt;&lt; endl;\n}\nelse\n{\n\tcout &lt;&lt; *ptr &lt;&lt; endl;\n}</code></pre>\n\n<p>Đoạn chương trình này sẽ giúp chương trình đảm bảo rằng con trỏ <strong>ptr</strong> sẽ không được sử dụng khi chưa được gán địa chỉ cụ thể.</p>\n\n<p>Chuẩn <strong>C++11</strong> cung cấp cho chúng ta từ khóa <strong>nullptr</strong> tương tự như macro <strong>NULL</strong>. Chúng ta có thể sử dụng như sau:</p>\n\n<pre><code>int *ptr = nullptr;</code></pre>\n\n<p>Bên cạnh đó, <strong>C++11</strong> còn định nghĩa cho chúng ta kiểu dữ liệu <code>std::nullptr_t</code>, <code>nullptr_t</code> chỉ có thể lưu trữ giá trị <strong>nullptr</strong>. Nhưng chúng ta ít khi sử dụng kiểu dữ liệu này nên các bạn cũng không cần quan tâm lắm.</p>\n\n<hr>\n\n<h3>Tổng kết</h3>\n\n<p>Trong bài học này, các bạn đã được tìm hiểu khái niệm con trỏ và một số khái niệm có liên quan. Việc sử dụng con trỏ thường có một số hoạt động chủ yếu: <strong>(a) khai báo một con trỏ, (b) gán địa chỉ cho con trỏ, (c) truy cập đến địa chỉ mà con trỏ đang nắm giữ bằng dereference operator</strong>.</p>\n\n<p>Thử liên hệ một chút với cuộc sống thực tế, tưởng tượng rằng con đường nhà bạn (street) là bộ nhớ ảo, trên con đường đó có rất nhiều ngôi nhà (house), mỗi ngôi nhà đều được đánh số thứ tự gọi là địa chỉ nhà (house's address). Chúng ta tạm hình dung số người ở trong mỗi ngôi nhà (content) tương đương với nội dung của mỗi ô trên bộ nhớ ảo. Như vậy, address-of operator (&amp;house) sẽ trả về địa chỉ của ngôi nhà, dereference operator (*&amp;house) sẽ lấy ra số lượng người bên trong ngôi nhà có địa chỉ được xác định. Để sử dụng con trỏ trỏ đến mỗi ngôi nhà, chúng ta phải sử dụng một con trỏ kiểu <strong>House</strong> (giống với kiểu của từng ngôi nhà), giả sử con trỏ kiểu <strong>House</strong> được khai báo là <code>House *h_ptr;</code> thì con trỏ <code>h_ptr</code> có thể trỏ đến bất kì ngôi nhà nào trên con đường, và nó còn có thể thay đổi nội dung bên trong từng ngôi nhà mà nó trỏ đến.</p>\n\n<p>Con trỏ (<strong>Pointer</strong>) là một công cụ mạnh mẽ đặc trưng của ngôn ngữ C/C++. Con trỏ cho phép chúng ta trực tiếp quản lý dung lượng của chương trình trên bộ nhớ ảo. Nhưng bên cạnh đó, việc sử dụng con trỏ không hợp lý có thể gây lãng phí tài nguyên của hệ thống máy tính. Chúng ta sẽ cùng tìm hiểu các kĩ thuật quản lý bộ nhớ ảo của chương trình trong các bài học tiếp theo.</p>\n\n<hr>\n\n<p><strong>Hẹn gặp lại các bạn trong bài học tiếp theo trong khóa học lập trình C++ hướng thực hành.</strong></p>\n\n<p>Mọi ý kiến đóng góp hoặc thắc mắc có thể đặt câu hỏi trực tiếp tại diễn đàn.</p>\n\n<p><a title=\"DayNhauHoc\" class=\"onebox\" target=\"_blank\">www.daynhauhoc.com</a></p>\n\n<hr>\n\n<h3>Link Videos khóa học</h3>\n\n<p><a href=\"https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview\" class=\"onebox\" target=\"_blank\" rel=\"nofollow\">https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview</a></p>\n","__filename":"generated/30541.md","__url":"/8/0-con-tr/","__resourceUrl":"/8/0-con-tr/index.html","__dataUrl":"/8/0-con-tr/index.html.c96a1fa2938a6be431d4ca1446f891e1.json"}