{"head":{"title":"7.4 Tham số mặc định, tham số hằng","route":"7/4-tham-so-mac-dinh-tham-so-hang","id":30382,"description":"int main() { \tstring non_const_msg = \"This is non-const message\"; \tconst string const_msg = \"This is const message\"; } int main() { }"},"body":"<h4>Chào các bạn! Chúng ta cùng tiếp tục đồng hành trong khóa học lập trình trực tuyến ngôn ngữ C++.</h4>\n<p>Đến với bài học này, chúng ta sẽ tìm hiểu thêm một số vấn đề về tham số của hàm. Mình đã trình bày cho các bạn về <a href=\"//daynhauhoc.com/t/truyen-doi-so-cho-ham-la-gia-tri-hoac-tham-chieu/30319\">tham số nhận giá trị, tham số nhận tham chiếu</a> trong các bài học trước. Bây giờ chúng ta sẽ đi tìm hiểu về 2 khái niệm mới khi khai báo tham số cho hàm:</p>\n<ul>\n<li>Tham số hằng.</li>\n<li>Tham số mặc định.</li>\n</ul>\n<h3>Tham số hằng</h3>\n<h5>Khai báo hàm có chứa tham số hằng</h5>\n<p>Như các bạn biết, một biến được định nghĩa với từ khóa <strong>const</strong> đứng trước là biến lưu trữ giá trị được khởi tạo 1 lần, và giá trị đó không thay đổi trong suốt quá trình thực thi chương trình. Mọi câu lệnh tác động đến giá trị của biến hằng số sẽ gây ra lỗi khi biên dịch.</p>\n<p>Cú pháp định nghĩa biến hằng số mà các bạn đã được học:</p>\n<p><code>const &lt;data_type&gt; &lt;variable_name&gt; = &lt;init_value&gt;;</code></p>\n<p>hoặc </p>\n<p><code>&lt;data_type&gt; const &lt;variable_name&gt; = &lt;init_value&gt;;</code></p>\n<p>Việc khai báo tham số hằng cho hàm cũng tương tự, các bạn đặt từ khóa const trước kiểu dữ liệu của tham số hoặc tên biến của tham số là được. Ví dụ:</p>\n<pre><code>void receiveInput(const int param1, const float param2)\n{\n\t//................\n}</code></pre>\n<p>Khác với việc khởi tạo giá trị cho biến hằng số thông thường, tham số hằng sẽ được khởi tạo giá trị lúc gọi hàm. Vì phần định nghĩa hàm chỉ mới chỉ ra cách mà hàm hoạt động, khi gọi hàm và truyền đối số vào hàm, hệ điều hành lúc đó mới cấp phát vùng nhớ cho các tham số và biến cục bộ bên trong hàm.</p>\n<h5>Truyền đối số cho tham số hằng (pass by const)</h5>\n<p>Tham số hằng có thể nhận đối số là hằng số hoặc không phải hằng số. Ví dụ:</p>\n<pre><code>void printMessage(const string message)\n{\n\tcout &lt;&lt; message &lt;&lt; endl;\n}\n<p>int main()\n{\nstring non_const_msg = \"This is non-const message\";\nconst string const_msg = \"This is const message\";</p>\n<pre><code>printMessage(non_const_msg);\nprintMessage(const_msg);\n\nsystem(\"pause\");\nreturn 0;\n</code></pre>\n<p>}</code></pre></p>\n<p>Vì chúng ta sử dụng phương thức truyền đối số là giá trị, nên một bản copy của đối số sẽ được tạo ra để làm giá trị khởi tạo cho tham số hằng, và tham số của hàm lúc này chỉ tương tác bên trong hàm chứ không làm ảnh hưởng đến đối số được truyền vào.</p>\n<p>Chúng ta thử nghiệm với việc truyền đối số vào tham số hằng tiếp nhận giá trị là một tham chiếu qua ví dụ sau:</p>\n<pre><code>void foo(const string &amp;str)\t{\n\tstr[5] = 'a'; //error\n}\n<p>int main() {\n\nstring str = \"what the hell is going on?\";\nfoo(str);\n\n//change value of str outside foo function\nstr[5] = 'a'; // ok\n\nreturn 0;\n}</code></pre></p>\n<p>Mình chạy thử đoạn chương trình trên thì nhận được thông báo lỗi <strong>error: assignment of read-only location</strong>. Điều này có nghĩa mặc dù tham số của hàm đã tham chiếu đến 1 vùng nhớ của biến không phải hằng, nhưng tham số của hàm là hằng, nên mọi câu lệnh có hành vi thay đổi giá trị bên trong vùng nhớ mà biến str đang nắm giữ là không cho phép.</p>\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/7-co-ban-ve-ham/7-4-tham-so-mac-dinh-va-tham-so-hang/0.png?raw=true\" width=\"683\" height=\"423\"></p>\n<p>Trong khi đó, biến str không phải là hằng, nên nó có thể thay đổi giá trị trong vùng nhớ mà nó đang nắm giữ.</p>\n<p>Mặc dù 2 đối tượng str và tham chiếu của str đều sử dụng chung 1 vùng nhớ, nhưng đối tượng là tham chiếu của str là hằng, nên nó không thể tự ý thay đổi giá trị của str trong khi đối tượng str thì có thể.</p>\n<p><strong><em>Mục đích của việc khai báo tham số hằng là để đảm bảo rằng hàm đó không thể thay đổi giá trị của đối số truyền vào (cho dù truyền bằng tham chiếu). Khi chương trình phát sinh lỗi, chúng ta có thể loại bớt trường hợp lỗi do hàm có tham số hằng gây ra, giúp chúng ta dễ dàng sửa lỗi hơn.</em></strong></p>\n<h3>Tham số mặc định (default parameter)</h3>\n<p>Tham số mặc định là tham số có một giá trị khởi tạo tại thời điểm khai báo.</p>\n<ul>\n<li>Khi người dùng không cung cấp đối số cho tham số mặc định, giá trị mặc định sẽ được sử dụng.</li>\n<li>Khi người dùng cung cấp đối số cho tham số mặc định, tham số sẽ được gán lại bằng giá trị của đối số được truyền vào.</li>\n</ul>\n<h5>Cách khai báo tham số mặc định</h5>\n<p>Để khai báo tham số mặc định cho hàm, bạn chỉ cần sử dụng toán tử assignment (<strong>=</strong>) như lúc các bạn khởi tạo cho biến thông thường.</p>\n<pre><code>void printValue(int x, int y = 10)\n{\n\tcout &lt;&lt; \"x: \" &lt;&lt; x &lt;&lt; endl;\n\tcout &lt;&lt; \"y: \" &lt;&lt; y &lt;&lt; endl;\n}</code></pre>\n<p>Vì tham số thứ 2 của hàm printValue đã có giá trị mặc định nên khi gọi hàm, chúng ta có thể chỉ truyền vào 1 đối số cho tham số x.</p>\n<pre><code>//...........\nprintValue(5);\n//...........</code></pre>\n<p>Hoặc các bạn muốn thay đổi giá trị khác cho tham số y, chúng ta truyền vào giá trị mới cho nó.</p>\n<pre><code>//........\nprintValue(5, 5);\n//........</code></pre>\n<h5>Trường hợp khai báo tham số mặc định không hợp lệ</h5>\n<p>Sử dụng tham số mặc định giúp người dùng có nhiều lựa chọn hơn trong việc truyền đối số. Nhưng có 1 yêu cầu đặt ra khi khai báo hàm có tham số mặc định, đó là mọi tham số mặc định khi khai báo phải đặt phía sau tham số không có giá trị mặc định.</p>\n<pre><code>void printValue(int x = 10, int y)\n{\n\t//Error\n}</code></pre>\n<p>Ví dụ như cách khai báo trên sẽ gây ra lỗi khi biên dịch.</p>\n<p><strong><em>Vì tham số mặc định là tham số tùy chọn, chương trình không ràng buộc người dùng phải truyền đối số cho tham số mặc định khi gọi hàm. Trong khi đó, với tham số không có giá trị mặc định thì bắt buộc phải truyền đối số khi gọi hàm. Vì thế, đặt tham số mặc định trước tham số không có giá trị mặc định sẽ gây mâu thuẫn về ngữ nghĩa.</em></strong></p>\n<h3>Tổng kết</h3>\n<p>Như vậy, chúng ta đã biết cách sử dụng tham số hằng và tham số mặc định khi sử dụng hàm trong C/C++. Đây là những cách sử dụng tham số thường xuyên được sử dụng. Các bạn sẽ còn gặp lại chúng trong các bài học sau.</p>\n<p><strong>Hẹn gặp lại các bạn trong bài học tiếp theo trong khóa học lập trình C++ hướng thực hành.</strong></p>\n<p>Mọi ý kiến đóng góp hoặc thắc mắc có thể đặt câu hỏi trực tiếp tại diễn đàn.</p>\n<p><a title=\"DayNhauHoc\" class=\"onebox\" target=\"_blank\">www.daynhauhoc.com</a></p>\n<hr>\n<h3>Link Videos khóa học</h3>\n<p><a href=\"https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview\" class=\"onebox\" target=\"_blank\" rel=\"nofollow\">https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview</a></p>\n","__filename":"generated/30382.md","__url":"/7/4-tham-so-mac-dinh-tham-so-hang/","__resourceUrl":"/7/4-tham-so-mac-dinh-tham-so-hang/index.html","__dataUrl":"/7/4-tham-so-mac-dinh-tham-so-hang/index.html.b234bc219b3b3db4f46f8d654d7af624.json"}