{"head":{"title":"5.3 Mảng hai chiều","route":"5/3-mang-hai-chieu","id":30085,"description":"for(int row = 0; row &lt; 3; row++) { \tfor(int col = 0; col &lt; 4; col++) \t{ \t\tcout &lt;&lt; board[row][col] &lt;&lt; \" \"; \t} \tcout…"},"body":"<h4>Chào tất cả các bạn đang theo dõi khóa học lập trình trực tuyến ngôn ngữ C++.</h4>\n<p>Trong các bài học trước, mình đã giới thiệu đến các bạn về mảng một chiều trong ngôn ngữ C/C++.</p>\n<blockquote><p>Mảng một chiều có thể được hiểu là một dãy các phần tử <strong><em>có cùng kiểu dữ liệu</em></strong> được đặt liên tiếp nhau trong một vùng nhớ, chúng ta có thể ngay lập tức truy xuất đến một phần tử của dãy đó thông qua chỉ số của mỗi phần tử.</p></blockquote>\n<p>Bây giờ các bạn thử tưởng tượng nếu kiểu dữ liệu của mảng một chiều là mảng một chiều? Hay nói cách khác, chúng ta có một mảng chứa các mảng một chiều? Lúc này, chúng trở thành <strong>mảng 2 chiều</strong>.</p>\n<hr>\n<h3>2D Array</h3>\n<p>Trước hết, mình cho các bạn xem lại hình ảnh minh họa cho <strong>mảng một chiều</strong> trên máy tính:</p>\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/5-kieu-du-lieu-mang/5-3-mang-hai-chieu/0.png?raw=true\" width=\"615\" height=\"211\"></p>\n<p>Đây là <strong>mảng 1 chiều</strong> gồm có 5 phần tử được đánh chỉ số từ 0 đến 4.</p>\n<p>Và dưới đây là hình ảnh minh họa cho cách tổ chức dữ liệu <strong>mảng hai chiều</strong>:</p>\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/5-kieu-du-lieu-mang/5-3-mang-hai-chieu/1.png?raw=true\" width=\"400\" height=\"400\"></p>\n<p>Đây là bảng câu đố của game <strong>Sudoku</strong> được tạo thành từ 9x9 ô vuông (9 dòng và 9 cột). Giả sử mình tách dòng đầu tiên của bảng game này ra đứng riêng biệt: </p>\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/5-kieu-du-lieu-mang/5-3-mang-hai-chieu/2.png?raw=true\" width=\"513\" height=\"115\"></p>\n<p>Nó lại trở thành mảng <strong>1 chiều</strong> có 9 phần tử.</p>\n<p>Vậy, <strong>mảng một chiều</strong> khi mô phỏng nó bằng hình ảnh, chúng ta chỉ thấy được 1 hàng ngang có nhiều cột phân chia thành các ô (tượng trưng cho các ô nhớ trong máy tính). Còn khi chúng ta nhìn vào <strong>mảng hai chiều</strong>, chúng ta thấy có nhiều hàng, mỗi hàng lại có nhiều cột, đặc biệt hơn là số lượng cột ở mỗi hàng đều bằng nhau.</p>\n<p>Ngôn ngữ C/C++ có hổ trợ cho chúng ta tổ chức dữ liệu theo dạng bảng như trên, hay thường gọi là <strong>mảng hai chiều</strong>. Thế thì khi nào chúng ta cần sử dụng mảng hai chiều trong chương trình máy tính? Trong thực tế, chúng ta gặp rất nhiều thứ được bố trí dưới dạng mảng 2 chiều. Dưới đây là một số ví dụ thực tế:</p>\n<ul>\n<li>\n<p>Phòng học:</p>\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/5-kieu-du-lieu-mang/5-3-mang-hai-chieu/3.png?raw=true\" width=\"562\" height=\"358\"></p>\n<p>Như hình minh họa, chúng ta có một phòng học có 2 dãy bàn hàng ngang, mỗi dãy bàn ngang có thể đủ chổ cho 3 sinh viên. Như vậy mình gọi đây là mảng hai chiều 2x3 (2 hàng, 3 cột).</p>\n</li>\n<li>\n<p>Bàn cờ vua:</p>\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/5-kieu-du-lieu-mang/5-3-mang-hai-chieu/4.png?raw=true\" width=\"408\" height=\"409\"></p>\n<p>Bàn cờ vua là một bảng hình vuông có 8 hàng, mỗi hàng có 8 cột, tổng cộng có 64 ô vuông, mỗi ô có thể đặt 1 quân cờ. Chúng ta có thể gọi đây là một mảng hai chiều 8x8 (8 dòng, 8 cột).</p>\n</li>\n<li>\n<p>Trò chơi Tic Tac Toe:</p>\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/5-kieu-du-lieu-mang/5-3-mang-hai-chieu/5.png?raw=true\" width=\"300\" height=\"300\"></p>\n<p>Trò chơi này được chơi trên một bảng 3x3 (3 hàng, 3 cột). Nếu trò chơi này được mô phỏng trên máy tính, chúng ta có thể sử dụng một mảng hai chiều 3x3 để lưu trữ các kí tự <strong>'x'</strong> hoặc <strong>'o'</strong>.</p>\n</li>\n</ul>\n<p>Qua một số hình ảnh minh họa như trên, hi vọng các bạn đã có thể hình dung được mảng hai chiều là như thế nào. Bây giờ mình sẽ đi vào chi tiết về cách khai báo, khởi tạo giá trị và cách sử dụng mảng hai chiều trong ngôn ngữ C++.</p>\n<h5>Khai báo mảng hai chiều</h5>\n<p>Đối với mảng một chiều, chúng ta chỉ cần khai báo số lượng phần tử (số lượng cột) cho một hàng duy nhất, do đó, khai báo mảng một chiều có dạng:</p>\n<p><code>&lt;data_type&gt; &lt;name_of_array&gt;[num_of_columns];</code></p>\n<p>Ví dụ:</p>\n<pre><code>int iArray[100]; //declare an array of integer can hold 100 elements</code></pre>\n<p>Bây giờ, khi quản lý mảng hai chiều, chúng ta còn phải quan tâm thêm về số hàng mà mảng hai chiều cần cấp phát:</p>\n<p><code>&lt;data_type&gt; &lt;name_of_array&gt;[num_of_rows][num_of_columns];</code></p>\n<p><strong><em>Lưu ý, khi khai báo số lượng phần tử của mảng hai chiều, số hàng phải đặt trước số cột.</em></strong></p>\n<p>Ví dụ:</p>\n<pre><code>int array2D[3][5]; // 3x5 elements (3 rows, 5 columns)</code></pre>\n<p>Có thể nói cách khác, mảng có tên <strong>array2D</strong> có kiểu dữ liệu <strong>int</strong>, mảng <strong>array2D</strong> gồm có 3 mảng một chiều, mỗi mảng một chiều trong đó có thể chứa được tối đa 5 phần tử.</p>\n<h5>Khởi tạo mảng hai chiều</h5>\n<p>Mình lấy lại ví dụ về mảng có tên <strong>array2D</strong> như trên, mình sẽ khởi tạo giá trị cho mảng như sau:</p>\n<pre><code>int array2D[3][5] = \n{\n\t{ 1,  2,  3,  4,  5 },  //row 1\n\t{ 6,  7,  8,  9,  10 }, //row 2\n\t{ 11, 12, 13, 14, 15 }  //row 3\n};</code></pre>\n<p>Do mảng <strong>array2D</strong> có 3 hàng, mỗi hàng lại là một mảng một chiều khác nhau, nên mình đã sử dụng cách khởi tạo của mảng một chiều, áp dụng cho mỗi hàng trong mảng hai chiều <strong>array2D</strong>.</p>\n<p>Các bạn có thể khởi tạo mảng hai chiều theo cách sau:</p>\n<pre><code>int array2D[3][5] = \n{\n\t1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15\n};</code></pre>\n<p>Nhưng mình vẫn khuyến khích các bạn sử dụng cách mình trình bày ở trước để tránh nhầm lẫn trong việc tổ chức dữ liệu.</p>\n<p>Những phần tử chưa được khởi tạo giá trị sẽ được gán bằng giá trị mặc định tùy vào mỗi kiểu dữ liệu khác nhau. Như ví dụ sau mình sử dụng kiểu <strong>int</strong> để khai báo mảng hai chiều:</p>\n<pre><code>int seats[3][5] =\n{\n\t{ 1, 2 },\t\t//row 1 = 1, 2, 0, 0, 0\n\t{ 6, 7, 8 },\t//row 2 = 6, 7, 8, 0, 0\n\t{ 11 },\t\t\t//row 3 = 11, 0, 0, 0, 0\n};</code></pre>\n<p>Tương tự mảng một chiều, nếu các bạn khởi tạo mảng hai chiều ngay khi khai báo, compiler có thể tự xác định số hàng cần cấp phát:</p>\n<pre><code>int array2D[][4] = \n{\n\t{ 1, 2, 3, 4 },\n\t{ 5, 6, 7, 8 }\n};</code></pre>\n<p><strong><em>Các bạn có thể bỏ trống phần khai báo số lượng hàng, nhưng không thể không khai báo số lượng cột.</em></strong></p>\n<h5>Truy cập các phần tử trong mảng hai chiều</h5>\n<p>Lấy ví dụ mình có một mảng hai chiều có 3 hàng và 4 cột tạo thành bảng như sau:</p>\n<pre><code>int board[3][4];</code></pre>\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/5-kieu-du-lieu-mang/5-3-mang-hai-chieu/6.png?raw=true\" width=\"600\" height=\"412\"></p>\n<p>Để xác định tọa độ (ví trị) của một phần tử trong một mảng hai chiều, chúng ta cần xác định hai tham số là chỉ số dòng và chỉ số cột. Chúng ta truy cập vào chỉ số dòng trước và chỉ số cột sau. Ví dụ:</p>\n<pre><code>board[1][2]; //Access element on row 2 and column 3</code></pre>\n<p>Thực hiện truy cập mảng board với chỉ số dòng là 1 và chỉ số cột là 2 sẽ trỏ đến ô nhớ tại dòng thứ 2 và cột thứ 3, do chỉ số của mảng sẽ bắt đầu từ 0. Tương tự, để truy cập phần tử của cùng của mảng hai chiều 3x4, chúng ta truy cập với chỉ số (2, 3).</p>\n<p>Để truy cập toàn bộ mảng hai chiều, chúng ta có thể sử dụng 2 vòng lặp: vòng lặp ngoài sẽ truy cập lần lượt các dòng, vòng lặp bên trong sẽ truy cập tất cả các cột của dòng hiện tại mà vòng lặp ngoài đang truy cập đến.</p>\n<pre><code>int board[3][4] = \n{\n\t{ 1, 1, 1, 1 },\n\t{ 2, 2, 2, 2 },\n\t{ 3, 3, 3, 3}\n};\n<p>for(int row = 0; row &#x3C; 3; row++)\n{\nfor(int col = 0; col &#x3C; 4; col++)\n{\ncout &#x3C;&#x3C; board<a href=\"\">row</a> &#x3C;&#x3C; \" \";\n}\ncout &#x3C;&#x3C; endl;\n}</code></pre></p>\n<h5>Nhập dữ liệu cho mảng hai chiều</h5>\n<p>Cũng tương tự việc các bạn nhập dữ liệu cho mảng một chiều, chúng ta sử dụng đối tượng <strong>cin</strong> trong thư viện <strong>iostream</strong>. Các bạn chỉ cần lưu ý rằng khi thao tác với các phần tử trong mảng hai chiều, chúng ta phải cung cấp đủ 2 chỉ số (hàng và cột) thì mới xác định được địa chỉ phần tử mà chúng ta cần thao tác.</p>\n<p><code>cin &gt;&gt; &lt;name_of_array&gt;[row_index][col_index];</code></p>\n<p>Trong đó, <code>row_index</code> là chỉ số dòng của phần tử, <code>col_index</code> là chỉ số cột của phần tử.</p>\n<p>Ví dụ:</p>\n<pre><code>int board[3][3];\n<p>for(int row = 0; row &#x3C; 3; row++)\n{\nfor(int col = 0; col &#x3C; 3; col++)\n{\ncin >> board<a href=\"\">row</a>;\n}\n}</code></pre></p>\n<hr>\n<h3>Tổng kết</h3>\n<p>Trong bài học này, chúng ta đã cùng tìm hiểu về một cách tổ chức dữ liệu mới trên máy tính. Mảng hai chiều được sử dụng khá phổ biến để giải quyết một số thuật toán yêu cầu tối ưu như Quy Hoạch Động, bài toán đồ thị, ... Cũng có thể được sử dụng trong việc thiết kế một số trò chơi đơn giản, ví dụ game Minesweeper. Chúng ta sẽ còn ứng dụng nhiều về mảng hai chiều trong các bài học sau.</p>\n<h3>Bài tập cơ bản</h3>\n<p>1/ Viết chương trình nhập dữ liệu cho mảng hai chiều có số dòng, số cột dương (tùy ý bạn). In ra màn hình kết quả là tổng của mỗi dòng trong mảng hai chiều bạn vừa nhập.</p>\n<p>Ví dụ mình nhập mảng hai chiều 3x3 như sau:</p>\n<pre><code>1 3 4\n2 1 6\n3 3 5</code></pre>\n<p>Kết quả in ra màn hình sẽ là:</p>\n<pre><code>8\n9\n11</code></pre>\n<p>Trong đó, 8 là tổng các giá trị trong dòng đầu tiên, 9 là tổng các giá trị của dòng thứ 2, 11 là tổng các giá trị của dòng thứ 3.</p>\n<p>2/ Viết chương trình tìm kiếm sự xuất hiện của giá trị X nhập từ bàn phím trong mảng hai chiều.</p>\n<hr>\n<p><strong>Hẹn gặp lại các bạn trong bài học tiếp theo trong khóa học lập trình C++ hướng thực hành.</strong></p>\n<p>Mọi ý kiến đóng góp hoặc thắc mắc có thể đặt câu hỏi trực tiếp tại diễn đàn.</p>\n<p><a title=\"DayNhauHoc\" class=\"onebox\" target=\"_blank\">www.daynhauhoc.com</a></p>\n<hr>\n<h3>Link Videos khóa học</h3>\n<p><a href=\"https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview\" class=\"onebox\" target=\"_blank\" rel=\"nofollow\">https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview</a></p>\n","__filename":"generated/30085.md","__url":"/5/3-mang-hai-chieu/","__resourceUrl":"/5/3-mang-hai-chieu/index.html","__dataUrl":"/data/20eab.json"}