{"head":{"title":"5.0 Mảng một chiều","route":"5/0-mang-mot-chieu","id":30080,"description":"//another way num_of_elements = sizeof(d_values) / sizeof(d_values[0]); cout &lt;&lt; \"Number of elements = \" &lt;&lt; num_of_elements…"},"body":"<h4>Chào tất cả các bạn đang theo dõi khóa học lập trình trực tuyến ngôn ngữ C++.</h4>\n<p>Tiếp tục với bài học ngày hôm nay, chúng ta sẽ cùng tìm hiểu về một cách tổ chức dữ liệu cơ bản trong thiết bị lưu trữ tạm thời của máy tính giúp khắc phục một số nhược điểm của việc sử dụng các biến thông thường.</p>\n<h5>Đặt vấn đề</h5>\n<p>Giảng viên cần tìm ra điểm số cao nhất của bài kiểm tra môn lập trình cơ sở. Giả sử lớp học có 30 sinh viên có số thứ tự 1 đến 30. </p>\n<p>Công việc của những lập trình viên chúng ta là giúp giảng viên này chỉ ra số thứ tự của sinh viên có điểm kiểm tra cao nhất, và điểm cao nhất đó là bao nhiêu bằng cách viết chương trình ngôn ngữ C++ trên máy tính để tiết kiệm thời gian suy nghĩ.</p>\n<h5>Tìm hướng giải quyết</h5>\n<p>Với yêu cầu như trên, chúng ta cần 30 biến để lưu lại điểm của 30 sinh viên.</p>\n<pre><code>int32_t score_of_student1;\nint32_t score_of_student2;\n//....\nint32_t score_of_student30;</code></pre>\n<p>Vậy là chúng ta cần tới 30 dòng lệnh khai báo 30 biến, chưa kể mất thời gian viết thêm 30 dòng lệnh nhập dữ liệu vào là điểm của từng sinh viên, sau đó chúng ta còn phải tìm điểm cao nhất. </p>\n<p>Một vấn đề khác nãy sinh: Sau khi tìm ra điểm số cao nhất từ 30 biến trên, làm thế nào chúng ta biết điểm số đó là của sinh viên có số thứ tự nào trong khi 30 biến này được cấp phát hoàn toàn tách biệt nhau (không theo 1 thứ tự nhất định)?</p>\n<p>Rất may mắn cho chúng ta khi ngôn ngữ C/C++ đưa ra cho chúng ta một khái niệm về tổ chức dữ liệu liên tiếp nhau trên thiết bị cung cấp bộ nhớ. Chúng ta có thể gọi là <strong>Mảng một chiều (Array)</strong>.</p>\n<h2></h2>\n<h3>Mảng một chiều (Array)</h3>\n<p>Mảng một chiều (<strong>array</strong>) là một dãy các phần tử có cùng kiểu dữ liệu được đặt liên tiếp nhau trong một vùng nhớ, chúng ta có thể ngay lập tức truy xuất đến một phần tử của dãy đó thông qua chỉ số của mỗi phần tử.</p>\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/5-kieu-du-lieu-mang/5-0-mang-mot-chieu/0.png?raw=true\" class=\"lightbox\" title=\"0.png?raw=true\" rel=\"nofollow\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/5-kieu-du-lieu-mang/5-0-mang-mot-chieu/0.png?raw=true\" width=\"690\" height=\"287\"><div class=\"meta\">\n<span class=\"filename\">0.png?raw=true</span><span class=\"informations\">915x381</span><span class=\"expand\"></span>\n</div></a></div></p>\n<p>Như hình trên, giả sử mình khai báo mảng một chiều có 3 phần tử kiểu <strong>int32_t</strong>, mỗi phần tử sẽ có kích thước <strong>4 bytes</strong>. </p>\n<p>Mình lấy ví dụ hệ điều hành tìm thấy vùng nhớ trống đủ chổ chứa 3 phần tử của mảng tại địa chỉ <strong>108</strong>, thì phần tử đầu tiên a1 sẽ có địa chỉ là địa chỉ ô nhớ đầu tiên mà hệ điều hành cấp phát (là <strong>108</strong>). Khi đó, phần tử thứ 2 sẽ có địa chỉ là địa chỉ của phần tử thứ nhất cộng thêm 4 (4 là kích thước kiểu dữ liệu <strong>int32_t</strong>), tương tự cho phần tử thứ 3.</p>\n<p>Với kiểu tổ chức dữ liệu này, chúng ta chỉ cần quan tâm đến 2 điều:</p>\n<ul>\n<li>Địa chỉ ô nhớ đầu tiên trong mảng.</li>\n<li>Số phần tử của mảng.</li>\n</ul>\n<p>Từ đó, chúng ta có thể truy xuất đến toàn bộ phần tử trong mảng.</p>\n<h3>Khai báo mảng một chiều</h3>\n<p>Chúng ta có nhiều cách để khai báo mảng một chiều khác nhau:</p>\n<ul><li>Khai báo nhưng không khởi tạo các phần tử:</li></ul>\n<p><code>&lt;data_type&gt; &lt;name_of_array&gt;[&lt;number_of_elements&gt;];</code></p>\n<p>Với cách khai báo này, chúng ta cần ghi rõ cho <strong>compiler</strong> biết số lượng phần tử mà bạn cần sử dụng đặt trong cặp dấu ngoặc vuông. Ví dụ:</p>\n<pre><code>int32_t age_of_students[30];</code></pre>\n<p>Mình vừa tạo ra một mảng dữ liệu kiểu <strong>int32_t</strong> để lưu trữ số tuổi của 30 sinh viên trong 1 lớp học.</p>\n<p>Vì mình chưa khởi tạo giá trị cụ thể cho 30 phần tử trong mảng, nên khi truy xuất đến giá trị của từng phần tử, chúng ta có thể nhận được giá trị khởi tạo mặc định của kiểu int32_t là 0 hoặc giá trị rác (tùy vào <strong>compiler</strong>).</p>\n<ul><li>Khai báo và khởi tạo giá trị cho mỗi phần tử:</li></ul>\n<p><code>&lt;data_type&gt; &lt;name_of_array&gt;[] = { &lt;value1&gt;, &lt;value2&gt;, ... &lt;valueN&gt; };</code></p>\n<p>Với cách khai báo này, chúng ta không cần thiết xác định trước số phần tử của mảng. Compiler sẽ xác định số phần tử thông qua số lượng giá trị mà bạn khởi tạo.</p>\n<pre><code>char my_string[] = { 'H', 'e', 'l', 'l', 'o', '\\0' };</code></pre>\n<p>Mình vừa khai báo một mảng phần tử với kiểu kí tự (Chúng ta sẽ đi sâu hơn về chuỗi kí tự trong những bài học sau), <strong>compiler</strong> nhìn vào số lượng kí tự mình khởi tạo và cấp phát 6 ô nhớ liên tục nhau trên vùng nhớ còn trống.</p>\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/5-kieu-du-lieu-mang/5-0-mang-mot-chieu/1.png?raw=true\" class=\"lightbox\" title=\"1.png?raw=true\" rel=\"nofollow\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/5-kieu-du-lieu-mang/5-0-mang-mot-chieu/1.png?raw=true\" width=\"690\" height=\"223\"><div class=\"meta\">\n<span class=\"filename\">1.png?raw=true</span><span class=\"informations\">912x296</span><span class=\"expand\"></span>\n</div></a></div></p>\n<p><em>Với kiểu kí tự, mỗi phần tử chỉ chiếm 1 byte, nên chúng ta có 6 bytes liên tiếp nhau để chứa được chuỗi kí tự trên.</em></p>\n<h3>Truy xuất đến các phần tử trong mảng một chiều</h3>\n<p>Sau khi biết cách khai báo mảng một chiều (<strong>array</strong>), điều tiếp theo chúng ta cần quan tâm là làm thế nào để truy xuất đến một phần tử trong mảng.</p>\n<blockquote><p>Mỗi phần tử trong mảng sẽ đi kèm với một chỉ số cho biết vị trí của phần tử có khoảng cách bao nhiêu so với phần tử đầu tiên của mảng. Phần tử đầu tiên của mảng mang chỉ số <strong>0</strong>, phần tử cuối cùng của mảng có <strong>N</strong> phần tử sẽ có chỉ số <strong>(N - 1)</strong>.</p></blockquote>\n<p>Cú pháp truy xuất phần tử trong mảng một chiều:</p>\n<p><code>&lt;name_of_array&gt;[index];</code></p>\n<p>Trong đó, <strong>index</strong> là một số nguyên đại diện cho chỉ số của phần tử trong mảng một chiều.</p>\n<p>Ví dụ với một mảng một chiều kiểu int32_t có 5 phần tử được khai báo như sau:</p>\n<pre><code>int32_t values[] = { 2, 4, 6, 8, 10 };</code></pre>\n<p>Khi đó, các phần tử trong mảng lần lượt là:</p>\n<pre><code>values[0]; //2\nvalues[1]; //4\nvalues[2]; //6\nvalues[3]; //8\nvalues[4]; //10</code></pre>\n<h5>Giải thích cho việc tại sao chỉ số của mảng một chiều trong C/C++ bắt đầu từ 0:</h5>\n<blockquote><p>Mỗi phần tử trong mảng sẽ đi kèm với một chỉ số cho biết vị trí của phần tử có khoảng cách bao nhiêu so với phần tử đầu tiên của mảng.</p></blockquote>\n<p>Sau khi khai báo mảng một chiều, địa chỉ của mảng ứng với địa chỉ của phần tử đầu tiên trong mảng. Vị trí của các phần tử sẽ được tính dựa trên công thức:</p>\n<p><code>index = (address_of_current_element - address_of_the_first_element) / sizeof(data_type);</code></p>\n<p>Lấy lại ví dụ mảng có 3 phần tử kiểu int32_t như trong mục <strong>Mảng một chiều (Array)</strong></p>\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/5-kieu-du-lieu-mang/5-0-mang-mot-chieu/0.png?raw=true\" class=\"lightbox\" title=\"0.png?raw=true\" rel=\"nofollow\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/5-kieu-du-lieu-mang/5-0-mang-mot-chieu/0.png?raw=true\" width=\"690\" height=\"287\"><div class=\"meta\">\n<span class=\"filename\">0.png?raw=true</span><span class=\"informations\">915x381</span><span class=\"expand\"></span>\n</div></a></div></p>\n<p>Cho rằng địa chỉ của mảng <strong>a</strong> (cũng là địa chỉ của phần tử a1) là <strong>108</strong>. Vậy chỉ số của phần tử đầu tiên a1 là:</p>\n<p><code>index_of_a1 = (address_of_a1 - address_of_the_first_element) / sizeof(int32_t);</code></p>\n<p><code>index_of_a1 = (108 - 108) / 4 = 0;</code></p>\n<p>Như vậy, phần tử đầu tiên của mảng có chỉ số là <strong>0</strong>.</p>\n<p>Đây chỉ là phần mình làm rõ cho các bạn tại sao chỉ số của mảng một chiều trong C/C++ bắt đầu từ 0 và kết thúc tại <code>(số_phần_tử - 1)</code>. Các bạn không cần quan tâm đến việc tính toán chỉ số của mỗi phần tử mà <strong>compiler</strong> sẽ làm giúp bạn.</p>\n<h5>In ra giá trị của tất cả phần tử trong mảng</h5>\n<p>Để quản lý mảng một chiều, chúng ta cần biết:</p>\n<ul>\n<li>Địa chỉ phần tử đầu tiên của mảng. (Có thể có được thông qua <code>&lt;array_name&gt;[0]</code>)</li>\n<li>Số lượng phần tử của mảng.</li>\n</ul>\n<p>Mình sẽ thực hiện một phương pháp tổng quát để lấy ra số lượng phần tử của mảng:</p>\n<p><code>&lt;number_of_elements&gt; = sizeof(&lt;name_of_array&gt;) / sizeof(&lt;type_of_array&gt;);</code></p>\n<p>Chúng ta sử dụng toán tử <strong>sizeof</strong>, truyền vào tên của mảng chúng ta sẽ nhận được giá trị là tổng kích thước bộ nhớ sử dụng cho mảng, chia cho kích thước của một phần tử của mảng chúng ta sẽ có được số lượng phần tử. Ví dụ:</p>\n<pre><code>double d_values[] = { 2.08, 1.32, 6, 4.1, 12, 999.99 };\nint32_t num_of_elements = sizeof(d_values) / sizeof(double);\n<p>//another way\nnum_of_elements = sizeof(d_values) / sizeof(d_values[0]);</p>\n<p>cout &#x3C;&#x3C; \"Number of elements = \" &#x3C;&#x3C; num_of_elements &#x3C;&#x3C; endl;</code></pre></p>\n<p>Kết quả chương trình sẽ cho ta thấy mảng có 6 phần tử:</p>\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/5-kieu-du-lieu-mang/5-0-mang-mot-chieu/2.png?raw=true\" width=\"670\" height=\"339\"></p>\n<p>Như cách thông thường, chúng ta thường định nghĩa trước số lượng phần tử tối đa mà mảng một chiều có thể chứa như sau:</p>\n<pre><code>#define ARRAY_SIZE 100\n<p>//........</p>\n<p>float f_values[ARRAY_SIZE];</code></pre></p>\n<p>Lúc này, chúng ta chỉ cần sử dụng <code>ARRAY_SIZE</code> như là số lượng phần tử của mảng. Nhưng cách này có thể là hao tốn bộ nhớ khi số lượng phần tử thực sự cần sử dụng không đạt đến con số <code>ARRAY_SIZE</code>. Vì thế, mình thường tính số phần tử của mảng theo cách tổng quát mà mình trình bày ở trên.</p>\n<h5>Điều gì xảy ra nếu chúng ta truy xuất mảng bằng chỉ số lớn hơn số lượng phần tử?</h5>\n<p>Các bạn thử chạy đoạn chương trình sau:</p>\n<pre><code>int32_t arr[] = { 1, 2, 3, 4, 5 }; //create an array with 5 elements\ncout &lt;&lt; arr[100] &lt;&lt; endl;</code></pre>\n<p>Ở lần chạy đầu tiên của đoạn chương trình trên, máy mình cho ra kết quả:</p>\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/5-kieu-du-lieu-mang/5-0-mang-mot-chieu/3.png?raw=true\" width=\"668\" height=\"337\"></p>\n<p>Thử chạy lại chương trình nhiều lần khác nhau, các bạn sẽ thấy được nhiều giá trị khác nhau. Những giá trị này ở đâu ra?</p>\n<p>Đó chính là những giá trị thuộc vùng nhớ mà chương trình khác đang quản lý.</p>\n<p><div class=\"lightbox-wrapper\"><a href=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/5-kieu-du-lieu-mang/5-0-mang-mot-chieu/4.png?raw=true\" class=\"lightbox\" title=\"4.png?raw=true\" rel=\"nofollow\"><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/5-kieu-du-lieu-mang/5-0-mang-mot-chieu/4.png?raw=true\" width=\"690\" height=\"274\"><div class=\"meta\">\n<span class=\"filename\">4.png?raw=true</span><span class=\"informations\">968x385</span><span class=\"expand\"></span>\n</div></a></div></p>\n<p>Có thể sau khi các chương trình khác sử dụng vùng nhớ đó và trả lại cho hệ điều hành quản lý, giá trị của ô nhớ vẫn còn giữ nguyên, nên khi truy cập mảng với chỉ số vượt quá số lượng phần tử tối đa, chúng ta nhận được những giá trị không có ý nghĩa.</p>\n<p>Trường hợp xấu hơn có thể xảy ra là khi các chương trình khác đang sử dụng vùng nhớ mà bạn truy cập đến, Visual studio sẽ đưa ra cảnh báo về việc xung đột vùng nhớ và cho dừng chương trình của bạn.</p>\n<p><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/5-kieu-du-lieu-mang/5-0-mang-mot-chieu/5.png\" width=\"558\" height=\"314\"></p>\n<p>Vì thế việc quản lý số lượng phần tử của mảng là rất quan trọng.</p>\n<h3>Nhập dữ liệu cho mảng một chiều (Array input)</h3>\n<p>Giả sử chúng ta có mảng một chiều dùng để chứa 10 số nguyên (có chỉ số từ 0 đến 9). Để nhập dữ liệu cho từng phần tử trong mảng này, chúng ta có thể sử dụng đối tượng <strong>cin</strong> trong thư viện <strong>iostream</strong> mà các bạn đã được học.</p>\n<p><code>cin &gt;&gt; &lt;name_of_array&gt;[index];</code></p>\n<p>Trong đó, <strong>index</strong> là chỉ số của phần tử của mảng mà chúng ta cần nhập giá trị từ bàn phím và đưa vào phần tử.</p>\n<pre><code>int32_t arr[10];\nfor(int32_t index = 0; index &lt;= 9; index++)\t{\n\tcin &gt;&gt; arr[index];\n}</code></pre>\n<p>Mình vừa sử dụng vòng lặp <strong>for</strong> (vì mình biết được số lượng phần tử của mảng nên mình biết cần lặp bao nhiêu lần), trong vòng lặp <strong>for</strong> này, mình sử dụng biến <strong>index</strong> và cho nó di chuyển từ giá trị <strong>0 đến 9</strong> tương ứng với từng chỉ số của các phần tử trong mảng. Với mỗi giá trị <strong>index</strong> được gán, mình thực hiện nhập dữ liệu từ bàn phím bằng đối tượng <strong>cin</strong> cho phần tử <strong>arr[index]</strong>.</p>\n<h5>Một cách tổng quát hơn để nhập dữ liệu cho mảng một chiều</h5>\n<p>Ở ví dụ trên, mình cho mảng số nguyên có số lượng phần tử cố định là 10. Đối với mảng một chiều có số lượng phần tử khác nhau thì ta làm thế nào?</p>\n<p>Việc đầu tiên chúng ta cần làm là tìm ra số lượng phần tử của mảng. Ví dụ:</p>\n<pre><code>int32_t i_values[100];\nint32_t num_of_elements = sizeof(i_values) / sizeof(int32_t);\n<p>for(int32_t index = 0; index &#x3C;= (num_of_elements - 1); index++)\t{\ncin >> i_values[index];\n}</code></pre></p>\n<p>Với cách này, chúng ta có thể không cần quan tâm đến số lượng phần tử hiện tại của mảng, mà mình để <strong>compiler</strong> tính giúp mình.</p>\n<p>Mình cho biến index chạy từ 0 đến (num_of_elements - 1) vì như mình đã nói ở trên, mảng một chiều có chỉ số bắt đầu từ 0 đến <code>số_lượng_phần_tử</code> trừ đi 1.</p>\n<h5>Đưa ra nhắc nhở khi nhập dữ liệu cho mảng</h5>\n<p>Chúng ta nên thông báo cho người dùng biết là chúng ta đang nhập dữ liệu cho phần tử nào trong mảng.</p>\n<pre><code>int32_t i_values[100];\nint32_t num_of_elements = sizeof(i_values) / sizeof(int32_t);\n<p>for(int32_t index = 0; index &#x3C;= (num_of_elements - 1); index++)\t{\ncout &#x3C;&#x3C; \"Value of element \" &#x3C;&#x3C; index &#x3C;&#x3C; \": \";\ncin >> i_values[index];\n}</code></pre></p>\n<p>Như vậy, người dùng sẽ tránh được việc nhập nhầm thứ tự dữ liệu cho các phần tử trong mảng.</p>\n<p>Ngoài việc dùng đối tượng cin, chúng ta cũng có thể gán trực tiếp giá trị cho các phần tử trong mảng thông qua toán tử gán.</p>\n<pre><code>int32_t i_values[100];\nint32_t num_of_elements = sizeof(i_values) / sizeof(int32_t);\n<p>for(int32_t index = 0; index &#x3C;= (num_of_elements - 1); index++)\t{\ni_values[index] = index + 1;\n}</code></pre></p>\n<h5>Nhập dữ liệu cho ô nhớ có chỉ số vượt quá số lượng phần tử</h5>\n<p>Cũng tương tự như việc bạn truy xuất đến phần tử với chỉ số vượt ngoài tầm số lượng phần tử trong mảng, Visual studio sẽ đưa ra cảnh báo xung đột vùng nhớ và dừng chương trình.</p>\n<h2></h2>\n<h3>Tổng kết</h3>\n<p>Cùng nhìn lại vấn đề mình đặt ra ngay từ đầu bài học, mảng một chiều đã giúp chúng ta tiết kiệm thời gian hơn khi mà chỉ với 1 dòng lệnh khai báo mảng một chiều, chúng ta có thể quản lý 30 vùng nhớ liên tiếp nhau dùng để lưu trữ điểm của cả 30 sinh viên. Chúng ta cũng có thể biết được điểm số nào là của sinh viên nào thông qua chỉ số của mảng đó.</p>\n<p>Mảng một chiều đã khắc phục nhiều nhược điểm của việc khai báo các biến đơn lẻ. Tuy nhiên, nó cũng có một số nhược điểm riêng như việc dư thừa vùng nhớ khi không dùng hết số lượng ô nhớ đã cấp phát, hoặc số lượng phần tử được yêu cầu quá lớn nên hệ điều hành không đủ khả năng cấp phát. Chúng ta sẽ tìm cách giải quyết những vấn đề này trong những bài học sau.</p>\n<h3>Bài tập cơ bản</h3>\n<p>Với yêu cầu đặt ra ban đầu, giảng viên cần biết điểm số cao nhất của 30 sinh viên trong lớp, đồng thời muốn biết điểm cao nhất là của sinh viên có số thứ tự bao nhiêu. Bạn hãy sử dụng mảng 1 chiều để giải quyết vấn đề này. (Điểm của sinh viên được nhập từ bàn phím)</p>\n<hr>\n<p><strong>Hẹn gặp lại các bạn trong bài học tiếp theo trong khóa học lập trình C++ hướng thực hành.</strong></p>\n<p>Mọi ý kiến đóng góp hoặc thắc mắc có thể đặt câu hỏi trực tiếp tại diễn đàn.</p>\n<p><a title=\"DayNhauHoc\" class=\"onebox\" target=\"_blank\">www.daynhauhoc.com</a></p>\n<hr>\n<h3>Link Videos khóa học</h3>\n<p><a href=\"https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview\" class=\"onebox\" target=\"_blank\" rel=\"nofollow\">https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview</a></p>\n","__filename":"generated/30080.md","__url":"/5/0-mang-mot-chieu/","__resourceUrl":"/5/0-mang-mot-chieu/index.html","__dataUrl":"/data/2bdad.json"}