{"head":{"title":"7.2 Truyền đối số cho hàm là giá trị hoặc tham chiếu","route":"7/2-truyen-doi-so-cho-ham-la-gia-tri-hoac-tham-chieu","id":30319,"description":"} } int main() { \tint argument; \tcout &lt;&lt; \"Address of argument: \" &lt;&lt; &argument &lt;&lt; endl;…"},"body":"<h4>Chào các bạn! Rất vui khi được gặp lại các bạn trong khóa học lập trình trực tuyển ngôn ngữ C++.</h4>\n<p>Trong bài học ngày hôm nay, chúng ta sẽ tìm hiểu về một số cách khác nhau để truyền đối số vào hàm. Như thế nào gọi là đối số?</p>\n<p>Ví dụ mình định nghĩa một hàm như sau:</p>\n<pre><code>void foo(int param1, int param2) //param1 and param2 are parameters\n{\n\t//do something\n}</code></pre>\n<p>Như vậy, chúng ta có <strong>param1</strong> và <strong>param2</strong> là 2 tham số (parameters) của hàm <strong>foo</strong>.</p>\n<blockquote><p>Tham số của hàm là những biến được khai báo trong việc khai báo hàm. Tham số đóng vai trò tiếp nhận giá trị đầu vào cho hàm mỗi khi hàm được gọi.</p></blockquote>\n<p>Giả sử trong hàm <strong>main</strong> mình thực hiện gọi hàm <strong>foo</strong>:</p>\n<pre><code>int main()\n{\n\tfoo(1, 2); //1 and 2 are arguments\n\treturn 0;\n}</code></pre>\n<p>Như vậy, chúng ta có <strong>1</strong> và <strong>2</strong> là 2 đối số (arguments). Khi đó, giá trị <strong>1</strong> và <strong>2</strong> sẽ được tiếp nhận và lưu trữ tạm thời trong 2 tham số <strong>param1</strong> và <strong>param2</strong>.</p>\n<blockquote><p>Đối số là giá trị được truyền vào hàm mỗi khi thực hiện lời gọi hàm. Đối số phải có kiểu dữ liệu phù hợp với tham số của hàm.</p></blockquote>\n<p>Ngôn ngữ C++ hổ trợ cho chúng ta nhiều kiểu truyền đối số khác nhau tương ứng với mỗi kiểu khai báo tham số khác nhau:</p>\n<ul>\n<li>Truyền đối số là giá trị.</li>\n<li>Truyền đối số là tham chiếu.</li>\n<li>Truyền đối số là địa chỉ.</li>\n</ul>\n<p>Trong bài này, chúng ta sẽ tìm hiểu 2 kiểu truyền đối số cơ bản: truyền giá trị và truyền tham chiếu.</p>\n<hr>\n<h3>Truyền đối số là giá trị (pass arguments by value)</h3>\n<p>Truyền đối số vào hàm là giá trị có nghĩa là chúng ta sẽ đưa giá trị vào hàm và các tham số sẽ tiếp nhận những giá trị được truyền vào.</p>\n<p>Ví dụ:</p>\n<pre><code>int add(int x, int y)\n{\n\treturn x + y;\n}</code></pre>\n<p>Hàm add trên sẽ hoạt động như sau:</p>\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/7-co-ban-ve-ham/7-2-truyen-doi-so-cho-ham-la-gia-tri-hoac-tham-chieu/1.png?raw=true\" width=\"372\" height=\"248\"></p>\n<p>Với lời gọi hàm <strong>add(4,5)</strong> thì giá trị 4 sẽ truyền vào cho biến <strong>x</strong> của tham số đầu tiên, giá trị 5 sẽ được gán cho biến <strong>y</strong> của tham số thứ hai.</p>\n<p>Biến <strong>x</strong> và <strong>y</strong> được khai báo làm tham số của hàm <strong>add</strong> đóng vai trò như là biến cục bộ hoạt động bên trong hàm <strong>add</strong>. Vì thế, tại thời điểm kết thúc phiên làm việc của hàm, các biến tham số này sẽ bị hủy và những giá trị được truyền vào không còn tồn tại.</p>\n<h5>Điều gì xảy ra khi truyền đối số cho hàm là giá trị của một biến (variable)?</h5>\n<p>Ở ví dụ trên, hàm <strong>add</strong> được truyền vào 2 giá trị xác định là 4 và 5. Bây giờ mình thử lấy ví dụ khi truyền đối số cho hàm là giá trị của biến như sau:</p>\n<pre><code>void swapValue(int value1, int value2)\n{\n\tcout &lt;&lt; \"Swap value in function\" &lt;&lt; endl;\n<pre><code>int temp = value1;\nvalue1   = value2;\nvalue2   = temp;\n\ncout &#x26;lt;&#x26;lt; \"value 1: \" &#x26;lt;&#x26;lt; value1 &#x26;lt;&#x26;lt; endl;\ncout &#x26;lt;&#x26;lt; \"value 2: \" &#x26;lt;&#x26;lt; value2 &#x26;lt;&#x26;lt; endl;\n</code></pre>\n<p>}</code></pre></p>\n<p>Hàm <strong>swapValue</strong> mình vừa định nghĩa được khai báo 2 tham số kiểu <strong>int</strong>, chúng sẽ tiếp nhận 2 giá trị số nguyên và thực hiện hoán vị giá trị của 2 số nguyên này bên trong hàm.</p>\n<p>Các bạn cùng xem điều gì xảy ra khi thực hiện lời gọi hàm <strong>swapValue</strong>:</p>\n<pre><code>int main()\n{\n\tint a = 1;\n\tint b = 2;\n\tswapValue(a, b);\n<pre><code>cout &#x26;lt;&#x26;lt; \"===============================\" &#x26;lt;&#x26;lt; endl;\ncout &#x26;lt;&#x26;lt; \"After the function call\" &#x26;lt;&#x26;lt; endl;\ncout &#x26;lt;&#x26;lt; \"value 1: \" &#x26;lt;&#x26;lt; a &#x26;lt;&#x26;lt; endl;\ncout &#x26;lt;&#x26;lt; \"value 2: \" &#x26;lt;&#x26;lt; b &#x26;lt;&#x26;lt; endl;\n\nsystem(\"pause\");\nreturn 0;\n</code></pre>\n<p>}</code></pre></p>\n<p>Đối số được truyền vào cho hàm <strong>swapValue</strong> lần lượt là giá trị của biến <strong>a</strong> và giá trị của biến <strong>b</strong> sẽ được tiếp nhận bởi tham số <strong>value1</strong> và <strong>value2</strong>. Chúng ta sẽ có kết quả trên màn hình là giá trị của 2 biến <strong>a</strong> và <strong>b</strong> sau khi thực hiện hoán vị bên trong hàm, và giá trị của 2 biến <strong>a</strong> và <strong>b</strong> sau khi thực hiện lời gọi hàm <strong>swapValue</strong>.</p>\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/7-co-ban-ve-ham/7-2-truyen-doi-so-cho-ham-la-gia-tri-hoac-tham-chieu/2.png?raw=true\" width=\"677\" height=\"343\"></p>\n<p>Như các bạn cũng đã thấy, giá trị của 2 biến <strong>value1</strong> và <strong>value2</strong> (nhận được từ đối số là giá trị của biến <strong>a</strong> và <strong>b</strong>) đã bị hoán vị cho nhau. Nhưng sau khi thực hiện xong công việc bên trong hàm <strong>swapValue</strong> và trở lại thực hiện công việc còn lại bên trong hàm <strong>main</strong>, giá trị của 2 biến <strong>a</strong> và <strong>b</strong> vẫn không có gì thay đổi.</p>\n<p>Điều này có nghĩa cái mà tham số <strong>value1</strong> và <strong>value2</strong> tiếp nhận chỉ là 2 bản sao giá trị của biến <strong>a</strong> và <strong>b</strong>.</p>\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/7-co-ban-ve-ham/7-2-truyen-doi-so-cho-ham-la-gia-tri-hoac-tham-chieu/0.png?raw=true\" width=\"477\" height=\"352\"></p>\n<p>Mọi thay đổi giá trị của tham số bên trong hàm không tác động gì đến giá trị gốc mà đối số đang nắm giữ. Thử nghiệm với ví dụ sau:</p>\n<pre><code>void printAddressOfParameter(int parameter)\n{\n\tcout &lt;&lt; \"Address of argument: \" &lt;&lt; &amp;parameter &lt;&lt; endl;\n}\n<p>int main()\n{\nint argument;\ncout &#x3C;&#x3C; \"Address of argument: \" &#x3C;&#x3C; &#x26;argument &#x3C;&#x3C; endl;\nprintAddressOfParameter(argument);</p>\n<pre><code>system(\"pause\");\nreturn 0;\n</code></pre>\n<p>}</code></pre></p>\n<p>Khi chạy đoạn chương trình này, các bạn sẽ thấy địa chỉ của biến <strong>argument</strong> và địa chỉ của tham số <strong>parameter</strong> trong hàm hoàn toàn khác biệt.</p>\n<h3>Truyền đối số cho hàm là tham chiếu (pass argument by reference)</h3>\n<p>Cách hoạt động của hàm nhận đầu vào (<strong>input</strong>) là giá trị khá dễ hiểu và dễ cài đặt, nhưng nó có một số hạn chế như sau:</p>\n<ul>\n<li><p>Khi truyền đối số cho hàm là giá trị, cách duy nhất để có được đầu ra (<strong>output</strong>) là trả về giá trị thông qua từ khóa return.</p></li>\n<li><p>Khi truyền đối số cho hàm là giá trị, hảm chỉ có thể trả về 1 giá trị duy nhất tại 1 lần gọi hàm (nếu hàm có kiểu trả về).</p></li>\n</ul>\n<p>Thử lấy ví dụ để thấy rõ 2 vấn đề trên:</p>\n<pre><code>int addOne(int value)\n{\n\treturn value + 1;\n}</code></pre>\n<p>Mình vừa định nghĩa một hàm có chức năng cộng thêm vào đối số 1 đơn vị. Cách duy nhất mình nhận được giá trị đầu ra của hàm này là định nghĩa hàm có kiểu trả về và sử dụng từ khóa <strong>return</strong>.</p>\n<pre><code>int main()\n{\n\tint number = 9;\n\tnumber = addOne(number); //function call\n<pre><code>system(\"pause\");\nreturn 0;\n</code></pre>\n<p>}</code></pre></p>\n<p>Vì thế, nếu mình muốn lấy được giá trị đầu ra của hàm <strong>addOne</strong>, mình phải sử dụng phép gán giá trị trả về của hàm cho biến mà mình làm đối số.</p>\n<p><strong><em>Thực hiện truyền đối số cho hàm là tham chiếu (pass argument by reference) sẽ giúp chúng ta khắc phục 2 nhược điểm trên.</em></strong></p>\n<h5>Nhắc lại khái niệm tham chiếu (reference)</h5>\n<blockquote><p>Một biến tham chiếu (<strong>reference variable</strong>) được xem như một cái tên khác (<strong>nickname</strong> or <strong>alias name</strong>) của một biến khác có cùng kiểu dữ liệu. Sau khi biến tham chiếu được khai báo và khởi tạo, nó sử dụng chung vùng nhớ với biến mà nó tham chiếu đến.</p></blockquote>\n<p>Chúng ta sử dụng toán tử một ngôi &amp; để khai báo biến tham chiếu:</p>\n<pre><code>int number = 5;\nint &amp;reference = number;\n<p>reference = 10; //change value of number variable through its reference\ncout &#x3C;&#x3C; number &#x3C;&#x3C; endl;</code></pre></p>\n<p>Khi một trong hai biến bị hủy (biến tham chiếu hay biến gốc bị hủy do ra khỏi khối lệnh mà nó được khai báo), vùng nhớ mà 2 biến này kiểm soát vẫn chưa bị hủy nếu còn ít nhất 1 biến quản lý nó, cái bị hủy sẽ chỉ là tên biến.</p>\n<pre><code>int main()\n{\n    int n = 0;\n    int &amp;ref = n;\n    \n    {\n        int n2 = 5;\n        ref = n2;\n    }\n    \n    cout &lt;&lt; ref &lt;&lt; endl;\n    return 0;\n}</code></pre>\n<p>Như ví dụ này, biến <strong>ref</strong> tham chiếu đến biến <strong>n2</strong> trong khối lệnh con của hàm <strong>main</strong>, khi ra khỏi khối lệnh con, biến <strong>n2</strong> bị hủy nhưng vùng nhớ được cấp phát cho nó vẫn còn và vẫn đang được biến <strong>ref</strong> quản lý.</p>\n<p><strong><em>Cách hoạt động của biến tham chiếu cũng tương tự như việc định nghĩa hàm có tham số là biến tham chiếu.</em></strong></p>\n<h5>Truyền đối số cho hàm là tham chiếu (pass argument by reference)</h5>\n<p>Để truyền đối số cho hàm là tham chiếu, chúng ta đơn giản thêm vào toán tử &amp; lúc khai báo tham số cho hàm.</p>\n<pre><code>void addOne(int &amp;value)\n{\n\tvalue++;\n}</code></pre>\n<p>Lấy lại ví dụ hàm <strong>addOne</strong> nhưng với cách khai báo tham số là tham chiếu. Lúc này, tại thời điểm gọi hàm <strong>addOne</strong>, chương trình sẽ không tạo ra một vùng nhớ riêng để nhận giá trị của đối số nữa, mà nó sẽ tạo ra một biến tham chiếu và tham chiếu trực tiếp đến vùng nhớ của đối số.</p>\n<p>Chúng ta cùng xem kết quả của lời gọi hàm <strong>addOne</strong> khi truyền đối số là tham chiếu.</p>\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/7-co-ban-ve-ham/7-2-truyen-doi-so-cho-ham-la-gia-tri-hoac-tham-chieu/3.png?raw=true\" width=\"677\" height=\"343\"></p>\n<p>Kết quả là giá trị của đối số đã được tăng lên 1 đơn vị. Tại thời điểm gọi hàm <strong>addOne</strong>, một tham chiếu được tạo ra để tham chiếu đến vùng nhớ của đối số. Sau khi ra khỏi hàm, biến tham chiếu bị hủy, nhưng như mình đã nói ở trên, vẫn còn một biến (được dùng làm đối số) đang quản lý vùng nhớ đó nên chỉ có tên của biến tham chiếu bị hủy.</p>\n<p>Như các bạn thấy, mình đã định nghĩa lại hàm <strong>addOne</strong> thành hàm không có kiểu trả về, vì giá trị đầu ra của mình đã được trả về bằng chính đối số được truyền vào. Lợi dụng đặc điểm này, chúng ta có thể trả về cùng lúc nhiều giá trị chỉ với 1 lần gọi hàm.</p>\n<h5>Trả về nhiều giá trị thông qua nhiều tham số</h5>\n<p>Thỉnh thoảng, chúng ta cần 1 hàm trả về nhiều giá trị trong khi sử dụng từ khóa return chỉ trả về được 1 giá trị, đó là lúc chúng ta sử dụng biến tham chiếu làm tham số cho hàm.</p>\n<pre><code>void getSinCos(float degrees, float &amp;sinOut, float &amp;cosOut)\n{\n\tfloat radian = degrees * PI / 180.0;\n<pre><code>sinOut = sin(radian);\ncosOut = cos(radian);\n</code></pre>\n<p>}</code></pre></p>\n<p>Hàm getSinCos nhận giá trị đầu vào đầu tiên là giá trị, trả về 2 giá trị đầu ra thông qua 2 biến tham chiếu.</p>\n<pre><code>int main()\n{\n\tfloat degrees = 180.0, Sin, Cos;\n\tgetSinCos(degrees, Sin, Cos);\n<pre><code>cout &#x26;lt;&#x26;lt; \"sin = \" &#x26;lt;&#x26;lt; Sin &#x26;lt;&#x26;lt; endl;\ncout &#x26;lt;&#x26;lt; \"cos = \" &#x26;lt;&#x26;lt; Cos &#x26;lt;&#x26;lt; endl;\n\nsystem(\"pause\");\nreturn 0;\n</code></pre>\n<p>}</code></pre></p>\n<hr>\n<h3>Tổng kết</h3>\n<p><strong>Truyền đối số vào hàm là giá trị</strong></p>\n<ul>\n<li>\n<p>Ưu điểm:</p>\n<ul>\n<li>Giá trị làm đối số có thể là 1 giá trị xác định, giá trị của biến, biểu thức, ...</li>\n<li>Đối số truyền vào hàm sẽ không bị hàm tác động trực tiếp đến, đảm bảo an toàn dữ liệu khi sử dụng hàm.</li>\n</ul>\n</li>\n<li>\n<p>Nhược điểm:</p>\n<ul>\n<li>Chương trình tạo ra những bản sao giá trị gây tốn thêm vùng nhớ sử dụng.</li>\n<li>Cách duy nhất để lấy được đầu ra (<strong>output</strong>) là thông qua từ khóa return với hàm có kiểu trả về.</li>\n<li>Không thể truyền mảng một chiều vào hàm bằng giá trị.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Truyền đối số vào hàm là tham chiếu</strong></p>\n<ul>\n<li>\n<p>Ưu điểm:</p>\n<ul>\n<li>Cho phép thay đổi giá trị của đối số.</li>\n<li>Chương trình không tạo bản sao giá trị của đối số nên tiết kiệm bộ nhớ và hoạt động nhanh hơn.</li>\n<li>Có thể trả về nhiều giá trị trong một lần gọi hàm.</li>\n</ul>\n</li>\n<li>\n<p>Nhược điểm:</p>\n<ul><li>Sử dụng tham số là tham chiếu không hợp lý có thể gây sai sót dữ liệu.</li></ul>\n</li>\n</ul>\n<hr>\n<p><strong>Hẹn gặp lại các bạn trong bài học tiếp theo trong khóa học lập trình C++ hướng thực hành.</strong></p>\n<p>Mọi ý kiến đóng góp hoặc thắc mắc có thể đặt câu hỏi trực tiếp tại diễn đàn.</p>\n<p><a title=\"DayNhauHoc\" class=\"onebox\" target=\"_blank\">www.daynhauhoc.com</a></p>\n<hr>\n<h3>Link Videos khóa học</h3>\n<p><a href=\"https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview\" class=\"onebox\" target=\"_blank\" rel=\"nofollow\">https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview</a></p>\n","__filename":"generated/30319.md","__url":"/7/2-truyen-doi-so-cho-ham-la-gia-tri-hoac-tham-chieu/","__resourceUrl":"/7/2-truyen-doi-so-cho-ham-la-gia-tri-hoac-tham-chieu/index.html","__dataUrl":"/data/3219e.json"}