{"head":{"title":"3.2 Vòng lặp for","route":"3/2-vong-lap-for","id":30013,"description":"}"},"body":"<h4>Chào các bạn học viên đang theo dõi khóa học lập trình trực tuyến ngôn ngữ C++.</h4>\n<p>Trong các bài học trước, chúng ta đã cùng nhau tìm hiểu các cấu trúc điều khiển chương trình, trong đó có 2 bài học mình đề cập đến cấu trúc vòng lặp <strong>while</strong> và <strong>do-while</strong>. Hai cấu trúc lặp này tuy có khác nhau, nhưng chúng đều được sử dụng khi chưa biết được số lần lặp lại công việc tại thời điểm <strong>run-time</strong>.</p>\n<p>Trong bài học này, mình sẽ giới thiệu đến các bạn vòng lặp <strong>for</strong> (<strong>for loops</strong>), cũng là vòng lặp cơ bản cuối cùng trong ngôn ngữ lập trình C++.</p>\n<h5>Một số đặc điểm của vòng lặp for:</h5>\n<ul>\n<li>Vòng lặp for có cú pháp phức tạp hơn, nhưng ngắn gọn hơn các vòng lặp <strong>while</strong> hay <strong>do-while</strong> khi sử dụng.</li>\n<li>Vòng lặp <strong>for</strong> hoàn toàn có thể thay thế vòng lặp <strong>while</strong>.</li>\n<li>Vòng lặp for thường được sử dụng cho các trường hợp biết trước số lần lặp lại khối công việc.</li>\n</ul>\n<h5>Cú pháp vòng lặp for</h5>\n<pre><code>for (variable_initialization; condition; variable_update)\n{\n\tstatements;\n}</code></pre>\n<p>Mình lấy 1 ví dụ trước khi giải thích các thành phần của vòng lặp <strong>for</strong>:</p>\n<pre><code>for (int count = 1; count &lt;= 10; count++)\n{\n\tcout &lt;&lt; \"count = \" &lt;&lt; count &lt;&lt; endl;\n}</code></pre>\n<p>Vòng lặp for được định nghĩa bởi từ khóa <strong>for</strong> và được chia làm 3 phần chính, mỗi phần được ngăn cách bởi dấu chấm phẩy:</p>\n<ul>\n<li>\n<p><strong>Variable initialization (phần khởi tạo biến)</strong></p>\n<p>Khác với vòng lặp while và do-while, biến vòng lặp có thể được khai báo và khởi tạo giá trị ngay bên trong phần khởi tạo của vòng lặp <strong>for</strong>. Như ở ví dụ trên, biến count được khai báo và khởi tạo với giá trị 0.</p>\n<p>Phần khởi tạo biến được thực thi đầu tiên và chỉ thực thi 1 lần duy nhất trong vòng lặp <strong>for</strong>.</p>\n</li>\n<li>\n<p><strong>Condition (biểu thức điều kiện)</strong></p>\n<p>Phần này tương tự như vòng lặp <strong>while</strong>, khối lệnh của vòng lặp for sẽ được thực hiện nếu biểu thức điều kiện cho giá trị đúng. Vòng lặp <strong>for</strong> kiểm tra biểu thức điều kiện trước khi thực hiện khối lệnh.</p>\n</li>\n<li>\n<p><strong>Variable update (cập nhật biến vòng lặp)</strong></p>\n<p>Phần này sẽ được thực thi cuối mỗi lần lặp, sau khi khối lệnh của vòng lặp <strong>for</strong> được thực thi. Phần này thường chịu trách nhiệm thay đổi giá trị biến vòng lặp được sử dụng trong biểu thức điều kiện (nhằm tránh tình trạng lặp vô hạn). Sau khi thực thi xong phần cập nhật biến vòng lặp, chương trình quay trở lại đánh giá biểu thức điều kiện của vòng lặp <strong>for</strong> và cứ như thế.</p>\n</li>\n</ul>\n<p>Vậy chúng ta rút ra được các bước thực hiện vòng lặp <strong>for</strong> như sau:</p>\n<p><code>initialize loop variables --&gt; check condition expression --&gt; execute statements --&gt; update loop variables</code>.</p>\n<pre><code>for (int count = 1; count &lt;= 10; count++)\n{\n\tcout &lt;&lt; count &lt;&lt; \" \";\n}</code></pre>\n<p>Ví dụ trên có thể được chuyển về dưới dạng vòng lặp while như sau:</p>\n<pre><code>int count = 1; //variable initialization\nwhile (count &lt;= 10) //condition\n{\n\tcout &lt;&lt; count &lt;&lt; \" \"; //statements\n\t\n\tcount++; //variable update\n}</code></pre>\n<p>Nhìn có vẻ dài dòng hơn vòng lặp for, nhưng vẫn có đủ 3 thành phần: <strong>variable initialization, condition và variable update.</strong></p>\n<p>Những lập trình viên mới học đến vòng lặp <strong>for</strong> sẽ cảm thấy khó đọc hơn vòng lặp <strong>while</strong>. Tuy nhiên, khi sử dụng thành thạo, vòng lặp <strong>for</strong> có nhiều tiện ích hơn.</p>\n<h5>Một số ví dụ về vòng lặp for</h5>\n<p>Dưới đây là một ví dụ sử dụng vòng lặp for để in ra tất cả các số chẵn từ 0 đến 10. Chúng ta đã biết trước rằng biến vòng lặp sẽ đi từ 0 đến 10, nên việc sử dụng vòng lặp for là phù hợp.</p>\n<pre><code>for (int i = 0; i &lt;= 10; i++)\n{\n\tif (i % 2 == 0)\n\t\tcout &lt;&lt; i &lt;&lt; \" \";\n}</code></pre>\n<p>Mình vừa sử dụng vòng lặp <strong>for</strong> để cho biến i tăng giá trị từ 1 đến 10, cứ mỗi lần lặp, mình kiểm tra giá trị hiện tại của biến i, nếu giá trị hiện tại của i chẵn, mình thực hiện in biến i ra màn hình.</p>\n<p>Vòng lặp này có thể được rút gọn lại như sau:</p>\n<pre><code>for (int i = 0; i &lt;= 10; i += 2)\n{\n\tcout &lt;&lt; i &lt;&lt; \" \";\n}</code></pre>\n<p>Chúng ta biết rằng số chẵn tiếp theo sẽ cách số chẵn trước đó 2 đơn vị, do đó, mình thực hiện cộng thêm 2 đơn vị cho biến i tại phần <strong>variable update</strong>. Nhờ đó, mình không cần thực hiện kiểm tra giá trị của biến i trong vòng lặp nữa.</p>\n<p>Bây giờ, thay vì chúng ta thực hiện lặp từ 0 đến 10, chúng ta có thể đi ngược lại từ 10 về 0 như sau:</p>\n<pre><code>for (int i = 10; i &gt;= 0; i -= 2)\n{\n\tcout &lt;&lt; i &lt;&lt; \" \";\n}</code></pre>\n<p>Kết quả in ra sẽ là:</p>\n<pre><code>10 8 6 4 2 0</code></pre>\n<h5>Multiple declarations</h5>\n<p>Trong một số trường hợp, vòng lặp của chúng ta cần sử dụng đồng thời nhiều biến khác nhau. Ngôn ngữ C++ hổ trợ cho chúng ta khai báo và khởi tạo nhiều biến bên trong phần <strong>variable initialization</strong> của vòng lặp <strong>for</strong>.</p>\n<pre><code>for (int hh = 0, mm = 0, ss = 0 ; true; ss++)\n{\n\tif (ss &gt;= 60)\n\t{\n\t\tss = 0;\n\t\tmm++;\n\t\tif (mm &gt;= 60)\n\t\t{\n\t\t\thh++;\n\t\t\tif (hh &gt;= 24)\n\t\t\t{\n\t\t\t\thh = 0;\n\t\t\t}\n\t\t}\n\t}\n<pre><code>cout &#x26;lt;&#x26;lt; hh &#x26;lt;&#x26;lt; \":\" &#x26;lt;&#x26;lt; mm &#x26;lt;&#x26;lt; \":\" &#x26;lt;&#x26;lt; ss &#x26;lt;&#x26;lt; endl;\n\n_sleep(1000);\nsystem(\"cls\");\n</code></pre>\n<p>}</code></pre></p>\n<p>Nếu các bạn đặt khai báo biến vòng lặp tại phần <strong>variable initialization</strong> của vòng lặp <strong>for</strong>, những biến này phải có cùng kiểu dữ liệu.</p>\n<h5>Lược bỏ một số thành phần trong vòng lặp for</h5>\n<p>Một đặc điểm nổi bật hơn so với các vòng lặp khác là vòng lặp for cho phép lập trình viên lược bỏ các thành phần nếu không cần sử dụng. Ví dụ:</p>\n<pre><code>int loop = 0\nfor ( ; loop &lt;= 10; )\n{\n\tcout &lt;&lt; loop++ &lt;&lt; \" \";\n}</code></pre>\n<p>Trong ví dụ trên, mình không cần sử dụng tới thành phần khởi tạo biến, cũng như thành phần cập nhật giá trị biến. Lúc này, vòng lặp này hoàn toàn giống với vòng lặp <strong>while</strong>.</p>\n<p>Chúng ta có thể lược bỏ luôn cả 3 thành phần cơ bản của vòng lặp for:</p>\n<pre><code>for ( ; ; )\n{\n\t// do something\n}</code></pre>\n<p>Khi biểu thức điều kiện trong for được bỏ trống, nó đồng nghĩa với việc biểu thức điều kiện luôn luôn đúng. Vòng lặp for này tương đương:</p>\n<pre><code>while (true)\n{\n\t// do something\n}</code></pre>\n<h5>Nesting for loops</h5>\n<p>Tương tự như vòng lặp <strong>while</strong> hay <strong>do-while</strong>, vòng lặp <strong>for</strong> có thể chứa nhiều vòng lặp khác trong khối lệnh của nó.</p>\n<pre><code>for (int i = 0; i &lt; 5; i++)\n{\n\tfor(int j = 0; j &lt; 10; j++)\n\t{\n\t\tcout &lt;&lt; \"* \";\n\t}\n\tcout &lt;&lt; endl;\n}</code></pre>\n<p>Kết quả của đoạn code này là:</p>\n<pre><code>* * * * * * * * * * \n* * * * * * * * * * \n* * * * * * * * * * \n* * * * * * * * * * \n* * * * * * * * * *</code></pre>\n<hr>\n<h3>Tổng kết</h3>\n<p>Vòng lặp <strong>for</strong> được sử dụng phần lớn trong các cấu trúc lặp trong ngôn ngữ C++ mà mình đã giới thiệu đến các bạn. Vòng lặp <strong>for</strong> phù hợp cho cả trường hợp biết trước số lần lặp lẫn không biết trước số lần lặp.</p>\n<h3>Bài tập cơ bản</h3>\n<p>1/ Viết chương trình tính giai thừa của một số nguyên n nhập từ bàn phím.</p>\n<p>2/ Viết chương trình tính dân số của một thành phố sau 10 năm nữa, biết rằng dân số hiện tại là 500.000 người, và tỉ lệ tăng dân số hằng năm của thành phố này là 1.6%.</p>\n<p>3/ Viết chương trình in ra bảng cửu chương.</p>\n<hr>\n<p>P/s: <strong>Hẹn gặp lại các bạn trong bài học tiếp theo trong khóa học lập trình C++ hướng thực hành.</strong></p>\n<p>Mọi ý kiến đóng góp hoặc thắc mắc có thể đặt câu hỏi trực tiếp tại diễn đàn </p>\n<p><strong><a href=\"http://www.daynhauhoc.com\">www.daynhauhoc.com</a></strong></p>\n<hr>\n<h3>Link Videos khóa học</h3>\n<p><a href=\"https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview\" class=\"onebox\" target=\"_blank\" rel=\"nofollow\">https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview</a></p>\n","__filename":"generated/30013.md","__url":"/3/2-vong-lap-for/","__resourceUrl":"/3/2-vong-lap-for/index.html","__dataUrl":"/data/91200.json"}