{"head":{"title":"3.1 Vòng lặp do-while","route":"3/1-vong-lap-do-while","id":30012,"description":"} const int ID = 123; const int password = 123456; int main() { \t//................. }"},"body":"<p>Trong bài học trước, chúng ta đã tìm hiểu về cấu trúc và cách hoạt động của vòng lặp <strong>while</strong>. Bây giờ mình sẽ giới thiệu đến các bạn vòng lặp <strong>do-while</strong>, và so sánh sự giống và khác nhau giữa 2 cấu trúc vòng lặp này để các bạn có thể chọn cấu trúc lặp cho phù hợp với những vấn đề khác nhau.</p>\n<p>Mình lấy lại ví dụ trong bài trước: <em>Sinh viên A đăng kí học môn lập trình C++ tại trường đại học, nếu sinh viên A không đủ điểm để qua môn học này thì sinh viên A sẽ phải học lại. Trong trường hợp sinh viên A phải học lại lần thứ 2, chúng ta lại nói rằng nếu sinh viên A không đủ điểm qua môn học này thì sinh viên A phải học lại... Vậy việc sinh viên A học lại là công việc sẽ được lặp đi lặp lại nhiều lần trong khi điều kiện sinh viên A đủ điểm để qua môn vẫn còn sai.</em></p>\n<p>Khi sử dụng vòng lặp while để áp dụng cho trường hợp sinh viên A này, luồng thực hiện của chương trình sẽ diễn ra như sơ đồ khối sau:</p>\n<p><div class=\"lightbox-wrapper\"><a href=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/3-cau-truc-vong-lap/3-1-vong-lap-do-while/0.png\" class=\"lightbox\" title=\"0.png\" rel=\"nofollow\"><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/3-cau-truc-vong-lap/3-1-vong-lap-do-while/0.png\" width=\"690\" height=\"363\"><div class=\"meta\">\n<span class=\"filename\">0.png</span><span class=\"informations\">878x463</span><span class=\"expand\"></span>\n</div></a></div></p>\n<p>Nhưng trong thực tế, có thể sinh viên A mới đăng kí học môn lập trình C++ lần đầu, lúc này sinh viên A chưa có điểm thi nhưng vẫn được đưa vào biểu thức điều kiện trong vòng lặp <strong>while</strong> để kiểm tra, như vậy vẫn giải quyết được bài toán nhưng chưa phù hợp lắm. Điều chúng ta mong muốn là sinh viên A phải thực hiện công việc \"học lập trình C++\" trước, sau đó chúng ta mới lấy điểm của sinh viên A để đánh giá và ra quyết định sinh viên A có phải học lại hay không.</p>\n<p><strong><em>Với cấu trúc thực hiện công việc trước và kiểm tra điều kiện sau, chúng ta nên sử dụng cấu trúc vòng lặp do-while.</em></strong></p>\n<p>Vậy sơ đồ khối của vòng lặp do-while dùng để biểu diễn bài toán của sinh viên A sẽ là:</p>\n<p><div class=\"lightbox-wrapper\"><a href=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/3-cau-truc-vong-lap/3-1-vong-lap-do-while/1.png\" class=\"lightbox\" title=\"1.png\" rel=\"nofollow\"><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/3-cau-truc-vong-lap/3-1-vong-lap-do-while/1.png\" width=\"690\" height=\"466\"><div class=\"meta\">\n<span class=\"filename\">1.png</span><span class=\"informations\">852x576</span><span class=\"expand\"></span>\n</div></a></div></p>\n<p>Nhìn vào sơ đồ, chúng ta thấy sinh viên A phải học lập trình C++ ít nhất 1 lần, sau đó đưa điểm số của sinh viên A vào biểu thức điều kiện để đánh giá và quyết định sinh viên A có bị học lại hay không. Cấu trúc vòng lặp <strong>do-while</strong> áp dụng vào bài toán này phù hợp hơn cấu trúc vòng lặp <strong>while</strong>.</p>\n<hr>\n<h3>do-while statements</h3>\n<p><strong>do-while statement</strong> là cấu trúc vòng lặp thứ 2 mình muốn giới thiệu đến các bạn:</p>\n<pre><code>do\n{\n\tstatements;\n} while (expression);</code></pre>\n<p>Các câu lệnh bên trong khối lệnh của cấu trúc <strong>do-while</strong> sẽ được thực thi ít nhất 1 lần. Sau khi thực thi các câu lệnh, vòng lặp <strong>do-while</strong> sẽ đánh giá biểu thức điều kiện. Nếu biểu thức điều kiện đúng, chương trình quay trở lại thực hiện khối công việc của vòng lặp <strong>do-while</strong>, ngược lại, nếu biểu thức điều kiện sai, chương trình thoát khỏi vòng lặp <strong>do-while</strong>.</p>\n<p><strong><em>Lưu ý: vòng lặp do-while kết thúc bằng dấu chấm phẩy.</em></strong></p>\n<p>Ví dụ về vòng lặp <strong>do-while</strong>:</p>\n<pre><code>int main()\n{\n\tint selection;\n\tdo\n\t{\n\t\tcout &lt;&lt; \"_____Please make a selection_____\" &lt;&lt; endl;\n\t\tcout &lt;&lt; \"1/ Addition\" &lt;&lt; endl;\n\t\tcout &lt;&lt; \"2/ Subtraction\" &lt;&lt; endl;\n\t\tcout &lt;&lt; \"3/ Multiplication\" &lt;&lt; endl;\n\t\tcout &lt;&lt; \"4/ Division\" &lt;&lt; endl;\n<pre><code>    cout &#x26;lt;&#x26;lt; \"Your selection: \"; \n    cin &#x26;gt;&#x26;gt; selection;\n\n    cout &#x26;lt;&#x26;lt; \"Do something with your selection here\" &#x26;lt;&#x26;lt; endl;\n\n}while (selection &#x26;gt;= 1 &#x26;amp;&#x26;amp; selection &#x26;lt;= 4);        \n\nsystem(\"pause\");\nreturn 0;\n</code></pre>\n<p>}</code></pre></p>\n<blockquote><p>Có một điều đáng chú ý trong vòng lặp <strong>do-while</strong> là biến vòng lặp dùng cho biểu thức điều kiện cần được khai báo trước vòng lặp <strong>do-while</strong>. Vì từ khóa while được đặt bên ngoài khối lệnh của vòng lặp nên những biến khai báo bên trong khối lệnh sẽ bị hủy trước khi đến biểu thức điều kiện.</p></blockquote>\n<p>Trong chương trình trên, vòng lặp sẽ dừng lại khi các bạn lựa chọn giá trị không nằm trong khoảng <strong>[1, 4]</strong>. Lựa chọn giá trị nằm ngoài khoảng <strong>[1, 4]</strong> sẽ khiến biểu thức điều kiện sai.</p>\n<hr>\n<h3>Tổng kết</h3>\n<p>Khi sử dụng vòng lặp do-while các bạn chỉ cần lưu ý rằng các câu lệnh bên trong vòng lặp này sẽ được thực hiện trước khi kiểm tra biểu thức điều kiện, còn lại nó hoạt động hoàn toàn tương tự vòng lặp while mà mình đã trình bày ở bài học trước.</p>\n<h3>Bài tập cơ bản</h3>\n<p>Giả sử userID và password của chương trình được định nghĩa như bên dưới<br></p>\n<p></p><pre><code class=\"lang-auto\">#include &lt;iostream&gt;\nusing namespace std;\n<p>const int ID = 123;\nconst int password = 123456;</p>\n<p>int main()\n{\n//.................\n}</code></pre></p>\n<p>Viết tiếp chương trình trên sử dụng vòng lặp do-while để kiểm tra userID và password được nhập từ bàn phím. Chương trình chỉ thực hiện tiếp khi người dùng nhập đúng userID và password. Nếu nhập sai, chương trình sẽ yêu cầu người dùng nhập lại.</p>\n<hr>\n<p>P/s: <strong>Hẹn gặp lại các bạn trong bài học tiếp theo trong khóa học lập trình C++ hướng thực hành.</strong></p>\n<p>Mọi ý kiến đóng góp hoặc thắc mắc có thể đặt câu hỏi trực tiếp tại diễn đàn </p>\n<p><strong><a href=\"http://www.daynhauhoc.com\">www.daynhauhoc.com</a></strong></p>\n<hr>\n<h3>Link Videos khóa học</h3>\n<p><a href=\"https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview\" class=\"onebox\" target=\"_blank\" rel=\"nofollow\">https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview</a></p>\n","__filename":"generated/30012.md","__url":"/3/1-vong-lap-do-while/","__resourceUrl":"/3/1-vong-lap-do-while/index.html","__dataUrl":"/data/96529.json"}