{"head":{"title":"4.1 Kiểu kí tự","route":"4/1-kieu-ki-tu","id":30018,"description":"//check if there is any character exist in stdin file object if (!cin.eof())\t{ \tcout &lt;&lt; \"There are some character more in stdin file…"},"body":"<h4>Chào mừng các bạn đến với bài học tiếp theo trong khóa học lập trình ngôn ngữ C++ hướng thực hành.</h4>\n<p>Trong hầu hết tất cả các bài học trước đây, chúng ta chỉ làm việc cùng nhau trên kiểu dữ liệu số. Chúng ta sử dụng các biến lưu trữ giá trị số (số nguyên <strong>int</strong>, số thực như <strong>float</strong> hoặc <strong>double</strong>, ...) để phục vụ cho việc tính toán toán học, giải quyết các bài toán đơn giản là chủ yếu. </p>\n<p>Trong bài học ngày hôm nay, chúng ta sẽ tìm hiểu một kiểu dữ liệu cũng là một trong những kiểu dữ liệu cơ bản trong ngôn ngữ C và C++, đó là <strong>kiểu kí tự</strong>.</p>\n<h3>Kiểu kí tự là gì?</h3>\n<p>Cũng tương tự như các kiểu dữ liệu số (<strong>int32_t</strong>, <strong>float</strong>, <strong>uint64_t</strong>, ...), kiểu kí tự là một kiểu dữ liệu có độ lớn <strong>1 byte (8 bits)</strong> dùng để lưu trữ 1 kí tự trong vùng nhớ máy tính. Kí tự có thể là các chữ cái đơn trong bảng chữ cái (a, b, c, ... x, y z), có thể là các kí hiệu toán học (+, -, *, /, ...), hay có thể là những con số (0, 1, 2, ..., 9)...</p>\n<p><em>Một đặc điểm của kiểu kí tự là có thể hiển thị được lên màn hình.</em></p>\n<p>Trong C/C++, kiểu kí tự có thể lưu trữ <strong>1 kí tự</strong> trong bảng mã <strong>ASCII</strong>.</p>\n<p>Đây là bảng mã kí tự <strong>ASCII</strong> đầy đủ:</p>\n<p><div class=\"lightbox-wrapper\"><a href=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/4-nang-cao-ve-bien-va-kieu-du-lieu/4-1-kieu-ki-tu/ascii.png\" class=\"lightbox\" title=\"ascii.png\" rel=\"nofollow\"><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/4-nang-cao-ve-bien-va-kieu-du-lieu/4-1-kieu-ki-tu/ascii.png\" width=\"690\" height=\"254\"><div class=\"meta\">\n<span class=\"filename\">ascii.png</span><span class=\"informations\">1782x657</span><span class=\"expand\"></span>\n</div></a></div></p>\n<p>Bảng mã <strong>ASCII</strong> được chia làm 2 cột: </p>\n<ul>\n<li>Cột <strong>Code</strong> là số thứ tự của kí tự trong bảng mã <strong>ASCII</strong>. </li>\n<li>Cột <strong>Symbol</strong> là kí tự được chuyển đổi từ mã <strong>Code</strong> sang dạng có thể đọc được.</li>\n</ul>\n<h3>Khai báo biến kiểu kí tự như thế nào?</h3>\n<p>Để khai báo biến kiểu kí tự trong C/C++, ta dùng từ khóa <strong>char</strong> như sau:</p>\n<pre><code>char character; //declare a variable type char\nchar ch(65); //declare a variable type char and initialze with ASCII code\nchar a = 'a'; //declare a variable type char and initialize with a symbol of ASCII table</code></pre>\n<p>Cú pháp hoàn toàn giống việc thực hiện khai báo biến thông thường.</p>\n<p>Biến kiểu kí tự (<strong>char</strong>) thực tế cũng là một kiểu số nguyên kích thước 1 byte (tương đương với <strong>int8_t</strong>), nó lưu trữ giá trị là mã <strong>Code</strong> của kí tự đó, nhưng khi hiển thị lên màn hình, nó cho ra kết quả là kí tự (<strong>Symbol</strong>) chứ không in ra mã ASCII của kí tự đó.</p>\n<p>Vì thế, chúng ta có thể khởi tạo cho biến kiểu <strong>char</strong> bằng cách gán một kí tự đặt giữa cặp dấu nháy đơn. Ví dụ: </p>\n<pre><code>char ch = 'a';\nch = 'b';</code></pre>\n<p>hoặc cũng có thể gán trực tiếp mã Code của kí tự đó trong bảng mã ASCII. Ví dụ:</p>\n<pre><code>char ch = 97; //kí tự 'a' trong bảng mã ASCII có mã là 97\nch = 98; //kí tự 'b' trong bảng mã ASCII có mã là 98</code></pre>\n<h3>In biến kiểu kí tự ra màn hình</h3>\n<p>Để in một kí tự ra màn hình, chúng ta có thể thực hiện bằng nhiều cách khác nhau:</p>\n<ul><li>\n<p>In trực tiếp một kí tự đặt trong cặp dấu nháy đơn:</p>\n<pre><code>cout &lt;&lt; 'h' &lt;&lt; 'e' &lt;&lt; 'l' &lt;&lt; 'l' &lt;&lt; 'o' &lt;&lt; endl;</code></pre>\n</li></ul>\n<p>Ở câu lệnh trên, mình sử dụng đối tượng <strong>cout</strong> để in ra một dãy nhiều kí tự đơn nối tiếp nhau. Sau khi chạy chương trình, dòng lệnh trên sẽ in ra màn hình dãy kí tự <strong>hello</strong>.</p>\n<ul><li>\n<p>Sử dụng biến kiểu <strong>char</strong> để lưu trữ một kí tự:</p>\n<pre><code>char h = 'h', e = 'e', l = 'l', o = 'o';\ncout &lt;&lt; h &lt;&lt; e &lt;&lt; l &lt;&lt; l &lt;&lt; o &lt;&lt; endl;</code></pre>\n</li></ul>\n<p>Chúng ta có thể sử dụng lại nhiều lần 1 biến, nên mình chỉ cần khai báo 1 lần biến <strong>l</strong> để lưu trữ kí tự <strong>'l'</strong>. Câu lệnh trên cho kết quả hoàn toàn tương tự, dòng <strong>hello</strong> sẽ được in ra màn hình.</p>\n<ul><li>\n<p>In trực tiếp mã <strong>Code</strong> của kí tự trong bảng mã ASCII (nhưng ép về kiểu <strong>char</strong>):</p>\n<pre><code>cout &lt;&lt; static_cast&lt;char&gt;(67) &lt;&lt; static_cast&lt;char&gt;(43) &lt;&lt; static_cast&lt;char&gt;(43) &lt;&lt; endl;</code></pre>\n</li></ul>\n<p>Các bạn thử tra trong bảng mã <strong>ASCII</strong> xem thử hai số <strong>67</strong> và <strong>43</strong> đại diện cho 2 kí tự gì nhé, sau đó đoán xem kết quả in ra màn hình của dòng lệnh trên là gì.</p>\n<ul><li>\n<p>Chúng ta có thể in ra mã <strong>Code</strong> của 1 biến kí tự:</p>\n<pre><code>char ch = 'V';\ncout &lt;&lt; static_cast&lt;int16_t&gt;(ch) &lt;&lt; endl;</code></pre>\n</li></ul>\n<p>Bằng cách ép kiểu của biến <strong>ch</strong> về kiểu số nguyên, chương trình sẽ in ra 1 con số là số thứ tự của kí tự đó trong bảng mã <strong>ASCII</strong>.</p>\n<p>Như mình đã nói, kiểu kí tự (<strong>char</strong>) hoàn toàn là kiểu số nguyên (<strong>int8_t</strong>). Để in ra kí tự đại diện cho số nguyên đó, chúng ta cần định dạng cho nó là kiểu kí tự (<strong>char</strong>) thì compiler mới hiểu là chúng ta đang cần hiển thị kí tự chứ không phải con số.</p>\n<p><strong>Bây giờ chúng ta thử in ra toàn bộ bảng mã <em>ASCII</em> trên màn hình dưới dạng</strong> </p>\n<p><code>&lt;Code&gt;: &lt;Symbol&gt;</code> </p>\n<p>bằng cách sử dụng 1 vòng lặp <strong>for</strong> để in ra toàn bộ kí tự từ mã <strong>0</strong> đến mã <strong>127</strong>.</p>\n<pre><code>cout &lt;&lt; \"Code\" &lt;&lt; '\\t' &lt;&lt; \"Symbol\" &lt;&lt; endl;\nfor(int16_t ascii_code = 0; ascii_code &lt;= 127; ascii_code++)\t{\n\tcout &lt;&lt; ascii_code &lt;&lt; '\\t' &lt;&lt; static_cast&lt;char&gt;(ascii_code) &lt;&lt; endl;\n}</code></pre>\n<p>Và kết quả in ra màn hình:</p>\n<p><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/4-nang-cao-ve-bien-va-kieu-du-lieu/4-1-kieu-ki-tu/0.png\" width=\"673\" height=\"337\"></p>\n<p><em>Chắc các bạn còn nhớ kí tự đặc biệt <strong>'\\t'</strong> tương đương với 1 Tab trên màn hình console. Nếu không nhớ thì cũng không sao, mình sẽ nhắc lại một chút ở phần bên dưới.</em></p>\n<p>Có một số mã <strong>Code</strong> cho ra kí tự khoảng trắng vì đó là những kí tự đặc biệt, ví dụ mã <strong>7</strong> đại diện cho 1 tiếng <strong>Beep</strong>, nên nó không có kí tự để in ra.</p>\n<h3>Nhập giá trị cho kiểu kí tự (char) từ bàn phím</h3>\n<p>Nhập kí tự từ bàn phím cũng tương tự việc nhập giá trị số từ bàn phím để gán cho biến. Chúng ta có thể sử dụng đối tượng <strong>cin</strong> như cách chúng ta sử dụng với biến số nguyên, số thực ...</p>\n<pre><code>char ch;\ncout &lt;&lt; \"Enter a character from your keyboard: \";\ncin &gt;&gt; ch;\ncout &lt;&lt; ch &lt;&lt; \" has ASCII code \" &lt;&lt; static_cast&lt;int16_t&gt;(ch) &lt;&lt; endl;</code></pre>\n<p>Các bạn cùng nhìn vào phần kết quả chương trình mình đã thực thi bên dưới:</p>\n<p><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/4-nang-cao-ve-bien-va-kieu-du-lieu/4-1-kieu-ki-tu/1.png\" width=\"674\" height=\"337\"></p>\n<p>Mình không thực hiện nhập 1 kí tự từ bàn phím, thay vào đó, mình nhập nhiều kí tự liên tiếp nhau, và điều gì xảy ra? Biến <strong>ch</strong> (kiểu <strong>char</strong>) chỉ nhận vào 1 kí tự duy nhất là kí tự đầu tiên mà mình nhập vào. </p>\n<p>Vậy thì những kí tự còn lại sẽ đi đâu? Nó vẫn còn được lưu trữ tạm thời bên trong đối tượng file <strong>stdin</strong>. Để kiếm chứng điều này, mình thêm một đoạn mã nhỏ sau khi in ra kí tự của biến <strong>ch</strong> trên màn hình:</p>\n<pre><code>char ch;\ncout &lt;&lt; \"Enter a character from your keyboard: \";\ncin &gt;&gt; ch;\ncout &lt;&lt; ch &lt;&lt; \" has ASCII code \" &lt;&lt; static_cast&lt;int16_t&gt;(ch) &lt;&lt; endl;\n<p>//check if there is any character exist in stdin file object\nif (!cin.eof())\t{\ncout &#x3C;&#x3C; \"There are some character more in stdin file object\" &#x3C;&#x3C; endl;\n}</code></pre></p>\n<p>Nếu <strong>cin.eof()</strong> trả về giá trị là đúng, điều này có nghĩa chúng ta đã lấy hết kí tự trong đối tượng file <strong>stdin</strong> ra và đọc được kí tự kết thúc file (<strong>EOF</strong> = End of file). Vì thế, nếu điều này không xảy ra, tức là <strong>!cin.eof()</strong> là đúng, nghĩa là vẫn còn kí tự bên trong đối tượng file <strong>stdin</strong>.</p>\n<p>Mình sẽ chạy lại chương trình với đoạn mã mà mình vừa thêm vào để các bạn cùng xem kết quả:</p>\n<p><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/4-nang-cao-ve-bien-va-kieu-du-lieu/4-1-kieu-ki-tu/2.png\" width=\"675\" height=\"338\"></p>\n<p>Mình nhập vào \"<strong>Le Tran Dat</strong>\" và biến ch (kiểu <strong>char</strong>) nhận vào kí tự đầu tiên (kí tự <strong>'L'</strong>), chương trình thông báo tiếp vẫn còn kí tự tồn tại bên trong đối tượng file <strong>stdin</strong>.</p>\n<p>Vì thế, khi chúng ta tiếp tục thêm vào dòng lệnh nhập kí tự khác phía sau đoạn chương trình trên, nó sẽ không dừng lại chờ người dùng nhập kí tự nữa mà nó lấy luôn kí tự tiếp theo trong đối tượng file <strong>stdin</strong> để đưa vào biến. Các bạn cùng chạy đoạn mã lệnh sau để kiểm chứng kết quả:</p>\n<pre><code>char ch;\ncout &lt;&lt; \"Enter a character from your keyboard: \";\ncin &gt;&gt; ch;\ncout &lt;&lt; ch &lt;&lt; \" has ASCII code \" &lt;&lt; static_cast&lt;int16_t&gt;(ch) &lt;&lt; endl;\n<p>//check if there is any character exist in stdin file object\nif (!cin.eof())\t{\ncout &#x3C;&#x3C; \"There are some character more in stdin file object\" &#x3C;&#x3C; endl;\n}</p>\n<p>//Continue reading a character from stdin file object\nchar next_ch;\ncin >> next_ch;\ncout &#x3C;&#x3C; \"The next character is \" &#x3C;&#x3C; next_ch &#x3C;&#x3C; endl;</code></pre></p>\n<p>Và đây là những gì chương trình cho ra kết quả:</p>\n<p><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/4-nang-cao-ve-bien-va-kieu-du-lieu/4-1-kieu-ki-tu/3.png\" width=\"666\" height=\"336\"></p>\n<p>Biến <strong>ch</strong> nhận vào kí tự đầu tiên là <strong>'L'</strong>, biến <strong>next_ch</strong> lấy ngay kí tự <strong>'e'</strong> mà không đợi người dùng nhập thêm kí tự khác.</p>\n<p>Sẽ có trường hợp chúng ta chỉ muốn nhận vào biến kí tự đầu tiên chúng ta nhập vào, những kí tự thừa phía sau có thể là do chúng ta nhấn nhầm phím nào đó, và chúng ta muốn loại bỏ những kí tự thừa đi để nhập lại kí tự khác cho biến char tiếp theo. Trong trường hợp này, có hai cách để thực hiện xóa toàn bộ dữ liệu đang tồn tại trong đối tượng file <strong>stdin</strong>:</p>\n<ul><li>Sử dụng hàm <code>fflush(FILE *file)</code>:</li></ul>\n<p>Đây là một hàm được định nghĩa trong ngôn ngữ C, nhưng chúng ta hoàn toàn có thể sử dụng nó trong ngôn ngữ C++. Hàm <code>fflush</code> nhận vào một đối tượng file mà chúng ta muốn xóa dữ liệu bên trong nó (trong trường hợp này là đối tượng file <strong>stdin</strong>).</p>\n<pre><code>fflush(stdin); //Add this command line where you want to clear all data in stdin file object</code></pre>\n<ul><li>Sử dụng phương thức <code>ignore</code> của đối tượng <strong>cin</strong> để bỏ qua toàn bộ kí tự bên trong đối tượng file <strong>stdin</strong>:</li></ul>\n<p>Phương thức <code>ignore</code> này nhận vào 2 đối số là số kí tự nó sẽ bỏ qua, và kí tự khiến lệnh này dừng lại khi gặp phải trong đối tượng file <strong>stdin</strong>, ở đây mình sử dụng kí tự <strong>'\\n'</strong> là kí tự được tạo ra khi nhấn phím <strong>Enter</strong>.</p>\n<pre><code>cin.ignore( INT64_MAX, '\\n');</code></pre>\n<p><strong>Sau khi sử dụng một trong hai cách trên, lần yêu cầu nhập dữ liệu từ bàn phím tiếp theo (thông qua đối tượng <em>cin</em>) sẽ phải thực hiện nhập lại từ đầu.</strong></p>\n<h3>Một cách nhập dữ liệu khác cho kiểu kí tự (char)</h3>\n<p>Cũng sử dụng đối tượng <strong>cin</strong> thuộc thư viện <strong>iostream</strong>, nhưng không dùng toán tử <strong>&gt;&gt;</strong> mà sử dụng phương thức <strong>get</strong> của đối tượng <strong>cin</strong>. Có hai cách sử dụng phương thức <strong>get</strong> của đối tượng <strong>cin</strong> để nhập dữ liệu cho biến kiểu <strong>char</strong>, các bạn có thể nhớ 1 trong 2 cách mà bạn cảm thấy dễ hiểu nhất:</p>\n<pre><code>char ch;\nch = cin.get(); //get method return the character which you just entered\ncin.get(ch); //put a char variable into the brackets</code></pre>\n<p>Cả 2 cách trên đều cho ra kết quả tương đương nhau.</p>\n<h3>Escape sequences</h3>\n<p>Trong C/C++ có một số kí tự có ý nghĩa đặc biệt, nó được gọi là <strong>escape sequences</strong>. Một <strong>escape sequences</strong> bắt đầu bằng một dấu <strong>'\\'</strong> và theo sau là một kí tự hoặc con số.</p>\n<p><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/4-nang-cao-ve-bien-va-kieu-du-lieu/4-1-kieu-ki-tu/escape_sequences.png\" width=\"643\" height=\"310\"></p>\n<p>Ví dụ:</p>\n<pre><code>cout &lt;&lt; \"First line\\nSecond line\" &lt;&lt; endl;</code></pre>\n<p>Dòng lệnh trên sẽ cho ra output là:</p>\n<pre><code>First line\nSecond line</code></pre>\n<p>Hay dòng lệnh dưới đây:</p>\n<pre><code>cout &lt;&lt; \"First part\\tSecond part\" &lt;&lt; endl;</code></pre>\n<p>Sẽ cho chúng ta kết quả:</p>\n<pre><code>First part    Second part</code></pre>\n<p>Bạn chỉ có thể in ra kí tự nháy kép bằng cách thêm dấu backslash <strong>'\\'</strong> trước kí tự nháy kép trong dãy kí tự bạn muốn in ra.</p>\n<pre><code>cout &lt;&lt; \"This is \\\"quote\\\" text\" &lt;&lt; endl;</code></pre>\n<h3>Có một số bạn thắc mắc rằng, kí tự xuống dòng <strong>'\\n'</strong> và đối tượng <strong>endl</strong> trong thư viện iostream khác nhau như thế nào?</h3>\n<p>Khi sử dụng <strong>std::endl</strong> (sử dụng toán tử phạm vi để truy cập vào đối tượng <strong>endl</strong> bên trong namespace <strong>std</strong>), output sẽ được đẩy vào vùng bộ nhớ đệm, đối tượng <strong>cout</strong> có thể không chuyển text trực tiếp đến thiết bị đầu ra ngay lập tức. </p>\n<p>Cả kí tự '\\n' và đối tượng <strong>endl</strong> đều chuyển con trỏ đến vị trí đầu dòng tiếp theo, thêm vào đó, đối tượng <strong>endl</strong> đảm bảo thứ tự trên thiết bị đầu ra đúng với lúc nhập dữ liệu từ đầu vào.</p>\n<pre><code>cout &lt;&lt; endl;</code></pre>\n<p>tương đương với</p>\n<pre><code>cout &lt;&lt; '\\n' &lt;&lt; std::fflush;</code></pre>\n<p>Sử dụng đối tượng <strong>std::endl</strong> sẽ làm sạch luôn stream, trong khi đó, sử dụng kí tự <strong>'\\n'</strong> chỉ đơn giản là đưa kí tự xuống dòng lên màn hình.</p>\n<p>Câu trả lời ngắn gọn cho việc khi nào sử dụng <strong>std::endl</strong> và <strong>'\\n'</strong> là:</p>\n<ul>\n<li>Sử dụng <strong>std::endl</strong> khi bạn cần đảm bảo cho ra kết quả ngay lập tức, cụ thể khi làm việc trên các thiết bị đầu ra chậm.</li>\n<li>Sử dụng <strong>'\\n'</strong> cho các trường hợp còn lại.</li>\n</ul>\n<h3>Sự khác nhau khi đặt kí tự bên trong cặp dấu nháy đơn và cặp dấu nháy kép là gì?</h3>\n<p>Như đã học trong bài này, một biến kí tự (<strong>char</strong>) chỉ được dùng để đặc tả 1 kí tự trong bảng mã <strong>ASCII</strong>, và chúng ta luôn đặt 1 kí tự đơn bên trong 1 cặp dấu nháy đơn.</p>\n<pre><code>char ch('65');\nch = 'a';</code></pre>\n<p>Những kí tự được đặt bên trong cặp dấu nháy kép được gọi là chuỗi kí tự (<strong>string</strong>). Một <strong>string</strong> là một tập hợp các kí tự nối tiếp nhau. Ví dụ:</p>\n<pre><code>cout &lt;&lt; \"Hello everyone!\" &lt;&lt; endl; //Hello everyone is a string</code></pre>\n<p>Tất nhiên làm việc với chuỗi kí tự (<strong>string</strong>) sẽ phức tạp hơn, nên các bạn sẽ được học nó trong các bài học sau.</p>\n<h3>Do stupid thing with char type</h3>\n<p>Trước khi kết thúc bài học này, mình sẽ hướng dẫn các bạn làm một cái gì đó với kiểu kí tự (char) mà các bạn đã được học.</p>\n<p><strong><em>Mình muốn thực hiện nhập họ và tên của mình (Viết không dấu do bảng mã ASCII bị giới hạn) từ bàn phím. Xóa màn hình console đi và in ra lại họ tên mà mình vừa nhập từ bàn phím, nhưng in ra lần lượt từng kí tự, mỗi lần in kí tự sẽ tạm dừng trong một khoảng thời gian ngắn.</em></strong></p>\n<p>Để thực hiện được yêu cầu này, mình sẽ cung cấp cho các bạn một số chức năng cần thiết:</p>\n<ul><li><code>system(\"cls\");</code></li></ul>\n<p>Hàm này gọi đến lệnh <code>cls</code>, thực hiện xóa dữ liệu đã in ra trên console.</p>\n<ul><li><code>Sleep(DWORD miliseconds);</code></li></ul>\n<p>Hàm này sẽ tạm dừng mọi công việc thực hiện trên console trong một khoảng thời gian <strong>miliseconds</strong> mà bạn truyền vào. Để sử dụng hàm này cần thêm thư viện <strong>windows.h</strong> tại phần khai báo thư viện.</p>\n<p>Các bạn chưa được học cách để lưu trữ biến là một chuỗi các kí tự liên tiếp nhau, nên việc lưu trữ dãy kí tự tên của bạn bên trong biến là rất khó khăn. Chúng ta chỉ mới biết đến cách lưu trữ 1 kí tự bên trong 1 biến kiểu <strong>char</strong>. </p>\n<p>Nhưng thử nhớ lại những điều mình đã nói, khi thực hiện nhập kí tự từ bàn phím mà bạn nhập thừa kí tự thì điều gì xảy ra? Những kí tự thừa vẫn còn lưu trữ bên trong đối tượng file <strong>stdin</strong>, vì thế, chúng ta chỉ cần lấy những kí tự đó ra 1 lần nữa thông qua đối tượng <strong>cin</strong>.</p>\n<p>Ban đầu, chúng ta yêu cầu người dùng nhập tên đầy đủ của mình vào:</p>\n<pre><code>char ch;\ncout &lt;&lt; \"Enter your full name: \";\ncin &gt;&gt; ch;</code></pre>\n<p>Kí tự đầu tiên mà bạn nhập sẽ lưu vào biến <strong>ch</strong>, những kí tự còn lại vẫn lưu trong đối tượng file <strong>stdin</strong>.</p>\n<p>Tiếp theo, chúng ta thực hiện xóa màn hình console:</p>\n<pre><code>system(\"cls\");</code></pre>\n<p>Công việc còn lại, chúng ta lấy lần lượt từng kí tự vẫn được lưu trong đối tượng file <strong>stdin</strong> cho đến khi gặp kí tự xuống dòng <strong>'\\n'</strong> hoặc kí tự kết thúc file <strong>EOF</strong>. Các bạn nhớ phải in kí tự đã lưu trong biến <strong>ch</strong> ra trước rồi mới đọc tiếp vào nhé.</p>\n<pre><code>do\n{\n\tSleep(50); //Pause the program for 50 miliseconds\n\tcout &lt;&lt; ch;\n\tch = cin.get();\n} while (ch != '\\n' &amp;&amp; ch != EOF);</code></pre>\n<p>Vòng lặp trên sẽ dừng khi biến <strong>ch</strong> nhận được kí tự xuống dòng <strong>'\\n'</strong> (lúc bạn nhấn Enter để kết thúc nhập) hoặc kí tự kết thúc file <strong>EOF</strong>.</p>\n<p>Kết hợp những phần trên thành một chương trình hoàn chỉnh:</p>\n<pre><code>#include &lt;iostream&gt;\n#include &lt;Windows.h&gt;\nusing namespace std;\n<p>int main()\n{\nchar ch;\ncout &#x3C;&#x3C; \"Enter your full name: \";\ncin >> ch;</p>\n<pre><code>system(\"cls\");\n\ndo\n{\n    cout &#x26;lt;&#x26;lt; ch;\n    ch = cin.get();\n    Sleep(50);\n} while (ch != '\\n' &#x26;amp;&#x26;amp; ch != EOF);\ncout &#x26;lt;&#x26;lt; endl;\n\nsystem(\"pause\");\nreturn 0;\n</code></pre>\n<p>}</code></pre></p>\n<p>Các bạn thử chạy chương trình, nhập full-name của các bạn vào xem điều gì xảy ra nhé!</p>\n<hr>\n<p><strong>Hẹn gặp lại các bạn trong bài học tiếp theo trong khóa học lập trình C++ hướng thực hành.</strong></p>\n<p>Mọi ý kiến đóng góp hoặc thắc mắc có thể đặt câu hỏi trực tiếp tại diễn đàn </p>\n<p><a title=\"DayNhauHoc\" class=\"onebox\" target=\"_blank\">www.daynhauhoc.com</a></p>\n<hr>\n<h3>Link Videos khóa học</h3>\n<p><a href=\"https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview\" class=\"onebox\" target=\"_blank\" rel=\"nofollow\">https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview</a></p>\n","__filename":"generated/30018.md","__url":"/4/1-kieu-ki-tu/","__resourceUrl":"/4/1-kieu-ki-tu/index.html","__dataUrl":"/4/1-kieu-ki-tu/index.html.3d3eff45a05d59492b7b40b7e7817293.json"}