{"head":{"title":"2.1 Giới thiệu một số cấu trúc điều khiển","route":"2/1-gioi-thieu-mot-so-cau-truc-dieu-khien","id":30007,"description":"int main() { \tcout &lt;&lt; \"This line is printed out.\" &lt;&lt; endl; \texit(-1); //Terminate and return -1 to operating system.  \tcout…"},"body":"<h4>Chào các bạn! Rất vui khi được gặp lại các bạn trong khóa học lập trình trực tuyến ngôn ngữ C++.</h4>\n<p>Như chúng ta đã tìm hiểu, khi chạy một chương trình C++, CPU bắt đầu thực thi các câu lệnh tại điểm trên cùng của hàm <strong>main</strong>, thực hiện lần lượt các câu lệnh từ trên xuống dưới, và kết thúc tại điểm dưới cùng của hàm <strong>main</strong>. Chuỗi các câu lệnh được CPU thực thi gọi là <strong>program's path</strong>. Phần lớn các chương trình mà bạn từng thấy được thực thi theo dạng <strong>straight-line</strong> (tuần tự từ trên xuống dưới). Tuy nhiên, trong một số trường hợp, đây không phải là điều chúng ta muốn.</p>\n<p>Ví dụ nếu chúng ta yêu cầu người dùng đưa ra một lựa chọn, và người dùng nhập vào lựa chọn không phù hợp, chúng ta nên yêu cầu người dùng đưa ra một lựa chọn khác. Với cấu trúc chương trình dạng <strong>straight-line</strong>, điều này là bất khả thi.</p>\n<p>Một trường hợp khác, chúng ta muốn chương trình thực hiện lặp đi lặp lại một công việc nào đó với số lần thực hiện chưa biết trước. Ví dụ chúng ta muốn in ra điểm số của một trò chơi trên màn hình cho đến khi trò chơi kết thúc, chúng ta không thể biết chính xác thời điểm kết thúc trò chơi là khi nào.</p>\n<p>Do đó, ngôn ngữ C++ cung cấp các cấu trúc điều khiển <strong>(control flow statements)</strong> nó cho phép lập trình viên thay đổi hướng đi của chương trình. Có một số dạng cấu trúc điều khiển khác nhau và mình sẽ giới thiệu sơ lược để các bạn có sự hình dung ban đầu.</p>\n<h3>Halt</h3>\n<p>Cấu trúc điều khiển dừng (<strong>halt</strong>) là một cấu trúc thường gặp, nó yêu cầu chương trình ngừng làm việc ngay lập tức. Trong C++, cấu trúc <strong>Halt</strong> có thể được thực hiện thông qua hàm <strong>exit()</strong> trong thư viện <strong>cstdlib</strong>. Hàm exit nhận vào một giá trị số nguyên và nó sẽ được trả về cho hệ điều hành như một mã kết thúc chương trình, tương tự như giá trị trả về của hàm <strong>main</strong>.</p>\n<p>Đây là đoạn chương trình mẫu cho việc thực hiện cấu trúc điều khiển <strong>Halt</strong>:</p>\n<pre><code>#include &lt;iostream&gt;\n#include &lt;cstdlib&gt;\nusing namespace std;\n<p>int main()\n{\ncout &#x3C;&#x3C; \"This line is printed out.\" &#x3C;&#x3C; endl;\nexit(-1); //Terminate and return -1 to operating system.\ncout &#x3C;&#x3C; \"This line will never be printed out.\" &#x3C;&#x3C; endl;</p>\n<pre><code>system(\"pause\");\nreturn 0;\n</code></pre>\n<p>}</code></pre></p>\n<h3>Jumps</h3>\n<p>Cấu trúc điều khiển tiếp theo mình muốn đề cập đến là <strong>Jump</strong>. Cấu trúc Jump không điều kiện khiến CPU nhảy đến thực thi một số các câu lệnh khác. <strong>goto, break, continue</strong> là các từ khóa được sử dụng trong cấu trúc Jump, chúng có kiểu Jump khác nhau, chúng ta sẽ được tìm hiểu chi tiết trong các bài học sắp tới.</p>\n<h3>Cấu trúc rẽ nhánh có điều kiện</h3>\n<p>Cấu trúc rẽ nhánh có điều kiện khiến chương trình thay đổi hướng thực thi dựa trên giá trị của biểu thức điều kiện (hoặc các mệnh đề). Tiêu biểu cho cấu trúc rẽ nhánh là <strong>câu lệnh if</strong>. </p>\n<pre><code>int main()\n{\n\t//do A\n<pre><code>if(expression)  \n    //do B;\nelse\n    //do C;\n\n//do D\n\nreturn 0;\n</code></pre>\n<p>}</code></pre></p>\n<p>Chương trình này có 2 hướng có thể đi. Nếu biểu thức expression cho kết quả đúng (<strong>true</strong>), chương trình sẽ thực thi A rồi đến B và đến D. Nếu biểu thức expression cho kết quả sai (<strong>false</strong>), chương trình sẽ đi theo hướng A đến C rồi đến D. Cấu trúc này không còn dạng <strong>straight-line</strong> nữa mà là dạng cấu trúc rẽ nhánh (<strong>conditional branches</strong>).</p>\n<h3>Cấu trúc vòng lặp (Loops)</h3>\n<p>Một cấu trúc vòng lặp khiến chương trình thực hiện lặp đi lặp lại một chuỗi các câu lệnh cho đến khi không còn thõa mãn một điều kiện nào đó.</p>\n<pre><code>int main()\n{\n\t//do A\n\t//do B 0 or more times\n\t//do C\n}</code></pre>\n<p>Chương trình này có thể thực hiện theo hướng ABC, ABBC, ABBBC, ABBB...BBBC, hoặc cũng có thể là AC. Như các bạn thấy, một lần nữa đây không phải là <strong>straight-line program</strong>, hướng thực thi các câu lệnh phụ thuộc vào số lần các câu lệnh trong vòng lặp được thực thi.</p>\n<p><strong>while, do...while, for</strong> là 3 cấu trúc vòng lặp mà ngôn ngữ C/C++ cung cấp. Chuẩn C++11 còn cung cấp cho chúng ta thêm cấu trúc vòng lặp tên là <strong>for each</strong>.</p>\n<h3>Exceptions</h3>\n<p>Cuối cùng, <strong>exceptions</strong> là một cơ chế xử lý lỗi xảy ra bên trong hàm. Nếu một lỗi xảy ra bên trong hàm mà hàm không thể xử lý, hàm đó ném ra một ngoại lệ (exception). Điều này khiến chương trình nhảy đến khối lệnh chuyên dùng để xử lý ngoại lệ có kiểu tương ứng với ngoại lệ được hàm ném ra.</p>\n<p>Xử lý ngoại lệ là một đặc trưng khá mới được hổ trợ trong ngôn ngữ C++.</p>\n<h2></h2>\n<h3>Kết luận</h3>\n<p>Mình vừa giới thiệu đến các bạn một số cấu trúc điều khiển thông dụng trong ngôn ngữ C++. Trong chương này, chúng ta sẽ tập trung nói về cấu trúc rẽ nhánh. Các phần còn lại sẽ được bàn đến trong các chương tiếp theo.</p>\n<hr>\n<p>P/s: <strong>Hẹn gặp lại các bạn trong bài học tiếp theo trong khóa học lập trình C++ hướng thực hành.</strong></p>\n<p>Mọi ý kiến đóng góp hoặc thắc mắc có thể đặt câu hỏi trực tiếp tại diễn đàn </p>\n<p><strong><a href=\"http://www.daynhauhoc.com\">www.daynhauhoc.com</a></strong></p>\n<hr>\n<h3>Link Videos khóa học</h3>\n<p><a href=\"https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview\" class=\"onebox\" target=\"_blank\" rel=\"nofollow\">https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview</a></p>\n","__filename":"generated/30007.md","__url":"/2/1-gioi-thieu-mot-so-cau-truc-dieu-khien/","__resourceUrl":"/2/1-gioi-thieu-mot-so-cau-truc-dieu-khien/index.html","__dataUrl":"/2/1-gioi-thieu-mot-so-cau-truc-dieu-khien/index.html.1d4fd6576fff1c9f6ebbde9296cb7ccf.json"}