{"head":{"title":"7.5 Function overloading","route":"7/5-function-overloading","id":30477,"description":"float addFloat(float f1, float f2) { \treturn f1 + f2; } float add(float f1, float f2) { \treturn f1 + f2; } print(0); print('a'); print('a');"},"body":"\n<h4>Chào các bạn! Chúng ta cùng tiếp tục đồng hành trong khóa học lập trình trực tuyến ngôn ngữ C++.</h4>\n\n<p>Trong bài học này, chúng ta cùng tìm hiểu về kĩ thuật <strong>Function overloading</strong>. Kĩ thuật này chỉ được cho phép trong ngôn ngữ C++, không thể áp dụng vào ngôn ngữ C.</p>\n\n<h3>Function overloading</h3>\n\n<p>Function overloading là một đặc trưng của ngôn ngữ C++, nó cho phép lập trình viên tạo ra nhiều hàm có cùng tên, với điều kiện các hàm này khác số lượng tham số hoặc kiểu tham số.</p>\n\n<p>Thử xem xét hàm bên dưới:</p>\n\n<pre><code>int add(int i1, int i2)\n{\n\treturn i1 + i2;\n}</code></pre>\n\n<p>Hàm đơn giản này nhận vào 2 tham số kiểu số nguyên và trả về kết quả là tổng của 2 số nguyên được truyền vào. Vấn đề đặt ra là <strong>nếu chúng ta cần cộng 2 số thực</strong>? Hàm add trên hoàn toàn không phù hợp vì giá trị số thực truyền vào sẽ bị chuyển thành số nguyên, gây ra sai sót khi giá trị cần tính bị mất đi phần thập phân.</p>\n\n<p>Cách dễ thấy nhất là định nghĩa thêm 1 hàm khác có 2 tham số kiểu số thực:</p>\n\n<pre><code>int addInteger(int i1, int i2)\n{\n\treturn i1 + i2;\n}\n\nfloat addFloat(float f1, float f2)\n{\n\treturn f1 + f2;\n}</code></pre>\n\n<p>Điều này có thể khiến chúng ta vất vả hơn khi phải nhớ chính xác tên hàm cần gọi.  <strong>Function overloading</strong> cung cấp cho bạn giải pháp tốt hơn để xử lý vấn đề này. Sử dụng kĩ thuật <strong>function overloading</strong>, bạn có thể định nghĩa nhiều hàm add với những kiểu dữ liệu đầu vào khác nhau.</p>\n\n<pre><code>int add(int i1, int i2)\n{\n\treturn i1 + i2;\n}\n\nfloat add(float f1, float f2)\n{\n\treturn f1 + f2;\n}</code></pre>\n\n<p>Lúc này, chúng ta có 2 phiên bản khác nhau của hàm <strong>add</strong>.</p>\n\n<pre><code>int add(int i1, int i2); //int version\nfloat add(float f1, float f2); //float version</code></pre>\n\n<p>2 phiên bản này cùng tên với nhau, nhưng hoàn toàn là 2 hàm riêng biệt với địa chỉ khác nhau trong vùng nhớ.</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/7-co-ban-ve-ham/7-5-nap-chong-ham/0.png?raw=true\" width=\"677\" height=\"343\"></p>\n\n<p><strong><em>Việc quyết định cần gọi đến phiên bản hàm nào phụ thuộc vào đối số mà bạn truyền vào khi gọi hàm.</em></strong></p>\n\n<p>Nếu bạn cung cấp 2 đối số kiểu số nguyên, phiên bản <strong>add(int i1, int i2)</strong> sẽ được sử dụng. Ngược lại, nếu bạn truyền vào 2 số thực, C++ sẽ biết rằng cần phải gọi phiên bản kiểu số thực. Và chúng ta còn có thể định nghĩa thêm nhiều hàm có tên <strong>add</strong> nữa, với điều kiện những hàm này có số lượng tham số khác nhau hoặc khác về kiểu dữ liệu của tham số. Ví dụ:</p>\n\n<pre><code>int add(int i1, int i2, int i3)\n{\n\treturn i1 + i2 + i3;\n}</code></pre>\n\n<p>Khi bạn truyền vào 3 đối số kiểu số nguyên, phiên bản hàm add với 3 tham số sẽ được gọi thay cho phiên bản có 2 tham số kiểu số nguyên.</p>\n\n<h3>Overloading considerations</h3>\n\n<p>Chúng ta cùng xem xét một số cách sử dụng hợp lệ của kĩ thuật <strong>Function overloading</strong> trong C++.</p>\n\n<p><img src=\"https://github.com/nguyenchiemminhvu/CPP-Tutorial/blob/master/7-co-ban-ve-ham/7-5-nap-chong-ham/1.png?raw=true\" width=\"371\" height=\"329\"></p>\n\n<p>Đây là bảng tham khảo những thành phần của hàm được cho phép áp dụng vào kĩ thuật <strong>Function overloading</strong>. Như chúng ta thấy, hàm không thể được overload bằng cách sử dụng các kiểu trả về khác nhau.</p>\n\n<p>Thử xem xét trường hợp bạn muốn viết 1 hàm trả về một giá trị ngẫu nhiên, nhưng bạn cần một phiên bản trả về kiểu số nguyên, một phiên bản khác trả về kiểu số thực.</p>\n\n<pre><code>int getRandom();\nfloat getRandom();</code></pre>\n\n<p>Trong trường hợp này, compiler sẽ báo lỗi, vì hai phiên bản này có cùng kiểu tham số là <strong>void</strong>. Do đó, hai hàm này cần được đặt bằng 2 tên khác nhau.</p>\n\n<h3>Cách chọn hàm tương ứng với những hàm được overload</h3>\n\n<p>Thực hiện 1 lời gọi hàm với những hàm đã được overload sẽ xảy ra 3 trường hợp:</p>\n\n<p><strong>Một phiên bản phù hợp được tìm thấy.</strong></p>\n\n<pre><code>void print(char value);\nvoid print(int value);\n\nprint(0);</code></pre>\n\n<p>Mặc dù giá trị 0 có thể dùng để gán cho 1 biến kiểu kí tự, nhưng C++ nhận dạng được phiên bản hàm print nhận tham số kiểu int phù hợp hơn. Do đó, <strong>print(int)</strong> sẽ được sử dụng trong trường hợp này.</p>\n\n<p><strong>Không tìm thấy phiên bản nào phù hợp.</strong></p>\n\n<p>Khi không tìm thấy phiên bản nào có tham số phù hợp hoàn toàn, C++ sẽ tìm đến những phiên bản hàm mà đối số có thể phù hợp thông qua ép kiểu.</p>\n\n<ul>\n<li>Char, unsigned char, short sẽ được ép kiểu ngầm định sang int.</li>\n<li>Unsigned short có thể tự ép kiểu ngầm định sang int hoặc unsigned int, tùy vào kích thước của giá trị.</li>\n<li>Float có thể tự ép kiểu ngầm định sang double.</li>\n</ul>\n\n<p>Ví dụ:</p>\n\n<pre><code>void print(double value);\nvoid print(int value);\n\nprint('a');</code></pre>\n\n<p>Trong trường hợp này, không có phiên bản hàm nào có tham số kiểu char, kí tự 'a' sẽ được ép kiểu ngầm định sang int, do đó <strong>print(int)</strong> sẽ được gọi.</p>\n\n<p><strong>Tìm thấy nhiều hơn 1 phiên bản phù hợp nhưng không rõ ràng</strong></p>\n\n<p>Ví dụ:</p>\n\n<pre><code>void print(string s);\nvoid print(float f);\n\nprint('a');</code></pre>\n\n<p>Trong trường hợp này, không có phiên bản hàm print(char), và cũng không có print(int) để thực hiện ép kiểu ngầm định, kí tự 'a' sẽ được ép về kiểu float để phù hợp với print(float).</p>\n\n<h3>Tổng kết</h3>\n\n<p>Kỹ thuật Function overloading có thể khiến chương trình trở nên phức tạp và nguy hiểm khi để C++ ép kiểu tự động. Do đó, chúng ta nên tìm cách đặt tên hàm sao cho phù hợp thay vì tận dụng khả năng overloading của ngôn ngữ C++.</p>\n\n<hr>\n\n<p><strong>Hẹn gặp lại các bạn trong bài học tiếp theo trong khóa học lập trình C++ hướng thực hành.</strong></p>\n\n<p>Mọi ý kiến đóng góp hoặc thắc mắc có thể đặt câu hỏi trực tiếp tại diễn đàn.</p>\n\n<p><a title=\"DayNhauHoc\" class=\"onebox\" target=\"_blank\">www.daynhauhoc.com</a></p>\n\n<hr>\n\n<h3>Link Videos khóa học</h3>\n\n<p><a href=\"https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview\" class=\"onebox\" target=\"_blank\" rel=\"nofollow\">https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview</a></p>\n","__filename":"generated/30477.md","__url":"/7/5-function-overloading/","__resourceUrl":"/7/5-function-overloading/index.html","__dataUrl":"/7/5-function-overloading/index.html.5657ec584a875acb4601350f19853ed3.json"}