{"head":{"title":"0.2 Giới thiệu về ngôn ngữ lập trình C++","route":"0/2-gioi-thieu-ve-ngon-ngu-lap-trinh-c","id":29448,"description":""},"body":"<p>Chúng ta đã tìm hiểu thế nào là ngôn ngữ lập trình trong <a href=\"//daynhauhoc.com/t/gioi-thieu-tong-quan-ve-khai-niem-ngon-ngu-lap-trinh/29425\">bài học trước</a>. Trong chủ đề này, chúng ta sẽ tiếp cận với một ngôn ngữ cụ thể mà các bạn sẽ được học trong khóa học này.</p>\n<h1>Đó là ngôn ngữ lập trình C++.</h1>\n<p>Cùng lướt qua những gì các bạn sẽ được học trong chủ đề này:</p>\n<ul>\n<li>C++ là gì?</li>\n<li>Tóm tắt lịch sử hình thành của ngôn ngữ C++.</li>\n<li>Một số đặc trưng của ngôn ngữ C++.</li>\n<li>Lý do chọn ngôn ngữ C++.</li>\n</ul>\n<h1>Lịch sử hình thành C++:</h1>\n<p> Trước C++, ngôn ngữ lập trình C được phát triển trong năm 1972 bởi Dennis Ritchie tại phòng thí nghiệm Bell Telephone, C chủ yếu là một ngôn ngữ lập trình hệ thống, một ngôn ngữ để viết ra hệ điều hành. Vào năm 1999, ủy ban ANSI đã phát hành một phiên bản mới của ngôn ngữ lập trình C, gọi là C99.</p>\n<p><a href=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/0-gioi-thieu-tong-quan/0-2-gioi-thieu-ngon-ngu-lap-trinh-cpp/0.png\" target=\"_blank\" rel=\"nofollow\"><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/0-gioi-thieu-tong-quan/0-2-gioi-thieu-ngon-ngu-lap-trinh-cpp/0.png\" width=\"259\" height=\"194\"></a></p>\n<p>(Bjarne Stroutrup)</p>\n<blockquote><p>C++ được tạo ra bởi Bjarne Stroustrup - một nhà khoa máy tính người Đan Mạch tại phòng thí nghiệm AT&amp;T Bell vào năm 1979, được ISO công nhận vào năm 1998, lần phê chuẩn tiếp theo vào năm 2003 (người ta gọi là C++ 03).</p></blockquote>\n<p> Hai lần cập nhật gần đây nhất là C++ 11 và C++ 14 (được phê chuẩn vào năm 2011 và 2014). Phiên bản C++ 17 đã được công bố, dự đoán sẽ hoàn thành trong năm 2017. C++ là một phiên bản mở rộng của ngôn ngữ lập trình C.</p>\n<h1>Một số đặc trưng của ngôn ngữ C++:</h1>\n<ul>\n<li>C++ là một ngôn ngữ lập trinh bậc trung. Nó có nghĩa là bạn có thể sử dụng C++ để phát triển những ứng dụng bậc cao, và cả những chương trình bậc thấp hoạt động tốt trên phần cứng.</li>\n<li>C++ là một ngôn ngữ lập trình hướng đối tượng. Khác với ngôn ngữ lập trình C - một ngôn ngữ lập trình hướng thủ tục, chương trình được tổ chức theo thuật ngữ \"chức năng\", một chức năng gồm có những hành động mà bạn muốn làm. C++ được thiết kế với một cách tiếp cận hoàn toàn mới được gọi là lập trình hướng đối tượng, nơi mà chúng ta sử dụng những đối tượng, các lớp và sử dụng các khái niệm như: thừa kế, đa hình, tính đóng gói, tính trừu tượng ... Những khái niệm này khá phức tạp, nên nếu bạn chưa hiểu về chúng, đừng lo lắng, chúng ta sẽ lần lượt làm rõ từng khái niệm trong mỗi bài học khác nhau.</li>\n<li>C++ là một ngôn ngữ lập trình hướng cấu trúc giống ngôn ngữ C, nó có nghĩa là chúng ta có thể tổ chức chương trình trên khái niệm functions.</li>\n<li>C++ có thể chạy trên nhiều nền tảng khác nhau như Windows, Mac OS, một số biến thể của UNIX...</li>\n</ul>\n<p><a href=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/0-gioi-thieu-tong-quan/0-2-gioi-thieu-ngon-ngu-lap-trinh-cpp/1.png\" target=\"_blank\" rel=\"nofollow\"><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/0-gioi-thieu-tong-quan/0-2-gioi-thieu-ngon-ngu-lap-trinh-cpp/1.png\" width=\"291\" height=\"220\"></a></p>\n<h1>Lý do chọn ngôn ngữ lập trình C++:</h1>\n<p>Như trong bài trước, mình đã nói về phương pháp để lựa chọn 1 ngôn ngữ lập trình phù hợp cho dự án và bản thân. Mỗi ngôn ngữ lập trình có thể thích hợp cho một số loại ứng dụng. Vậy trước khi bắt đầu học về ngôn ngữ C++, chúng ta cần biết C++ có thể làm được những gì.</p>\n<p>Theo <a href=\"https://www.quora.com/What-can-someone-do-using-C++\" rel=\"nofollow\">Adam Helps</a></p>\n<p>Ngôn ngữ lập trình C++ có thể được dùng để làm những công việc sau:</p>\n<ul>\n<li>C++ được thiết kế để viết những hệ thống lớn, thậm chí C++ được dùng để tạo nên hệ điều hành máy tính (Linux, Mac OS X, Windows...).</li>\n<li>C++ được dùng để tạo nên các game lớn của hãng Blizzard (World of Warcraft, Diablo series, StarCraft series...). Gần như toàn bộ các game bom tấn trên thị trường hiện nay cũng dùng C++ để phát triển. Một số công cụ sử dụng trong việc lập trình game có sử dụng C++ như Unreal engine, Cocos2d-x framework,... Các ông lớn trong ngành công nghiệp game như Valve, CryTek cũng sử dụng C++.</li>\n</ul>\n<p><a href=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/0-gioi-thieu-tong-quan/0-2-gioi-thieu-ngon-ngu-lap-trinh-cpp/2.png\" target=\"_blank\" rel=\"nofollow\"><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/0-gioi-thieu-tong-quan/0-2-gioi-thieu-ngon-ngu-lap-trinh-cpp/2.png\" width=\"690\" height=\"100\"></a></p>\n<p>Các thể loại game chơi trên Playstation, XBox, ... được tạo ra từ C++. Có thể thấy C++ là ngôn ngữ có truyền thống lâu đời trong ngành công nghiệp phát triển game.</p>\n<p><a href=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/0-gioi-thieu-tong-quan/0-2-gioi-thieu-ngon-ngu-lap-trinh-cpp/3.png\" target=\"_blank\" rel=\"nofollow\"><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/0-gioi-thieu-tong-quan/0-2-gioi-thieu-ngon-ngu-lap-trinh-cpp/3.png\" width=\"300\" height=\"180\"></a></p>\n<p>Các sản phẩm phần mềm nổi tiếng khác được phát triển bằng C++ như MS Office, Photoshop, Maya / 3ds, Auto CAD...</p>\n<p><a href=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/0-gioi-thieu-tong-quan/0-2-gioi-thieu-ngon-ngu-lap-trinh-cpp/4.png\" target=\"_blank\" rel=\"nofollow\"><img src=\"https://raw.githubusercontent.com/nguyenchiemminhvu/CPP-Tutorial/master/0-gioi-thieu-tong-quan/0-2-gioi-thieu-ngon-ngu-lap-trinh-cpp/4.png\" width=\"690\" height=\"407\"></a></p>\n<ul><li>C++ có thể được sử dụng ở phía Web server vì C++ có thể đáp ứng được yêu cầu về tốc độ xử lý, khả năng phản hồi nhanh.<br>Tuy rằng bên cạnh C++ còn có những ngôn ngữ lập trình khác như C#, Java, ... có thể làm được những ứng dụng lớn cho máy tính, nhưng đối với các ứng dụng có yêu cầu về mặt tốc độ xử lý, hoặc có tính thương mại cao, người ta vẫn ưu tiên C++.</li></ul>\n<p>Về phía học sinh, sinh viên, những người đến với khóa học này với mục đích muốn tìm hiểu 1 ngôn ngữ lập trình cơ bản thì việc học tốt C++ có thể làm nền tảng vững chắc để tiếp cận những ngôn ngữ lập trình khác một cách dễ dàng hơn. Bởi vì C++ có thể được sử dụng theo hướng lập trình hướng cấu trúc như C, cũng có thể sử dụng các khái niệm trong lập trình hướng đối tượng giống những ngôn ngữ mới sau này, nên C++ có thể dùng làm cầu nối giữa nhiều ngôn ngữ khác nhau. Một ví dụ điển hình, khi sử dụng Java trên Android Studio để phát triển ứng dụng trên điện thoại di động, chúng ta có thể tích hợp các thư viện được viết sẵn bằng ngôn ngữ C++ nhằm mục đích tối ưu hóa.</p>\n<p>Ở trên đây, mình vừa đưa ra một số công việc cần dùng đến ngôn ngữ lập trình C++. Nếu hướng đi trong lập trình của các bạn có liên quan đến các công việc trên, C++ có thể là một lựa chọn tốt cho bạn. </p>\n<hr>\n<p>P/s: Hẹn gặp lại các bạn trong bài học tiếp theo trong khóa học lập trình C++ hướng thực hành.</p>\n<p>Mọi ý kiến đóng góp hoặc thắc mắc có thể đặt câu hỏi trực tiếp tại diễn đàn</p>\n<p><a href=\"http://www.daynhauhoc.com\">www.daynhauhoc.com</a></p>\n<hr>\n<h3>Link Videos khóa học</h3>\n<p><a href=\"https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview\" class=\"onebox\" target=\"_blank\" rel=\"nofollow\">https://www.udemy.com/c-co-ban-danh-cho-nguoi-moi-hoc-lap-trinh/learn/v4/overview</a></p>\n","__filename":"generated/29448.md","__url":"/0/2-gioi-thieu-ve-ngon-ngu-lap-trinh-c/","__resourceUrl":"/0/2-gioi-thieu-ve-ngon-ngu-lap-trinh-c/index.html","__dataUrl":"/0/2-gioi-thieu-ve-ngon-ngu-lap-trinh-c/index.html.c812ae7d3909d89717f7e886ac243ab3.json"}